[
  {
    "entries": [
      {
        "comments": [
          {
            "comment": "love the intro so much. It just touch me deep inside. Her beauty is also outstanding, she is one in a million! So we’re gonna heal. We’re gonna start again. You’ve brought the orchestra, synchronized swimmers; you are a magician. Pull me back together again the way you cut me in half. Make the woman in doubt disappear. Pull the sorrow from between my legs like silk, knot after knot after knot. The audience applauds… but we can’t hear them.",
            "name": "Ola Burt",
            "id": 0
          },
          {
            "comment": "I every so often falter to her poems, rhythms and lyrics; loving the erection of my hairs standing so freely upon my temple. She's one of a kind and I'm so pleased to have met her several years ago. Such a brilliant beautiful woman.",
            "name": "Wilson Harrington",
            "id": 1
          },
          {
            "comment": "album of the year?? try album of the century",
            "name": "Tyson Gutierrez",
            "id": 2
          },
          {
            "comment": "SHE IS TRULY A GODDESS, OBSESSED WITH THIS",
            "name": "Carney Hughes",
            "id": 3
          },
          {
            "comment": "This and XO are like my top 2 fav songs from her. I love all of her songs",
            "name": "Kelly Richards",
            "id": 4
          },
          {
            "comment": "Can someone please just tell me when have they ever made a bad song because I can't find any that's just how good they are and his voice is just amazing",
            "name": "Ray Pena",
            "id": 5
          }
        ],
        "imgUrl": "a1097726293_10",
        "length": "03:32",
        "country": "RUS",
        "songtitle": "Leaving the House",
        "bandname": "Mørdegard",
        "id": 0
      },
      {
        "comments": [
          {
            "comment": "Wow ... This song is amazing, deserve more views and recognition damm!",
            "name": "Vincent Dodson",
            "id": 0
          },
          {
            "comment": "Anyone else hooked in the first few seconds?! Goosebumps! So good! Hey guys, I make music on my channel. A little love goes a long way",
            "name": "Puckett Cardenas",
            "id": 1
          },
          {
            "comment": "And then they went and wrote a musical based on this.  A prime example of why their songs hold up so well 40 years on.",
            "name": "Frederick Ashley",
            "id": 2
          },
          {
            "comment": "how to find a good band great original tracks that don't repeat the same 4 words. the artist preforming composed the song and they make you feel happy.",
            "name": "Obrien Wilkerson",
            "id": 3
          },
          {
            "comment": "I'm 15 and I love them. They are so much better than the artists of today.",
            "name": "Gallegos Stevenson",
            "id": 4
          },
          {
            "comment": "Great song, I was fine right up until the old guy...so...yeah that's where I'm at.",
            "name": "Tate Burgess",
            "id": 5
          },
          {
            "comment": "Although this project was created as a joke, it's way too good to ignore. Yes, purist Black Metallers will reject this and if you're thinking that this is a BM album, you'll be sorely disappointed. If you are however looking for something completely different, with genres ranging from staccato-styled rock, spiritual slave music, muslim-inspired trap-beats, Black Metal and soul, this might be your thing. I picked up both albums on Bandcamp and been listening to it for a few months by now. Whilst the first album is much more genre-blending, this second album has a lot more BM influences. Personal favorite top 3: Come On Down, Blood In The River, Death Of A Billion. I need a physical copy of this as well. Thanks for the music Manuel Gagneux!",
            "name": "Zamora Watson",
            "id": 6
          }
        ],
        "imgUrl": "a2934724457_10",
        "length": "03:50",
        "country": "USA",
        "songtitle": "Columbian Necktie",
        "bandname": "Wild Year",
        "id": 1
      },
      {
        "comments": [
          {
            "comment": "Incredible song, but let's admit it ... ! The instrumental part sounds too much amateur ... I mean, it´s VERY GOOD but we can sadly feel the lack of professional mixing & mastering ... Hopefully it will be resolved with the next brand new physical copies",
            "name": "Jenny Merrill",
            "id": 0
          },
          {
            "comment": "Well, this is different. I can dig it. The sound would be a lot better if they went for a Xasthur sound during the metal parts though.",
            "name": "Deena Harding",
            "id": 1
          },
          {
            "comment": "I don't know why this is such an odd combo for some. It's old school type blues which many metal and rock artists copied (Robert Johnson etc). But anyways spirituals and metal. Awesome combo.",
            "name": "Joyce Morin",
            "id": 2
          },
          {
            "comment": "The story behind this is glorious; Lead Michael Gagneux posted a request for genre mash-up suggestions; one individual posted \"Black Metal\", another posted \"nigger music\" (naturally, the forum being 4Chan). Little did the individual who posted the latter expect Gagneux to deliver in the purest sense- samples depicting enslaved African Americans launching a crescendo of subversive roars, all originally constructed by Gagneux himself.",
            "name": "Rogers Weeks",
            "id": 3
          }
        ],
        "imgUrl": "a0480551446_10",
        "length": "02:45",
        "country": "USA",
        "songtitle": "OPEN DOORS",
        "bandname": "Humbody",
        "id": 2
      },
      {
        "comments": [
          {
            "comment": "Holy balls, this is ingenious. I'd stick it right into a Bioshock: Infinite trailer, it gives me similar vibe to Nico Vega for some reason.",
            "name": "Jewel Rasmussen",
            "id": 0
          },
          {
            "comment": "Ohh my fucking god... It's amazing! I never heard anything like this before.Greetings from Hungary.",
            "name": "Rachael Sparks",
            "id": 1
          },
          {
            "comment": "i really really love these guys a friend of mine told me to check these guys and boy, im glad i did they are amazing!!!!!! i hope they come to america soon",
            "name": "Elaine Benton",
            "id": 2
          },
          {
            "comment": "I grew up in Russia, with my mom and grandma being deeply religious, and because of that I have been dragged into church as a kid quite often. There's something eerie and depressing about being inside of Orthodox Christian Church, hence why religious people always go there to grieve and be alone with their thoughts. The sole presence there definitely creates the mood that is very heavy-hearted and mentally pressing. That being said, I think adding black metal to that atmosphere is a great idea.",
            "name": "Bettie Dickerson",
            "id": 3
          },
          {
            "comment": "Cool especially since their music is so lyrically and thematically specific, you know Eastern Europe, anti Orthodox Christianity. Oh  and from what I've heard their live shows definitely are not something to miss.",
            "name": "Patty Hendrix",
            "id": 4
          },
          {
            "comment": "You know, I'm starting to think Black Metal is not actually that anti-Chistian. After all the character of Satan comes from Judeo-Christian mythology and all these Norwegian kids who wanted to play the bad guys actually supported this worldview instead of challenging it. What I find more interesting about BM is it's fascination with distant and forgotten past and it's spirituality and criticism of soulless modern world... and if at some point a branch of Christian culture starts to be seen as this \"voice of the past\" why not incorporate it into BM sound? Yeah I realize these guys are not Christians but this album still probably made a lot of trve kvlt warriors mad",
            "name": "Shepard Melton",
            "id": 5
          },
          {
            "comment": "This shit sounds like Mgła and Ygg fused into one unholy, monstrous, and beautiful fucking being all at once. Yet again, Poland, crushing the black metal scene.",
            "name": "Valenzuela Justice",
            "id": 6
          }
        ],
        "imgUrl": "a2123948638_10",
        "length": "05:23",
        "country": "NOR",
        "songtitle": "my soul",
        "bandname": "r0x4ry",
        "id": 3
      },
      {
        "comments": [
          {
            "comment": "One of the greatest black metal albums I've ever heard. It rivals Deathspell Omega's 'Kenose' and 'Drought' for spiritual transcendence of the blasphemous variety.",
            "name": "Barlow Acosta",
            "id": 0
          },
          {
            "comment": "It is indeed a good song, the instrumental is top notch, the lyrics have a meaning, overall a nice song to listen if you want to calm yourself.",
            "name": "Wise Moses",
            "id": 1
          },
          {
            "comment": "Never heard of this band before, I just happen to come across it and fell in love. Now I am looking for it on I-tunes.",
            "name": "Tina Carney",
            "id": 2
          },
          {
            "comment": "How is that possible? I saw these guys at SXSW a couple years ago and it was one of the best shows I could have ever come across. I still remember that night perfectly. I would follow this band to the end. They're incredibly talented and passionate about what they're doing and it shows when you watch them live! Infinity likes from myself and everyone I've introduced to the bands sound! ALL MY LOVE FOR THE MIGHTY OAKS! Meow come back to Austin, TX. xoxoxoxoxo's",
            "name": "Boyd Ramos",
            "id": 3
          },
          {
            "comment": "Came across these guys a few months ago, nice sound, purchased 5 tracks via itunes, regular play rotation, brother, seven days, back to you,, just one day, you save my soul, plus like the nw connection.",
            "name": "Deana Lindsey",
            "id": 4
          },
          {
            "comment": "I didn't know where this was filmed but it looked great then I noticed a graphitti on the walls (2:54) saying Dućan and Frizer (Дућан, Фризер)....SERBIA? :D OH MY, awesome! Please come back!",
            "name": "Pace Fields",
            "id": 5
          },
          {
            "comment": "I love this!! this is my favourite song on the album, this is awesome",
            "name": "Reva Sheppard",
            "id": 6
          },
          {
            "comment": "Everytime I listen to this song, I always stare at the photo imagining myself actually standing there like I just woke up. Smelling the freshly brewed coffee, feeling the cold yet welcoming hard wood floor, slowly walking up to her trying to sneak a hug in.  But she hears me and turns around, I could just imagine seeing her in this light and knowing that all my worries are gone for that just one moment she looks at me with her natural face, wearing my shirt and her hair messy. Then the song ends. And I am back to my reality. Oh well, maybe one day.",
            "name": "Smith Lyons",
            "id": 7
          }
        ],
        "imgUrl": "a4097035149_10",
        "length": "02:04",
        "country": "GB",
        "songtitle": "Lifejacket",
        "bandname": "No Hands",
        "id": 4
      },
      {
        "comments": [
          {
            "comment": "this song feels like you are in your kitchen on sunday morning and everything is beautiful. and you just stop drinking your tea and you think every bad moment that you've seen has gone. everything is passing and you are just watching, like a river.",
            "name": "Nichole Haney",
            "id": 0
          },
          {
            "comment": "i opened bandcamp to listen to a specific song. for some reason this video was in my recommendations list, and the picture caught my eye pretty quickly. i really wanted to listen to that other song, but for some reason i clicked on that beautiful picture. i'm glad i did.",
            "name": "Sharp Graham",
            "id": 1
          },
          {
            "comment": "middle East deep water this song REM everybody hurt's are the last song's my dad listened hours before he died , these songs will stay with me for ever , every time I hear them they make me cry ,my dad was my life line he was always there when I needed him he is a legend and I am missing him very much ,we all Love u are always in our thoughts and prayers, I still think he is playing a trick on me and he is going to walk through the door and Surprise us but in the end I know it will never happen,but I know one thing I will see him in heaven I just didn't know.",
            "name": "Patsy Case",
            "id": 2
          },
          {
            "comment": "I stumbled in here by happenstance. Man, was I ever the lucky-one. This song is a pure gem and until now - I never heard of it or the artist. Beautiful work, just stunning. I'm going to support and find this musician - I love this as a way to discover and expand your musical horizons. Nice work here",
            "name": "Katheryn Horton",
            "id": 3
          },
          {
            "comment": "My favourite thing about indie music is this yt community behind it. Because every comment is so positive! I love you all... It makes my day to put on some indie and read all of the positivity and love in the comments.",
            "name": "Chang Flynn",
            "id": 4
          },
          {
            "comment": "Releasing a live album can help your band in many ways. It can serve as a compilation of the group's previous work all put onto a single disc, it can introduce the live element to the quality of the group, but in 10,000 Maniacs case, the MTV added exposure helped them gain fans and put their soft jangle pop out to the kids. Sure their music was happening when the television company were just establishing themselves before featured animation shows would do that; inviting big time artists to perform live for the network concerts which would turn into television episodes. Stars such as Nirvana, Eric Clapton, and even Bob Dylan would go on to appear on this show, but probably being the lowest publicized act outside of college radio, 10,000 Maniacs did not have a mainstream presence. While this album did not kick them directly into the mainstream, it did help them out by making their music available to the MTV crowd and presenting it the way it was made, using Merchant's lush and versatile voice with the folk guitar styling of the late Robert Buck.",
            "name": "Kelley Talley",
            "id": 5
          },
          {
            "comment": "Our Time in Eden stands head and shoulders above the rest of the 10,000 Maniac's albums and made listening to all of their Natalie Merchant albums leading up to this one a worthwhile endeavor. Our Time in Eden isn't a great album in the sense that all the tracks play off eachother and the whole album is greater than the sum of its parts. Rather, there is a high density of excellent tracks to be had here with a derth of overtly political/bland tracks that have dragged down past efforts. By my count there are sixtracks here with the rest still serving in a capacity. The biggest strike against this album is the general sameness between the tracks on the album. Every track is in the Maniac's jangly folk pop style but this is without a doubt the pinnacle the band would reach in this mesh of genres. In retrospect maybe this album was too good for Natalie Merchant and finally inspired her to embark on a solo career. I can't really blame her, I've never listened to 10,000 maniacs for any other reason besides Merchant's vocal talents and catchy melodies. Our Time in Eden is the only Maniac's album worth listening to for generalist music fans but if further interest abounds, In My Tribe is the next logical album for new listeners.",
            "name": "Harriett Kaufman",
            "id": 6
          },
          {
            "comment": "While not bad by any means, the Maniac's, or probably more likely Natelie Merchant's formula of preachiness with a beat has begun to wear thin.  There are some likeable melodies here, such as These Are Days best lyrics on the album, Candy Everybody Wants and Stocton Gala Days, but songs like I'm Not the Man and Jezabel really bring things down.  C'mon guys, smile every once in a while!",
            "name": "Wiggins Green",
            "id": 7
          }
        ],
        "imgUrl": "a3061196798_10",
        "length": "04:32",
        "country": "NZL",
        "songtitle": "Winter",
        "bandname": "3 Shots to the Head",
        "id": 5
      },
      {
        "comments": [
          {
            "comment": "Irure labore est in anim dolore ex aliqua mollit qui ullamco ullamco enim aliqua. Ut officia ipsum amet consequat laborum aliqua magna cillum. Id nostrud reprehenderit aute sunt aliqua deserunt aute ea labore voluptate.",
            "name": "Beth Wong",
            "id": 0
          },
          {
            "comment": "Compared to their delightful first two records, their descent into R.E.M.-like morose folk-pop intellectualism is pretty sad. Their dreamy roots only resurface in Eden, while their erstwhile playfulness and diversity is nowhere to be found. Their newfound appetite for the dead-serious and the epic succeeds in Tolerance, but mostly this is a yawn fest.",
            "name": "Iva Dudley",
            "id": 1
          },
          {
            "comment": "10,000 Maniacs without Natalie Merchant, and apparently without any memorable tunes as well.  There's nothing specifically wrong with the vocals of Mary Ramsey, but they add absolutely nothing to songs that are already incredibly bland.  The only track here that remotely stands out is the piano-driven ballad A Room for Everything. The rest of the songs range from merely nice Love Among the Ruins, Even With My Eyes Closed, Green Children to sleep inducing Girl on a Train, an amazingly uninspired cover of Roxy Musics More Than This, Across the Fields.  Although I doubt that Natalie Merchant would have been able to save most of these songs, it still would have been nice to see her try.",
            "name": "Joan Lewis",
            "id": 2
          },
          {
            "comment": "Stumbled across this in the CD racks and glad I took a £4.99 gamble.  I knew it wasn't from their 'classic' 80s era and Nat wasn't in the line-up, but I thought I'd investigate. This is not a bad album - it has strong elements of the trademark Maniacs sound.  It's well-played folky-pop and Mary's vocals are pretty good.",
            "name": "Prince Knox",
            "id": 3
          },
          {
            "comment": "I wasn't at all surprised that this album was a disappointment.  Let's face it, replacing Natalie Merchant was more then just replacing the voice of the band.  Seriously, it would be like replacing Sting in the Police or Plant in Zeppelin.  Merchant brought so much to the table that helped define the Maniacs sound.  Lyrically poignant, sensually mysterious, sporting an engaging, unique voice...one can't help but be pulled in.  The band is still here.  Churning out gripping arrangements.  Complex, textured sonic landscapes.  Unfortunately, new vocalist Mary Ramsey isn't up to task.  Where Merchant brought depth and tension, Ramsey seems forced and contrived.  One semi bright spot is the cover of Roxy Music's, but even that makes you wonder how much better it would have been with Natalie.",
            "name": "Glenn Mccoy",
            "id": 4
          },
          {
            "comment": "This album is not that bad if you enjoy folk/ traditional celtic music.  I think Mary has a great voice and hearing her cover these classic tunes was a nice experience.  Don't expect to be blown away by the album but if you enjoy this type of music there is no reason to not give this album a try.",
            "name": "Wyatt James",
            "id": 5
          },
          {
            "comment": "When I played this album again recently, I consider I must have been living in a rock wilderness in the eighties. When I see some records I bought around this time, this, Lone Justice and others that I will not mention I must have been really confused. The end of the seventies was a cataclysmic event for me.",
            "name": "Doyle Alvarado",
            "id": 6
          },
          {
            "comment": "My rating reflects an average of my rating of the album's first half, which I like very much, and my rating of the second half, which I find merely listenable. This album has a mix of some very forgettable songs and some very good songs. I can't understand a single thing she says, but it's definitely worth getting to know at least the first half.",
            "name": "Cathy Swanson",
            "id": 7
          }
        ],
        "imgUrl": "a1214292115_10",
        "length": "02:14",
        "country": "GB",
        "songtitle": "walk the dog",
        "bandname": "sleepovers",
        "id": 6
      }
    ],
    "kuratorImg": "http://placehold.it/700x700",
    "kuratorDescription": "In director Pablo Larrain’s Jackie, unlike almost any movie made about the assassination of John F. Kennedy, there are no hints of shadowy puppet masters or boogeymen: there is simply the spotlight on one person’s grieving, complicated by the grief of an entire nation. Accompanying the film is a score written by Mica Levi, whose work in film in the last three years is slowly surpassing any of her output as an experimental producer or art-pop rocker (with Micachu and the Shapes). Her score for Jonathan Glazer’s Under the Skin proved Levi’s ability to create sound that is not only atmospheric, but definitive to the film itself. With the power of an orchestra behind her, Levi provides Jackie a palpitating pulse for the film’s portrait of a seemingly unknowable historical figure. The score introduces itself in the film immediately as Natalie Portman walks through autumnal grounds of the Kennedy compound. She is walking towards her home, to meet a reporter (Theodore H. White, who wrote a LIFE magazine article that largely began the Camelot myth surrounding the Kennedy administration) to discuss life after November 22. The camera zooms in on Portman’s grimace, as she makes her way home, and Levi’s “Intro,” swoops into the scene with ghostly strings, immediately setting a tone of melancholy. Throughout the film, Levi’s score is used sparingly, but with sensitive accuracy. Here in these first few minutes of the film, it gives weight to all the dead foliage. The camera often lingers on Portman’s face, especially when she is looking in the mirror. In moments like these, Levi’s score emerges unexpectedly, giving a strange stability to these often frayed and vulnerable visual experiences. One moment in particular haunted me. Shortly after the assassination, Portman finds herself in the bathroom of Air Force One, right before LBJ is sworn in as president. She looks in the mirror, wiping away blood from her face and blouse. When Portman cleans the viscera off the mirror, smudging its surface and blurring away her image, the piece “Tears,” which was barely perceptible as a nervous string arrangement at the beginning of the scene asserts itself. A simple chord progression of keys gives a momentary balm, and frames the scene perfectly. Jackie is replete with visual moments like this one, that are painful to look at. What Levi’s music can do is provide a brief respite, smoothing the razor edges of a picture. And unlike her work in Under the Skin, Levi’s score in Jackie is unobtrusive, it exists when you need and want it to, providing either a relief from or a multiplication of the grief the film is relating.",
    "kuratorName": "Tameka Fowler",
    "kuratorId": 678
  }
]