[
  {
    "entries": [
      {
        "comments": [
          {
            "comment": "It has the same type of battling-mode mindset that it’s similarly titled predecessor contained, but this time everything about it is so much more vicious and sinister, and Em just goes in on the beat. Both the beat and the rapping are standout in their own rights, but combined they form to make some type of Mac-n-Cheese-esque deliciousness. It’s not a mean track per se, because it doesn’t focus on anyone in particular, but there’s a venom and vitriol on here that lends as some nice foreshadowing for the next album. Excellent track",
            "name": "Marc Miller",
            "id": 0
          },
          {
            "comment": "A depressing reality-checker written after Eminem was nearing the end of his wits and close to the proverbial edge. He was out of a job, struggling to get money, having whatever money he did make robbed from his house, and his rapping career was going nowhere as he was trying to provide for his daughter. It’s a relatable song for everyone who listens as we’ve all sunk so low we don’t know where we’re going (I experienced it after Shaq retired, for example.) It’s a rare moment of sincerity in an album that prides itself on avoiding it.",
            "name": "Phil Collins",
            "id": 1
          },
          {
            "comment": "Ya know, the long ending of \"Moonchild\" might actually be my favorite part of the album. So nocturnal, mystic, and dreamy. I also love the freakout parts in \"21st Century Schizoid Man\", obviously.",
            "name": "Peter Meier",
            "id": 2
          },
          {
            "comment": "I guess a review for this album is not easy. Simply said, it is mind-bending, thought-provoking, and directional. Directional? well, I was very young and this album triggerred me to search for more and widen my depth and breadth. The songs seem to follow a mood waving pattern: 21st Century Schizoid Man is rather harsh and provocative in its tone. Not to mention the mastery of its individual band members delivering a heart-felt perfomance. The power and aggression of Schizoid Man is suddenly dropped to a stupor by I talk to the wind. Ahh the flute...a magical introduction to music. Yet, the song seems very promising which again is broken down by Epitaph. But not sound-wise. The song is not powerful but actually depressin with its lyrics. Moonchild is soporific but you are suddenly woken up by the final song, The Court... . As mentioned before, the band members are very skilled and I guess these could have been easily labelled as a Supergroup. Enjoy...",
            "name": "Deborah Norman",
            "id": 3
          },
          {
            "comment": "Magnifico, splendido, inaugurale, eterno, ecc...",
            "name": "Audrey Noel",
            "id": 4
          }
        ],
        "imgUrl": "a3980528907_10",
        "length": "03:08",
        "country": "USA",
        "songtitle": "Purgatory Drive",
        "bandname": "the Growlers",
        "id": 0
      },
      {
        "comments": [
          {
            "comment": "They sure make a big deal about this one on here! It's a good album. One of the earliest renowned prog rock albums. 'Renowned' meaning in the present day, as it had been ignored back then upon release. It's gloomy, it's tight, it's spacey, it's elaborate, but somehow each song manages to stay uniform in some way. 'Moonchild' should not have been 12 minutes, the way they wasted 9 of them with aimless noodling. There's noodling that brings a song somewhere, that takes you to another point, or unifies all the previously heard passages together and connects to some new, unheard passages, and then there's aimless noodling, which has NOTHING to do with the song and takes you nowhere. When I heard the title track, I realized that, having heard the music of Uriah Heep before I've heard King Crimson, that U.H. had used a similar melody in the song 'Circle Of Hands' from their 1972 album 'Demons & Wizards'. Anyways, it's not a bad album. I think it gets too much credit though. I've heard better in other prog albums.",
            "name": "Jeanne Smith",
            "id": 0
          },
          {
            "comment": "2 song album",
            "name": "Jefferson Watson",
            "id": 1
          },
          {
            "comment": "I guess I'm just not a prog-rock fan, because this album does little to nothing for me.  It is all just too damn pretentious and over-blown for me to take.  I mean, I don't think that I could ever bring myself to trot this shambling mound out in front of any other self-respecting music fan without being completely embarassed.  I guess if it was 1969, I was hearing this for the first time and was stoned out of my brain, I might be more impressed and \"get it.\"  Today, however, it alternates between making me feel embarassed that I'm listening to it and making me fall asleep.  The musical virtuosity is obviously not in question.  The emotion and impact is, though.  The only situation in which I find this music appropriate is perhaps a rainy, Sunday afternoon, when you're sitting quietly reading the newpaper or a serious novel of some sort.  Even then, I'd rather turn some good jazz on or even classical.",
            "name": "Hardy Booth",
            "id": 2
          },
          {
            "comment": "Sublimely beautiful record, rich imagery, and, well, just lovely to listen to. Personal favourite track is 'I Talk To The Wind', soft as the Sun on summer grass. Hard to fault it really, a genuinely unique piece of work.",
            "name": "Obrien Wilkerson",
            "id": 3
          },
          {
            "comment": "While tedious at times this is overall an excellent record. I love the warm tone of Greg Lake's voice; its comfortable. This record is so far out there for it's era that it has to be considered a milestone in rock history. No body takes chances like this anymore. Is it because it has all been said already?",
            "name": "Gallegos Stevenson",
            "id": 4
          },
          {
            "comment": "In the Court I would say is one of the heaviest albums I have heard to date. It has a nice progressive sound to it, and the lyrics twist a nice tale As I caught it on the radio in the barn today I just felt the need to tell someone.",
            "name": "Tate Burgess",
            "id": 5
          }
        ],
        "imgUrl": "a1968828765_10",
        "length": "03:59",
        "country": "FR",
        "songtitle": "Auld Lang Syne",
        "bandname": "Heck Ya The Halls",
        "id": 1
      },
      {
        "comments": [
          {
            "comment": "From what I understand, this is Andy Partridge's growing up album.  Accepting the joys of fatherhood and home life.  That's not to say that it's all sweetness and light here.  'The Smartest Monkeys', 'Books Are Burning', 'War Dance' and 'The Ugly Underneath' are hardly happy themes.  But songs like 'Holly Up on Poppy', 'My Bird Performs', 'hen She Appeared' and 'Humble Daisy' are simply joyful.  'Humble Daisy' is one of my favorites with it's rich harmonies, and Pet Sounds inspired sound.  Also 'Wrapped in Grey' is absolutely beautiful.",
            "name": "Tisha Petty",
            "id": 0
          },
          {
            "comment": "In #7 in the RYM top 500 marathon: (Note: This review applies to the 2009 Steven Wilson Remaster) It is an exciting listen.  I found the mix very jarring at first.  I am used to the rotten tape mix imprinted on my first cd. This is a staggering difference.  Because Fripp stood over Wilson's shoulder during the remaster, I am pretty sure this is how it is supposed to sound. Musically, lyrically, conceptually - this is a brilliant record.  But there is something about it that feels like a relic. An aged piece to be greatly admired, but never to fully connect with.  For some reason, PF's 'Wish you were here' feels as fresh and exciting as must have in 75, time has worked differently on this one. Even still. It is a great work of art. 86/100",
            "name": "Morrison Pierce",
            "id": 1
          },
          {
            "comment": "I almost wanna give this 4 1/2 stars for the improv. section of Moonchild, but dammit, I can't.  It's like this album has a magical progressive shield protecting it from being anything short of awesome.  A Legendary Classic.",
            "name": "Virgie Rivers",
            "id": 2
          },
          {
            "comment": "This is one the most influential albums of the so-called \"dad rock\" genre. Too bad it didn't age that well - of course, it must've been a shock to hear this album in 1969, but let's be honest, the mellotron and choirs sound really cheesy at times. The album itself starts with 21st Century Schizoid Man which is the highlight of the whole recording and probably the reason we still talk about this album after over 40 years. It's just ridiculously unique and ahead of its time. Then the album gets pretentious and, well, boring. I Talk to the Wind is fine. Epitaph is kinda overdramatic. Moonchild lingers for way too long. And then it ends with The Court of the Crimson King, which is pretentous too, but at least it a really good song. Forgot to mention it has its iconic, gorgeous cover art.",
            "name": "Rogers Weeks",
            "id": 3
          },
          {
            "comment": "I got this quote from Kind of Blue's Last fm page, from a user by the name of Timppa2000. \"Universally acknowledged standard of excellence.\" That sums up Kind of Blue nicely in my eyes, though I'd add that Kind of Blue is the best starting pointing for getting into the initially daunting world that is jazz.",
            "name": "Rogers Weeks",
            "id": 4
          }
        ],
        "imgUrl": "a2385939592_10",
        "length": "03:56",
        "country": "USA",
        "songtitle": "Joker Smoker",
        "bandname": "Dubamine",
        "id": 2
      },
      {
        "comments": [
          {
            "comment": "Got this for almost nothin at all with \"Ascenseur pour l'échafaud\" and Cannonball Adderley's \"Somethin' Else\" on 2 CDs. I don't know shit about jazz but this sounds cool. And I guess it's a grower, too.",
            "name": "Blanca Short",
            "id": 0
          },
          {
            "comment": "Mingus' \"Black Saint & the Sinner Lady\" showed me that jazz could be loud and impolite. I learned from Coltrane's \"A Love Supreme\" that jazz can be wild and adventurous. Mile Davis' classic \"Kind of Blue\" has revealed to me that the genre can be a emotionally deep and riveting as any other genre. From beginning to end, \"Kind of Blue\" is a sublime, stimulating masterpiece. \"Kind of Blue\" is more than glorious background music. Its sound is capable of doing more than just relaxing you after a long day. The lineup on the album includes Miles himself, John Coltrane on sax, Jimmy Cobb on drums, and Paul Chambers on bass. Many believe that this exceptional cast will never be matched. The talent glows with exuberance. The speedy, dripping piano that upstarts \"All Blues\" invites the dreary trumpet played by Davis. \"Freddie Freeloader\" contains some great clasping percussion, and there is some superb sax playing by Coltrane on \"So What\", among other pieces. The closing \"Flamenco Sketches\" is gorgeously sad. It begins with a bass that sounds as if it is slowly dying, and Miles' trumpet provides a eulogy. Explaining why \"Kind of Blue\" is such an astonishing record is not easy. The familiar jazz elements are here, and it certainly is not as ambitious as Davis' later work or even that of his contemporaries. Even so, every single note on this record is played with purpose. \"Kind of Blue's\" reputation spreads beyond being highly influential. This is an essential record for jazz enthusiasts and for music collectors alike.",
            "name": "Bryant Atkinson",
            "id": 1
          },
          {
            "comment": "El mejor disco de jazz de la historia.",
            "name": "Maricela Branch",
            "id": 2
          },
          {
            "comment": "IMMENSO! IMMENSO! IMMENSO! Uno dei 10 dischi più belli della storia del Jazz. Quel genio di Davis qui rivoluziona il modo di concepire la musica Jazz, apre nuove strade raggiungendo un livello qualitativo semplicemente enorme. Una pietra miliare, anzi un gigantesco monolito, sulla storia della musica, un'opera imprescindibile per qualunque amante del Jazz e della musica tutta. 5 brani assoluti, un capolavoro gigantesco, un artista enorme coadiuvato da musicisti altrettanto enormi (vedi Coltrane). Assoluto.",
            "name": "Marva Woodard",
            "id": 3
          },
          {
            "comment": "Still the biggest selling Jazz album ever and by far the coolest!!!! If you don't own it get it... this one's a MUST!!!!!!",
            "name": "Owens Riley",
            "id": 4
          }
        ],
        "imgUrl": "a2844538561_10",
        "length": "03:46",
        "country": "MRT",
        "songtitle": "Arbina",
        "bandname": "Noura Mint Seymali",
        "id": 3
      },
      {
        "comments": [
          {
            "comment": "Steve Albini called Pixies \"a band who at their top-dollar best are blandly entertaining college rock\". I'm inclined to agree.",
            "name": "Hull Velazquez",
            "id": 0
          },
          {
            "comment": "Ripped from my public library in late '04, and the disc's deep scratches meant I wasn't hearing anything past Crackity Jones. The next summer I caught them live – opening for Weezer, strangely enough. I remember being glad to hear Wave of Mutilation not once but twice. Eight or so years pass without thinking much about them. Last month I absentmindedly scrolled to this in my music library and ended up playing it very loudly on a sunny drive. It turns out that I didn't miss very much by not hearing the second half, but overall I was surprised to find a new appreciation for this quintessential alt-rock brand. Their throaty-shouts-and-noisy-surf-guitars!!!! aesthetic can get tiresome as hell in the wrong hands, but the Pixies use it to produce some remarkably euphoric music.",
            "name": "Jordan Romero",
            "id": 1
          },
          {
            "comment": "Sometimes I think that many of the best albums of the '1990s' were made in 1989: 'On Fire', 'The Stone Roses' and 'Doolittle' foremost amongst them. Like many other people I have taken a long time to fully appreciate this band, but they were nothing less than revolutionaries.",
            "name": "Bridget Walters",
            "id": 2
          },
          {
            "comment": "WOW, I really don't get this. I see the non sense/mysterious vibe where you have to guess what the hell the songs are talking about, but seriously? If I wanted good weird f*cked up music I'd listen to Mr. bungle. I also understand this means something to a lot of people, maybe considered a classic, but personally it bores my ass. The famous \"hey\" song is actually good...but the rest? its lost on me. I dunno if i should dislike or envy those who can appreciate this album..to review this album musically will be a challenge. you'll call it alt. rock, I'll call it bullshit. but that's just my opinion..",
            "name": "Cameron Dejesus",
            "id": 3
          },
          {
            "comment": "One of my favorite albums. I could listen to every song all the way through from beginning to end. Opens up with catchy guitar & bass and doesn't stop the entire album. Favorite tracks: Gouge Away, Hey, Wave of Mutilation, Mr. Grieves, & Debaser. makes you want to build a time machine to see them in their prime.",
            "name": "Olson Talley",
            "id": 4
          },
          {
            "comment": "Even though, I don't listen to the Pixies as much as before, I can still appreciate their music. It's already been said before. What defines the Pixies was their abrasive, but melodic sound. I'm sure more can be said to describe their sound, but all I would like to say is that they were highly original. Though, I prefer the more raw 'Surfer Rosa', that doesn't take away from the fact that I love the more lush sounding 'Doolittle.' With lyrics depicting surreal imagery coupled with poppy melodies, there is something new around every corner to enjoy. All I can say is that this is a great album from a highly influential band. I have heard so many bands that have borrowed from the Pixies' sound. Even as a guitar player, I have learned some cool things from Joey Santiago. Doolittle is an essential. Purchase it.",
            "name": "Faye Dale",
            "id": 5
          },
          {
            "comment": "I never understood what the big deal was about THE PIXIES.  There are some good tunes - I'm fond of \"Here Comes Your Man\", \"Monkey Gone To Heaven\", \"Debaser\" and \"Gouge Away\" on this one - but for me they are/were nothing special.  Plus I saw them live back in '89 or '90 and they put on one of the most mediocre live shows I ever saw (I'm glad my girlfriend at the time paid for my ticket!).",
            "name": "Reva Sheppard",
            "id": 6
          },
          {
            "comment": "I remember the first time I heard Doolittle: that day I change the way music must be to me. The Pixies teached me music can be smart and also funny as hell. In Surfer Rosa they were rough and pull their sound to their limits; and they wait to Doolittle to create their masterpiece: it's hard to decide waht is the best song here. It starts in turbo with Debaser, and smash your face to the groun with tame, one of the most concise songs ever. Here Comes Your Man takes you to the club to feel rejected again, but it lifts you to paradise in Monkey Gone To Heaven.... I can talk a lot of shit about these fifteen songs, but finally you will be beaten by an acid sense of humour.",
            "name": "Smith Lyons",
            "id": 7
          }
        ],
        "imgUrl": "a2253029923_10",
        "length": "03:11",
        "country": "USA",
        "songtitle": "LWTGG",
        "bandname": "Oliver",
        "id": 4
      },
      {
        "comments": [
          {
            "comment": "I actually do like these guys, but how can anyone not acknowledge how overrated they are?  This is a very solid four star album, and they do deserve credit for debuting with two impressive albums back to back.  Their fan base has always been the smug college crowd who tend to think they're the arbiters of good music, though, and I tend to think that is why they're so outlandishly overrated.",
            "name": "Kathrine Berger",
            "id": 0
          },
          {
            "comment": "I really love this album.  It gets better with time.  It's almost perfect with the exception of \"Monkey Goes to Heaven\" and \"Waiting for my Man\" or whatever they're called.  They're both way too pop and feel safe and unaffected.  Unlike \"Hey\" and "13" about the tattooed tit, they outstanding in their production and songwriting.  Buy this album, it's better than Surfer Rosa",
            "name": "Brennan Vinson",
            "id": 1
          },
          {
            "comment": "El mito, las buenas críticas y la curiosidad me impulsó adquirir este disco. Vaya desencanto. No pasa de ser un álbum un poco mediocre, con algun que otro momento brillante, pero en general rodeado de canciones cursis, falsetes y adornos huecos. No entiendo por qué está tan sobrevalorado este disco, ¿no se hizo nada mejor en el 89?",
            "name": "Robinson Dominguez",
            "id": 2
          },
          {
            "comment": "This is one the greatest albums ever made. It's top notch from top to bottom. It's something else. It's really something. Its quite something when you take a listen. You'll be listening to it and you'll be all like: 'man, this is really something, these guys really got something going here.'Because when you get right down to it, they do. And Oh, do they! I was at Venice Beach once, and the big black guy who's married to the old white lady and they play music together on the boardwalk gave me an autographed pixies poster. He said he grew up with them in Arkansas. I figured he was a little misinformed on who the pixies were, mistaking them for his neighbors in arkansas, and all, so I asked him if he'd sell it to me. I felt guilty when he said I could have it free of charge. Nonetheless it was quite a poster and I'm glad he gave it to me for the pixies are my all time favorite. I was pleased as punch. It was really something. Most of this sentiment of mine about the pixies comes as a result of the album doolittle. Thusly, I give it 5 stars. 5 whole stars. There is not one song that I skip on the album. I used to skip \"Silver\" when I first bought it but I have since learned to appreciate it. As far as I'm concerned, \"I bleed\" is numero uno on the list of greatest songs of all time. Its really something else.",
            "name": "Katheryn Horton",
            "id": 3
          },
          {
            "comment": "This album represents all the worst that later was blooming on the commercial rock scene of the nineties. Dull melodies, awful vocals, poor, amateur musicianship. Strange to see people who listen to it today - it seems to me that this is music just for MTV-fed teenagers of that decade.",
            "name": "Chang Flynn",
            "id": 4
          }
          {
            "comment": "ACCR is one of the best groups of all time. All of their singles were excellent, the best if Band On The run. This album is one of the best albums of all time, if not the best!",
            "name": "Harriett Kaufman",
            "id": 6
          }
        ],
        "imgUrl": "a1877982657_10",
        "length": "06:44",
        "country": "DE",
        "songtitle": "Stratosphere",
        "bandname": "Thallus",
        "id": 5
      },
      {
        "comments": [
          {
            "comment": "I was never a Pixies disciple or anything. In 1989, I was mostly listening to stuff like Tears for Fears, Prince and The B-52s, plus U2 & R.E.M. Of course in the years that followed, I heard this record and was impressed, but only recently did I actually sit down and listen to it all the way through and it absolutely does deserve praise as a masterpiece and certainly one of the top 10 albums of the 1980s. \"Monkey Gone to Heaven\" and \"Debaser\" in particular  are very original and captivating.",
            "name": "Dennis Wood",
            "id": 0
          },
          {
            "comment": "With its slick combination of Blues and Psychedelic rock, and Jim Morrison's haunting vocals, The Doors' debut self-titled album is a solid piece of work that still holds up, although not quite one that stands out as truly amazing.",
            "name": "Ramirez Good",
            "id": 1
          },
          {
            "comment": "Los chicos de The Doors creyeron que por usar muchos órganos para atmosferizar canciones de rock se convertirían en la revelación. Les funcionó a un nivel superficial, pero no trasciende. Quien merecía ser la revelación allá por 1967 eran The Velvet Underground y Nico, que además de atmosferizar, escribían buenas canciones, mucho más que ideas generales y aburridas de blues/rock con algunos gritos, y eran capaces de maniobrar lo que habían creado por senderos desconocidos hasta terminar en lugares a los que valía la pena regresar. The Doors debió ser The Velvet Underground, y The Velvet Underground debió ser The Doors. Claro que esto hubiera hecho a Lou Reed matarse en 1971, entre otras implicaciones*, pero estarían de acuerdo en que hubiera sido mucho más esperanzador para las pobres almas viviendo a fines de los 60', ¿no?*Una de las que más me asusta es que Morrison se habría convertido en un viejo irritante que haría colaboraciones con Metallica, y siendo él un personaje con carácter aún más concentrado que el de Reed creo que también hubiera terminado como una especie de Morrisey pero más psicótico y hasta sospecho que hubiera caído en prisión más de una vez.",
            "name": "Maryanne Guy",
            "id": 2
          },
          {
            "comment": "It's a real shame they couldn't, for whatever reason, use the original analog master.  Instead, they used the \"best analog tape copy\" and you can really tell.  The lows and highs are muted, the mix is muddy, and there's even some tape hiss.  It's enough to make me reach for my DCC copy instead. Am glad I own it?  You bet.  Was I expecting more?  Definitely.",
            "name": "Elsa Holt",
            "id": 3
          },
          {
            "comment": "Ol' Jimmy sure was a dick, but this album is nothing but chops.   Even if you don't like it you still have to RESPECT it.  That's right.",
            "name": "Pansy Kelly",
            "id": 4
          },
          {
            "comment": "The Doors is definitely a classic album, but for my tastes, doesn't quite keep me entertained.  \"The End\" is possibly the best one on here due to its construction; very laidback and ominous, yet constantly building to a crescendo to around the eight-minute mark where everything just spirals out of control.  Very nice. Some of the shorter songs are pretty nice like \"Break on Through\", \"Soul Kitchen\", \"Back Door Man\" and \"Alabama Song\".  However, there exist a few songs that aren't captivating to my ears; \"End of the Night\" and \"The Crystal Ship\" do nothing but put me to sleep, and \"Light My Fire\", as classic as it is, can get a bit carried away as the solos tend to drag the quality of the song down just a bit. An important landmark in music history that's nice to own.  Can't really say much beyond that.",
            "name": "Elva Rose",
            "id": 5
          },
          {
            "comment": "This one's a classic, it's not only the Doors first album, but it could also qualify as like a greatest hits, because of it's really good hits and songs. It has hits like \"Light My Fire\", \"Crystal Ship\", and \"Twentieth-Century Fox\". The songs that are not as popular are really good too, my three favorites are \"Soul Kitchen\", \"I Looked At You\", and \"Take It As It Comes\". A must buy for all Doors fans.",
            "name": "Tasha Bullock",
            "id": 6
          },
          {
            "comment": "This is one of the best debut albums ever by a rock band. The Doors created a unique and powerful instrumental blend of different styles that allowed the band to approach different genres. Indeed, this is an album that can't be classified; it is bluesy, psychedelic and operatic at the same time. The mood is absorbing (the anthem Light My Fire, Soul Kitchen, The Crystal Ship) and also powerful (Break On Through, Back Door Man) helped throughout by the incredibly catchy sound of Manzarek's organ. Jim Morrison was a great poet and he wrote some really good songs in this album (The End, Break On Through, The Crystal Ship); his haunting baritone voice acting as a balance to the spirited sound. The album closes with The End, a 12-minute surreal epic that reaches a wonderful climax before fading away. Only a few forgettable songs prevents this from being a masterpiece.",
            "name": "Cathy Swanson",
            "id": 7
          }
        ],
        "imgUrl": "a3388720048_10",
        "length": "03:57",
        "country": "USA",
        "songtitle": "Iron Lung",
        "bandname": "Black Marble",
        "id": 6
      }
    ],
    "kuratorImg": "http://placehold.it/700x700",
    "kuratorDescription": "Pitchfork is the most trusted voice in music, celebrating and exploring emerging artists and established pioneers across all genres. With our loyal audience of more than 7 million monthly unique visitors, we are read daily by the most passionate music fans. We regularly partner with brands to develop thoughtful integrated campaigns that leverage our digital, print, video, and event capabilities, along with any number of advertising and sponsorship opportunities on the site. For more information on advertising with Pitchfork, drop us a line.",
    "kuratorName": "Tameka Fowler",
    "kuratorId": 678
  }
]