[
  {
    "entries": [
      {
        "comments": [
          {
            "comment": "In high school I had a couple hours between when I arrived home and when my mom got back from work. These periods were almost always spent listening to albums I had pirated off soulseek in 128 kb/s mp3 and burned on to CD-Rs, such as this one, while consuming my signature combination of Cheez-Its and Cherry Coke, kicked back with my feet up on the desk. I would do this so frequently that now I can't listen to the dozen or so albums that I'd regularly spin without thinking of those days and the almost nauseatingly low amount of responsibility I had. This era of Mudhoney truly defined grunge in my opinion in that it's fuzzed out, raunchy, sleazy, and perfectly combines the attitudes of punk rockers with those of the original garage rockers in to one sweaty mess of rock and roll, and You Got It is one of the best examples of this.",
            "name": "Ola Burt",
            "id": 0
          },
          {
            "comment": "Remember when Chachie joined Happy Days?  He was Fonzie's cousin.  Ever since Chachie had been born he'd been in Fonzie's life.  As viewers, we were expected to accept that he was as cool as Fonzie, or at least almost as cool.  Thing is, we knew better.  He wasn't cool.  He was a nerd pretending to be cool.  He was no Ralph Mouth or Potsy, mind you, but still he was a nerd.  He was like the uncoordinated little brother of a jock.  He knew all of the cool kids and he knew how to act cool, but only because his older brother was a stud.",
            "name": "Wilson Harrington",
            "id": 1
          },
          {
            "comment": "Until Mark Arm screams, this is tolerable for the most part.  Think if Trout Mask Replica was completely conventional and mixed in loads of punk music.  It's all loud, depressing when slow, okay when fast, stagnant most of the time.  And did we ever need to hear the entire album backwards?",
            "name": "Tyson Gutierrez",
            "id": 2
          },
          {
            "comment": "far and away the best thing these guys put out on a major label. judgement rage..., 1995, and into yer schtik all have the energy and venom of the groups halcyon days, and are some of my favorite tracks of theirs. all fans of proto-punk of all shapes and sizes take heed...",
            "name": "Carney Hughes",
            "id": 3
          },
          {
            "comment": "Being a fan for well over a decade now, I can't help but to feel thrilled anytime they decide to grace us with their presents. On The Lucky Ones - they're using their old tricks. You got your raunchy lyrics, your thrashing guitars, your aggressive feedback, and it is all accompanied by Mark Arm's same old scoff. If you enjoyed the Mudhoney circa 95', I've got a feeling you will really enjoy this. I'm Now starts the album off just right with its crude thud and continues through the next two tracks. Next Time and And the Shimmering Lights showcases their garage rock flair and maintains that method throughout the remaining of the record, while the whole time making it sound fresh and exciting. The other track that really sticks out in my mind is What's This Thing, with its chic sound and chanting lyrics.",
            "name": "Kelly Richards",
            "id": 4
          },
          {
            "comment": "his would be remains from 90's alternative rock with some grunge sounds. A few shorter good punky tunes as well. In general still quite bland and boring for most parts. At best they sound a bit Pearl Jam like, but for most parts it seems like they are lost in what they want to sound like, and hence make a bunch of various alternations on the grunge and alternative sound, resulting in a quite unbalanced album as for the material.",
            "name": "Ray Pena",
            "id": 5
          }
        ],
        "imgUrl": "a1796876171_10",
        "length": "04:33",
        "country": "FR",
        "songtitle": "In the sanctuary of Gods",
        "bandname": "L'oeil turquoise",
        "id": 0
      },
      {
        "comments": [
          {
            "comment": "n first thought, the baby on the front is as creepy as all get out. Upon further meditation, it's the only cover artwork that fits. The titular opener is the soundtrack to the womb: drum beats as a heart machine, electronics as the golden light that culturally garbs a growing child. The uncanny accuracy of the representation scares me, actually: it means that when there's change and movement (cf. foreboding melody and wavering beat at 13:04), it means that something's happening to the child and then I get distressed. Fauni-Gena is whispers in the thin distance, sunrise over the boreal forest: a nature documentary chill yet totally arresting. It's amazing how the chiming woodpecker totally charges and changes the song. Oscillation is another important element brought to the forefront here: unlike Electronic Meditation's searing coils, Atem blurs itself into immaculate peace. Circulation of Events and Wahn are the closing half, slightly more in focus yet still elegant in their laconic dreams.",
            "name": "Vincent Dodson",
            "id": 0
          },
          {
            "comment": "Musical depiction of the history of earth, from its volcanic beginnings to the lush foliage of the Jurassic, on through an intermittent ice age and the first recorded musical attempts by man.  Don't believe the naysayers - Atem is a wondrous album.",
            "name": "Puckett Cardenas",
            "id": 1
          },
          {
            "comment": "Druggy as fuuuuarrk! You can nearly hear the pitter-patter of cognitive shifts these krauts are experiencing. It's not all proto-ambient noise; sometimes they get on a groove but then I assume forget they're on a groove so they kind of meander into oblivion. Then they got that guy playing flute and it makes me happy. I think this is better than that first Ash Ra album, and I should know because I used to wear a Neu! shirt in high school.",
            "name": "Frederick Ashley",
            "id": 2
          },
          {
            "comment": "That being said, this is a pretty decent pop song. Even though it's fairly straight forward in its 90's RNB and Mariah Carey-like delivery and the fact that is not nearly as good as Carey's recent single with Miguel, it's just a fun song. The way her vocals bounce to the excitement of what's she saying is just great. The piano from a Brenda Russell piece just perfectly compliments her energy. It's just a fun pop song.",
            "name": "Obrien Wilkerson",
            "id": 3
          },
          {
            "comment": "The reason why I didn't give this song five stars is because of Mac Miller I don't like his part in the song. If she had done the song without him then the song would of gotten five songs. She is like a mini Mariah I love it. She doesn't need Mac Miller to help her out with a voice like that.",
            "name": "Gallegos Stevenson",
            "id": 4
          },
          {
            "comment": "It's a pretty typical pop song, but the breathy vocals really surprised me the first time I heard it on the radio. Sounds like Fantasy era Mariah, and it's one of the best Top 40 hits this year. Nice.",
            "name": "Tate Burgess",
            "id": 5
          },
          {
            "comment": "I love it, but her damn voice sounds so fake. How many tweaks would have to be made so that my voice sounds like an exact replica of an emotionless Mariah Carey? Where is that plug-in for Adobe Audition? Take my own personal gripes about the vocal tantalizing out of the mix, and you're left with a terribly generic pop love ballad. Mac Miller's position on this is pointless. At least he can stop trying to pretend to appeal to the classic hip-hop crowd now that he's a certified Disney star. Or does that just put him in a category with Drake? Fucking Mike Miller man.",
            "name": "Zamora Watson",
            "id": 6
          }
        ],
        "imgUrl": "a4035878767_10",
        "length": "06:19",
        "country": "USA",
        "songtitle": "Me and Your Mama",
        "bandname": "Childish Gambino",
        "id": 1
      },
      {
        "comments": [
          {
            "comment": "Vocally, this is excellent. Nicki's verse shows her in great form, and Ariana and Jessie put forth their usual solid performances. But the song itself doesn't ever seem to hit the heights it threatens to. It's like it's building to something amazing, and the song is over before it ever gets there.",
            "name": "Jenny Merrill",
            "id": 0
          },
          {
            "comment": "Although this instrumental focuses a bit too much on percussion, it does have a certain bounce to it. The drum sounds that the producers selected are quite dope, and don't get stale by the end of the song. The trumpet stabs also give the song character and life.",
            "name": "Deena Harding",
            "id": 1
          },
          {
            "comment": "I have to admit, the chorus is actually pretty catchy!",
            "name": "Joyce Morin",
            "id": 2
          },
          {
            "comment": "This would be a great song if Nicki's verse wasn't so bad. As it is, it's just good. I'm not usually a fan of pop reggae production, as I find it to be lazy, but as is to expected from an Ariana song, the rich production actually makes the beat work really well. Of course, it helps that Ariana is such a powerful and commanding presence. A really solid song that would probably be better without the guest. I don't get the hype around Nicki - aside from a few big pop hooks and her features with Kanye, I don't think she's any good, and her lyrics are borderline unintelligible. It's no different here. Thank God Ariana is so great.",
            "name": "Rogers Weeks",
            "id": 3
          }
        ],
        "imgUrl": "a1766562230_10",
        "length": "03:36",
        "country": "SCO",
        "songtitle": "Sobotka",
        "bandname": "Carson Wells",
        "id": 2
      },
      {
        "comments": [
          {
            "comment": "Awesome very fun jazzy pop song. Her voice is perfect as always. This can be added to a list of like a million reasons why i'm such a huge fan of them",
            "name": "Jewel Rasmussen",
            "id": 0
          },
          {
            "comment": "Let's start on the positive notes. I think Ariana Grande is a vocalist, although I prefer her coos to her belting. The verse melody is pretty nice though, although she really pushes her range in the pre-chorus. I also like the horn-driven instrumentation which has a real nice groove.",
            "name": "Rachael Sparks",
            "id": 1
          },
          {
            "comment": "Eugh, I feel like ever since the success of Talk Dirty to Me pop producers are starting to think it's alright to just throw an obnoxious Yakety Sax type sample as the core of the smash single. How did that ever become a thing??? Can it die yet?",
            "name": "Elaine Benton",
            "id": 2
          },
          {
            "comment": "I guarantee this song will become a standard in movie trailers for at least the next 6 months in the next few months if it isn't already. The song itself works and i dig more than the rest of her stuff i've heard. The horns are the main draw honestly though.",
            "name": "Bettie Dickerson",
            "id": 3
          },
          {
            "comment": " think the best thing about this song is how many different sections and moods it runs through in just over three minutes, with nearly all of them being quite excellent. Obviously, we’ve got that sax riff, which is one of the most devilishly catchy things I have heard this year. Aside from a couple of niggles I have with its recording (I’m fairly certain its synthesised as well), it’s just one of those riffs that just gets you moving in such a fantastic way. Every time I hear it, particularly when it comes in after the first chorus (if you can really call it a chorus) I can’t help but be reminded of this gif (bonus shoutout to the best subreddit in existence). That’s how groovy it is.",
            "name": "Patty Hendrix",
            "id": 4
          },
          {
            "comment": "But on top of that, this song gets a ton of extra credit from me for a point I just glossed over - there is no chorus. It still has a relatively rigid pop song structure, but there’s no real “THIS HERE, THIS IS THE CHORUS” part, like so many pop songs force themselves to have. But instead of that, we just get an ever-increasing count of fantastic hooks, and we all know how pop song quality is proportional to the number of hooks per minute.",
            "name": "Shepard Melton",
            "id": 5
          },
          {
            "comment": "I don't know about 'vaporwave' but this sounds like a real plunder-phonics album to me. The tracks are all short (most under 2 minutes) and packed with ADD sampling/sounds and changes in direction. The overall feel is spooky and demented but with a playful undercurrent. It's fun for the odd/occasional listen but it's never something I'd be likely to have on heavy rotation.",
            "name": "Valenzuela Justice",
            "id": 6
          }
        ],
        "imgUrl": "a2622311276_10",
        "length": "01:28",
        "country": "IT",
        "songtitle": "I hope You Die Fluorescent Whore",
        "bandname": "Super! Radioactive mushroom cloud",
        "id": 3
      },
      {
        "comments": [
          {
            "comment": "Most of the early Sun Ra albums have one or two tracks that point toward a decidedly more experimental form of jazz alongside conventional big band/post-bop-ish tracks. But of all the early Sun Ra I've heard, this is far and away the most conventional overall. Apart from the extremely intriguing Ancient Aiethopia, all of this is very, very straight. Hell, his debut's more complex than this is.",
            "name": "Barlow Acosta",
            "id": 0
          },
          {
            "comment": "I've never been a huge fan of this album. The reason why is that it's just not that interesting. It lacks the originality that can be found in later Sun Ra albums. It does have some great, classic tunes though, such as Images, Enlightenment, Saturn, and of course the amazing Ancient Aiethopia. Blues at Midnight goes on far too long without much change though",
            "name": "Wise Moses",
            "id": 1
          },
          {
            "comment": "The thing is, it's damn enjoyable anyway, even if the only hints of Space is the Place come in the form of Ancient Aiethopia. The band Ra assembled plays excellently together, frequently bolstering the melodies with sympathetic and complex horn arrangements. This is, basically, a small combo bop record arranged for big band, which means you get the best of both worlds: the terrific arrangements and easygoing spirit of the best big band matched with the psychic communication of the best small combo. Midnight Blues is a great example of this, as it features some great horn charts in the heads but is more interested in those solos, all of which smoke.",
            "name": "Tina Carney",
            "id": 2
          },
          {
            "comment": "There are hints of what would come afterwards, though. Enlightenment is more about mood and groove than melody or solos, slinking around various tempos and whatnot. Unsurprisingly, it went onto become a concert favorite, and apparently the group added vocals, which probably had something or other to do with space. Or acid. Sun Ra must've been a big acid fan, right? Anyway, the other odd one is Ancient Aiethopia, which uses odd horn motifs and a lot of low end to create the sort of unique experience Ra would later specialize in. It also features an atmospheric instrumental segment, and while it doesn't have the flow or groove of Space is the Place, it's still a solid composition.",
            "name": "Boyd Ramos",
            "id": 3
          },
          {
            "comment": "Demonstrating that he could offer up accessible post-bop material if he really wanted to, Jazz In Silhouette is certainly one of Sun Ra's more approachable albums, but for that exact reason it just isn't quite as interesting as his avant-garde work.",
            "name": "Deana Lindsey",
            "id": 4
          },
          {
            "comment": "It is easy to see why 1959's Jazz in Silhouette is one of Sun Ra's most cherished recordings. It is far more accessible than his late 1960s albums, as it is firmly rooted in the bop and swing traditions which he displays mastery of on Saturn. It also has more futuristic numbers like Ancient Aiethopia and Blues at Midnight which distinguish him from most of his contemporaries at the time. Since I prefer my Ra a little stranger than this, Jazz in Silhouette is an album of his I don't return to all that often. It is a still one of the strongest LPs from the period.",
            "name": "Pace Fields",
            "id": 5
          },
          {
            "comment": "This one gets overlooked. Granted, it's one of the more schizo Ra offerings, in that 4 of the tracks sound like they're from the Cosmic Tones for Mental Therapy frame of compositional abstraction, while the remaining 3 Ankh, Lights on a Satellite, and Kosmos in Blue, are from the Bad and Beautiful sessions, and share that album's half-assed, almost conventional jazz sheen.",
            "name": "Reva Sheppard",
            "id": 6
          },
          {
            "comment": "But the whack tunes Cluster of Galaxies, and The Outer Heavens, in particular have that early '60s Sun Ra character about them, full of that smokey, contemplative aura that makes Mr. Blount seem more accurately placed on a classical than a jazz shelf. And even those 3 conventional-ish bits are lovely in parts, with the usual Gilmore/Patrick and Arkestra far too skilled and dignified to let it ever slide into maudlin lyricism.",
            "name": "Smith Lyons",
            "id": 7
          }
        ],
        "imgUrl": "a3167874966_10",
        "length": "04:15",
        "country": "IT",
        "songtitle": "Koxette - Alice",
        "bandname": "baumusik",
        "id": 4
      },
      {
        "comments": [
          {
            "comment": "This is some goodbut not great stuff from Sun Ra. It has a good mix of his more avant-garde and more jazz tendencies but it seems he hasn't quite fused the two yet, and the album lacks the flow and cohesion that for me makes an album great. Being from a rock background, some stuff on here really reminds me of the more experimental tracks on Can's Tago Mago.",
            "name": "Nichole Haney",
            "id": 0
          },
          {
            "comment": "It seems Sun Ra is consistently very good without being ever truly excellent - but I'd be in a pretty generous mood if I told you Art Forms of Dimensions Tomorrow was 'very good'. It's enjoyable but by now I kinda get the idea. This is similar to Cosmic Tones but less engaging, though the forays back into more conventional territory like Kosmos in Blue and Ankh do certainly have their moments. But give me a few days and I probably won't even remember this record's title.",
            "name": "Sharp Graham",
            "id": 1
          },
          {
            "comment": "A more experimental offerings from the early 60s New York era of the Arkestra.  It certainly is something different for its era.  As experimental music the results are naturally mixed.  I find my interest trails off as the album moves along.   What it lacks most of all are consistently strong solos.  But there are undoubtedly some interesting ideas floating around in the first few songs, and the reverb/echo effects should be considered more than mere novelties.  Still, I don't pull this album out much.",
            "name": "Patsy Case",
            "id": 2
          },
          {
            "comment": "I love the tracks on here that are total studio trickery, but the straighter jazz ones I find I could do without. Cluster of Galaxies and Solar Drums  however, really work for me, totally full trippy out-there other worldliness. It's like they'd just discovered the  echo effect, and man were they gonna use it. Of the jazzier numbers, I really liked The Outer Heavens which is a nice long and slightly free track where John Gilmore really shines with his playing. Not an essential Sun Ra album, but a few tracks make it well worth checking out.",
            "name": "Katheryn Horton",
            "id": 3
          },
          {
            "comment": "Trying to keep track of Ra's recordings gives me a headache. What was recorded when under what original title with whom, in Chicago, New York, or on Saturn, how many times was the original broken down into later-released, differently packaged fragments in editions of twelve copies each with wrongly attributed credits before getting paired with another patched-together album from a different era with different unknown musicians...",
            "name": "Chang Flynn",
            "id": 4
          },
          {
            "comment": "Anyway, more relevantly, it's my favorite Ra. It's got the earthy Afro and Afro-Cuban percussive sound he had begun to use in late '50s Chicago, prior to his going full bore esoteric, which moving to New York seemed to do to him (not an uncommon outcome for those who move to New York, I suppose). And yet there's enough residual boppiness and remnant strands of big band corniness to keep it varied while his influences are all flashed.",
            "name": "Kelley Talley",
            "id": 5
          },
          {
            "comment": "This was my first Sun Ra album (a $1.99 Impulse cutout back in '77) and still my favorite.  It led to dozens of other Sun Ra recordings.  If I had to pick a single track to use to introduce Sun Ra's music to a stranger, its the opener Plutonian Nights, a blues with a dissonant Ra intro on Wourlitzer electric piano and heavy, funky baritone sax by Pat Patrick, father of the current governor of Massachussetts (!)  It also includes the march Watusa which remained in the band's book for 30+ years.  Lots of exotica here, but nothing to give one a headache (like some of the Arkestra's more adventuruous stuff from the '70s) No one else came close to this in 1959! ",
            "name": "Harriett Kaufman",
            "id": 6
          },
          {
            "comment": "Probably the most experimental offering of his fifties period. Instead of having two ridiculously ahead of their time tracks alongside the rest of the album's straighter swing/big band stuff (like his earlier albums were), you have two tracks here that are straighter swing/big band stuff alongside the rest of the album's ridiculously ahead of their time tracks. The entirety of the B-side is jaw-dropping. I can hear In A Silent Way during Nubia. Oh, and you really oughta listen to The Golden Lady and then listen to the beginning of the Residents' Third Reich 'n Roll. It's spooky.",
            "name": "Wiggins Green",
            "id": 7
          }
        ],
        "imgUrl": "a2745213182_10",
        "length": "04:16",
        "country": "RUS",
        "songtitle": "smell of spring",
        "bandname": "Fresh milk",
        "id": 5
      },
      {
        "comments": [
          {
            "comment": "Traveling the Nile on the B-Side See: Nubia, Africa, Aiethopia isn't very rewarding. These tracks feature meditative and calm expressions of ancient times...of royal walks and lower-class free markets, but rarely lift the spirit into the strange and mythical frame of mind I usually seek from Ra's music. Also, some of those drum solos are just too low-key and frantic.",
            "name": "Beth Wong",
            "id": 0
          },
          {
            "comment": "ood stuff but there are better representations of Sun Ra's earlier sound.",
            "name": "Iva Dudley",
            "id": 1
          },
          {
            "comment": "On the one hand, a very crass attempt  (and a largely successful one on sales alone) to cash in on the Batman craze, on the other, a rather fun garagey/surfy instrumental outing for The Blues Project and some of Sun Ra's cohorts utilizing generic rock riffs and largely public domain music of the time I imagine the biggest expense was the licensing fees for Neal Hefti's Batman Theme. Punctuated with groovy horns, Sun Ra's spook organ on about half the album, unknown background singers, slide and siren whistles and other goofiness of the era, it does make for a pretty fun listen now and then.",
            "name": "Joan Lewis",
            "id": 2
          },
          {
            "comment": "Mostly instrumental blues jams, featuring guitar, organ, some horns, and mild exploitation flavor. Original copies came with a pic sleeve featuring the back cover artwork. Surprisingly good for it's type. Grades - 7 B's, 2 B-'s, 1 C+, and a C.",
            "name": "Prince Knox",
            "id": 3
          },
          {
            "comment": "I am a huge fan of Batman, but most especially the campy '60s TV show. It was very unique for its time, and while it wasn't very faithful to the source material, a great spin on the comic book genre. With that said, I am also huge into collecting Batman records. The show spawned zillions of albums, all of them created to capitalize on the popularity of the show. This is probably one of the more famous ones. Nothing too crazy though. This is fairly straightforward '60s garage rock. I've definitely heard crazier Batman riffs. And as much as people talk about this being a Sun Ra project, he is not featured on the album as much as one would hope. Still, it's a great gem.",
            "name": "Glenn Mccoy",
            "id": 4
          },
          {
            "comment": "I got this from the WFMU blog and it fits the price.  As mentioned before there isn't a trace of Sun Ra on here save perhaps his remarkable versatility.  It's cartoon music based on the most generic riffs possible, so in a way, you've already heard this.",
            "name": "Wyatt James",
            "id": 5
          },
          {
            "comment": "A mid-sixties period piece which happened to have Sun Ra and a couple members of his Arkestra onboard as studio musicians. OK cartoon music, but not a Sun Ra album.",
            "name": "Doyle Alvarado",
            "id": 6
          },
          {
            "comment": "In 1966 The Blues Project teamed up with Sun Ra for some Batman themed music.Sun Ra and his cohorts i.e.John Gilmore-Tenor Sax,Marshall Allen-Alto Sax, Pat Patrick-Bass low low for the proceedings. Blues Project lead guitarist Danny Kalb shines throughout. A one off werird curio.",
            "name": "Cathy Swanson",
            "id": 7
          }
        ],
        "imgUrl": "a1375261343_10",
        "length": " 02:49",
        "country": "PRI",
        "songtitle": "A mi corazón",
        "bandname": "INTENTO SUICIDA",
        "id": 6
      }
    ],
    "kuratorImg": "http://placehold.it/700x700",
    "kuratorDescription": "Non aute cillum veniam pariatur fugiat nisi occaecat cupidatat incididunt ullamco laborum nulla duis. Sit eiusmod amet culpa exercitation eu dolore exercitation minim ut dolore. Commodo est enim labore esse dolore exercitation esse. Non occaecat dolore dolore sint. Here augmented by three additional CDs of b-sides, Peel Sessions, alternate mixes and a live recording from Manchester’s Russell Club, the original album still sounds like nothing else from the time, as if a line is drawn on the sand and the full potential of what punk had to offer is finally realized. Indeed, Metal Box is still so far ahead of the curve that if it was getting its inaugural release now and it’d still be daring other bands to catch up. The 'White Album' felt like the ‘crash,’ the day after the ‘trip,’ when the excesses of speed that the LSD had been cut with showed their head, leaving me with an uncomfortable feeling ... one of uncertainty, pending doom, and a disconnection to say the least ... a feeling I just wanted to sleep through, wake up and find that all of the music on this double release made sense. I had to set this record aside for a very long time, going to places like Vietnam, where the world actually was schizophrenic.  And now, nearly forty years later, while I have come to appreciated the songs as a very good grouping of music, I still see the ‘White Album’ as the light at the end of the tunnel, a tunnel that had once bathed and warmed me in strobing colours, psychedelic sensuality, pleasantly distorted shapes that would bend and ebb, as musical notes, like breezes changed my total perception ... I thought the light at the end of the tunnel would be more this, but then as The Beatles had grown up, so had I, and I was left with the reality that most things are not what they seemed.",
    "kuratorName": "Tameka Fowler",
    "kuratorId": 678
  }
]