[{
  "entries": [{
    "comments": [{
      "comment": "love the intro so much. It just touch me deep inside. Her beauty is also outstanding, she is one in a million! So we’re gonna heal. We’re gonna start again. You’ve brought the orchestra, synchronized swimmers; you are a magician. Pull me back together again the way you cut me in half. Make the woman in doubt disappear. Pull the sorrow from between my legs like silk, knot after knot after knot. The audience applauds… but we can’t hear them.",
      "name": "Ola Burt",
      "id": 0
    }, {
      "comment": "I every so often falter to her poems, rhythms and lyrics; loving the erection of my hairs standing so freely upon my temple. She's one of a kind and I'm so pleased to have met her several years ago. Such a brilliant beautiful woman.",
      "name": "Wilson Harrington",
      "id": 1
    }, {
      "comment": "album of the year?? try album of the century",
      "name": "Tyson Gutierrez",
      "id": 2
    }, {
      "comment": "SHE IS TRULY A GODDESS, OBSESSED WITH THIS",
      "name": "Carney Hughes",
      "id": 3
    }, {
      "comment": "This and XO are like my top 2 fav songs from her. I love all of her songs",
      "name": "Kelly Richards",
      "id": 4
    }, {
      "comment": "Can someone please just tell me when have they ever made a bad song because I can't find any that's just how good they are and his voice is just amazing",
      "name": "Ray Pena",
      "id": 5
    }],
    "imgUrl": "a1097726293_10",
    "duration": "03:32",
    "country": "RUS",
    "songtitle": "Leaving the House",
    "bandname": "Mørdegard",
    "id": 0
  }, {
    "comments": [{
      "comment": "Wow ... This song is amazing, deserve more views and recognition damm!",
      "name": "Vincent Dodson",
      "id": 0
    }, {
      "comment": "Anyone else hooked in the first few seconds?! Goosebumps! So good! Hey guys, I make music on my channel. A little love goes a long way",
      "name": "Puckett Cardenas",
      "id": 1
    }, {
      "comment": "And then they went and wrote a musical based on this.  A prime example of why their songs hold up so well 40 years on.",
      "name": "Frederick Ashley",
      "id": 2
    }, {
      "comment": "how to find a good band great original tracks that don't repeat the same 4 words. the artist preforming composed the song and they make you feel happy.",
      "name": "Obrien Wilkerson",
      "id": 3
    }, {
      "comment": "I'm 15 and I love them. They are so much better than the artists of today.",
      "name": "Gallegos Stevenson",
      "id": 4
    }, {
      "comment": "Great song, I was fine right up until the old guy...so...yeah that's where I'm at.",
      "name": "Tate Burgess",
      "id": 5
    }, {
      "comment": "Although this project was created as a joke, it's way too good to ignore. Yes, purist Black Metallers will reject this and if you're thinking that this is a BM album, you'll be sorely disappointed. If you are however looking for something completely different, with genres ranging from staccato-styled rock, spiritual slave music, muslim-inspired trap-beats, Black Metal and soul, this might be your thing. I picked up both albums on Bandcamp and been listening to it for a few months by now. Whilst the first album is much more genre-blending, this second album has a lot more BM influences. Personal favorite top 3: Come On Down, Blood In The River, Death Of A Billion. I need a physical copy of this as well. Thanks for the music Manuel Gagneux!",
      "name": "Zamora Watson",
      "id": 6
    }],
    "imgUrl": "a2934724457_10",
    "duration": "03:50",
    "country": "USA",
    "songtitle": "Columbian Necktie",
    "bandname": "Wild Year",
    "id": 1
  }, {
    "comments": [{
      "comment": "Incredible song, but let's admit it ... ! The instrumental part sounds too much amateur ... I mean, it´s VERY GOOD but we can sadly feel the lack of professional mixing & mastering ... Hopefully it will be resolved with the next brand new physical copies",
      "name": "Jenny Merrill",
      "id": 0
    }, {
      "comment": "Well, this is different. I can dig it. The sound would be a lot better if they went for a Xasthur sound during the metal parts though.",
      "name": "Deena Harding",
      "id": 1
    }, {
      "comment": "I don't know why this is such an odd combo for some. It's old school type blues which many metal and rock artists copied (Robert Johnson etc). But anyways spirituals and metal. Awesome combo.",
      "name": "Joyce Morin",
      "id": 2
    }, {
      "comment": "The story behind this is glorious; Lead Michael Gagneux posted a request for genre mash-up suggestions; one individual posted 'Black Metal', another posted 'nigger music' (naturally, the forum being 4Chan). Little did the individual who posted the latter expect Gagneux to deliver in the purest sense- samples depicting enslaved African Americans launching a crescendo of subversive roars, all originally constructed by Gagneux himself.",
      "name": "Rogers Weeks",
      "id": 3
    }],
    "imgUrl": "a0480551446_10",
    "duration": "02:45",
    "country": "USA",
    "songtitle": "OPEN DOORS",
    "bandname": "Humbody",
    "id": 2
  }, {
    "comments": [{
      "comment": "Holy balls, this is ingenious. I'd stick it right into a Bioshock: Infinite trailer, it gives me similar vibe to Nico Vega for some reason.",
      "name": "Jewel Rasmussen",
      "id": 0
    }, {
      "comment": "Ohh my fucking god... It's amazing! I never heard anything like this before.Greetings from Hungary.",
      "name": "Rachael Sparks",
      "id": 1
    }, {
      "comment": "i really really love these guys a friend of mine told me to check these guys and boy, im glad i did they are amazing!!!!!! i hope they come to america soon",
      "name": "Elaine Benton",
      "id": 2
    }, {
      "comment": "I grew up in Russia, with my mom and grandma being deeply religious, and because of that I have been dragged into church as a kid quite often. There's something eerie and depressing about being inside of Orthodox Christian Church, hence why religious people always go there to grieve and be alone with their thoughts. The sole presence there definitely creates the mood that is very heavy-hearted and mentally pressing. That being said, I think adding black metal to that atmosphere is a great idea.",
      "name": "Bettie Dickerson",
      "id": 3
    }, {
      "comment": "Cool especially since their music is so lyrically and thematically specific, you know Eastern Europe, anti Orthodox Christianity. Oh  and from what I've heard their live shows definitely are not something to miss.",
      "name": "Patty Hendrix",
      "id": 4
    }, {
      "comment": "You know, I'm starting to think Black Metal is not actually that anti-Chistian. After all the character of Satan comes from Judeo-Christian mythology and all these Norwegian kids who wanted to play the bad guys actually supported this worldview instead of challenging it. What I find more interesting about BM is it's fascination with distant and forgotten past and it's spirituality and criticism of soulless modern world... and if at some point a branch of Christian culture starts to be seen as this 'voice of the past' why not incorporate it into BM sound? Yeah I realize these guys are not Christians but this album still probably made a lot of trve kvlt warriors mad",
      "name": "Shepard Melton",
      "id": 5
    }, {
      "comment": "This shit sounds like Mgła and Ygg fused into one unholy, monstrous, and beautiful fucking being all at once. Yet again, Poland, crushing the black metal scene.",
      "name": "Valenzuela Justice",
      "id": 6
    }],
    "imgUrl": "a2123948638_10",
    "duration": "05:23",
    "country": "NOR",
    "songtitle": "my soul",
    "bandname": "r0x4ry",
    "id": 3
  }, {
    "comments": [{
      "comment": "One of the greatest black metal albums I've ever heard. It rivals Deathspell Omega's 'Kenose' and 'Drought' for spiritual transcendence of the blasphemous variety.",
      "name": "Barlow Acosta",
      "id": 0
    }, {
      "comment": "It is indeed a good song, the instrumental is top notch, the lyrics have a meaning, overall a nice song to listen if you want to calm yourself.",
      "name": "Wise Moses",
      "id": 1
    }, {
      "comment": "Never heard of this band before, I just happen to come across it and fell in love. Now I am looking for it on I-tunes.",
      "name": "Tina Carney",
      "id": 2
    }, {
      "comment": "How is that possible? I saw these guys at SXSW a couple years ago and it was one of the best shows I could have ever come across. I still remember that night perfectly. I would follow this band to the end. They're incredibly talented and passionate about what they're doing and it shows when you watch them live! Infinity likes from myself and everyone I've introduced to the bands sound! ALL MY LOVE FOR THE MIGHTY OAKS! Meow come back to Austin, TX. xoxoxoxoxo's",
      "name": "Boyd Ramos",
      "id": 3
    }, {
      "comment": "Came across these guys a few months ago, nice sound, purchased 5 tracks via itunes, regular play rotation, brother, seven days, back to you,, just one day, you save my soul, plus like the nw connection.",
      "name": "Deana Lindsey",
      "id": 4
    }, {
      "comment": "I didn't know where this was filmed but it looked great then I noticed a graphitti on the walls (2:54) saying Dućan and Frizer (Дућан, Фризер)....SERBIA? :D OH MY, awesome! Please come back!",
      "name": "Pace Fields",
      "id": 5
    }, {
      "comment": "I love this!! this is my favourite song on the album, this is awesome",
      "name": "Reva Sheppard",
      "id": 6
    }, {
      "comment": "Everytime I listen to this song, I always stare at the photo imagining myself actually standing there like I just woke up. Smelling the freshly brewed coffee, feeling the cold yet welcoming hard wood floor, slowly walking up to her trying to sneak a hug in.  But she hears me and turns around, I could just imagine seeing her in this light and knowing that all my worries are gone for that just one moment she looks at me with her natural face, wearing my shirt and her hair messy. Then the song ends. And I am back to my reality. Oh well, maybe one day.",
      "name": "Smith Lyons",
      "id": 7
    }],
    "imgUrl": "a4097035149_10",
    "duration": "02:04",
    "country": "GB",
    "songtitle": "Lifejacket",
    "bandname": "No Hands",
    "id": 4
  }, {
    "comments": [{
      "comment": "this song feels like you are in your kitchen on sunday morning and everything is beautiful. and you just stop drinking your tea and you think every bad moment that you've seen has gone. everything is passing and you are just watching, like a river.",
      "name": "Nichole Haney",
      "id": 0
    }, {
      "comment": "i opened bandcamp to listen to a specific song. for some reason this video was in my recommendations list, and the picture caught my eye pretty quickly. i really wanted to listen to that other song, but for some reason i clicked on that beautiful picture. i'm glad i did.",
      "name": "Sharp Graham",
      "id": 1
    }, {
      "comment": "middle East deep water this song REM everybody hurt's are the last song's my dad listened hours before he died , these songs will stay with me for ever , every time I hear them they make me cry ,my dad was my life line he was always there when I needed him he is a legend and I am missing him very much ,we all Love u are always in our thoughts and prayers, I still think he is playing a trick on me and he is going to walk through the door and Surprise us but in the end I know it will never happen,but I know one thing I will see him in heaven I just didn't know.",
      "name": "Patsy Case",
      "id": 2
    }, {
      "comment": "I stumbled in here by happenstance. Man, was I ever the lucky-one. This song is a pure gem and until now - I never heard of it or the artist. Beautiful work, just stunning. I'm going to support and find this musician - I love this as a way to discover and expand your musical horizons. Nice work here",
      "name": "Katheryn Horton",
      "id": 3
    }, {
      "comment": "My favourite thing about indie music is this yt community behind it. Because every comment is so positive! I love you all... It makes my day to put on some indie and read all of the positivity and love in the comments.",
      "name": "Chang Flynn",
      "id": 4
    }, {
      "comment": "Releasing a live album can help your band in many ways. It can serve as a compilation of the group's previous work all put onto a single disc, it can introduce the live element to the quality of the group, but in 10,000 Maniacs case, the MTV added exposure helped them gain fans and put their soft jangle pop out to the kids. Sure their music was happening when the television company were just establishing themselves before featured animation shows would do that; inviting big time artists to perform live for the network concerts which would turn into television episodes. Stars such as Nirvana, Eric Clapton, and even Bob Dylan would go on to appear on this show, but probably being the lowest publicized act outside of college radio, 10,000 Maniacs did not have a mainstream presence. While this album did not kick them directly into the mainstream, it did help them out by making their music available to the MTV crowd and presenting it the way it was made, using Merchant's lush and versatile voice with the folk guitar styling of the late Robert Buck.",
      "name": "Kelley Talley",
      "id": 5
    }, {
      "comment": "Our Time in Eden stands head and shoulders above the rest of the 10,000 Maniac's albums and made listening to all of their Natalie Merchant albums leading up to this one a worthwhile endeavor. Our Time in Eden isn't a great album in the sense that all the tracks play off eachother and the whole album is greater than the sum of its parts. Rather, there is a high density of excellent tracks to be had here with a derth of overtly political/bland tracks that have dragged down past efforts. By my count there are sixtracks here with the rest still serving in a capacity. The biggest strike against this album is the general sameness between the tracks on the album. Every track is in the Maniac's jangly folk pop style but this is without a doubt the pinnacle the band would reach in this mesh of genres. In retrospect maybe this album was too good for Natalie Merchant and finally inspired her to embark on a solo career. I can't really blame her, I've never listened to 10,000 maniacs for any other reason besides Merchant's vocal talents and catchy melodies. Our Time in Eden is the only Maniac's album worth listening to for generalist music fans but if further interest abounds, In My Tribe is the next logical album for new listeners.",
      "name": "Harriett Kaufman",
      "id": 6
    }, {
      "comment": "While not bad by any means, the Maniac's, or probably more likely Natelie Merchant's formula of preachiness with a beat has begun to wear thin.  There are some likeable melodies here, such as These Are Days best lyrics on the album, Candy Everybody Wants and Stocton Gala Days, but songs like I'm Not the Man and Jezabel really bring things down.  C'mon guys, smile every once in a while!",
      "name": "Wiggins Green",
      "id": 7
    }],
    "imgUrl": "a3061196798_10",
    "duration": "04:32",
    "country": "NZL",
    "songtitle": "Winter",
    "bandname": "3 Shots to the Head",
    "id": 5
  }, {
    "comments": [{
      "comment": "Irure labore est in anim dolore ex aliqua mollit qui ullamco ullamco enim aliqua. Ut officia ipsum amet consequat laborum aliqua magna cillum. Id nostrud reprehenderit aute sunt aliqua deserunt aute ea labore voluptate.",
      "name": "Beth Wong",
      "id": 0
    }, {
      "comment": "Compared to their delightful first two records, their descent into R.E.M.-like morose folk-pop intellectualism is pretty sad. Their dreamy roots only resurface in Eden, while their erstwhile playfulness and diversity is nowhere to be found. Their newfound appetite for the dead-serious and the epic succeeds in Tolerance, but mostly this is a yawn fest.",
      "name": "Iva Dudley",
      "id": 1
    }, {
      "comment": "10,000 Maniacs without Natalie Merchant, and apparently without any memorable tunes as well.  There's nothing specifically wrong with the vocals of Mary Ramsey, but they add absolutely nothing to songs that are already incredibly bland.  The only track here that remotely stands out is the piano-driven ballad A Room for Everything. The rest of the songs range from merely nice Love Among the Ruins, Even With My Eyes Closed, Green Children to sleep inducing Girl on a Train, an amazingly uninspired cover of Roxy Musics More Than This, Across the Fields.  Although I doubt that Natalie Merchant would have been able to save most of these songs, it still would have been nice to see her try.",
      "name": "Joan Lewis",
      "id": 2
    }, {
      "comment": "Stumbled across this in the CD racks and glad I took a £4.99 gamble.  I knew it wasn't from their 'classic' 80s era and Nat wasn't in the line-up, but I thought I'd investigate. This is not a bad album - it has strong elements of the trademark Maniacs sound.  It's well-played folky-pop and Mary's vocals are pretty good.",
      "name": "Prince Knox",
      "id": 3
    }, {
      "comment": "I wasn't at all surprised that this album was a disappointment.  Let's face it, replacing Natalie Merchant was more then just replacing the voice of the band.  Seriously, it would be like replacing Sting in the Police or Plant in Zeppelin.  Merchant brought so much to the table that helped define the Maniacs sound.  Lyrically poignant, sensually mysterious, sporting an engaging, unique voice...one can't help but be pulled in.  The band is still here.  Churning out gripping arrangements.  Complex, textured sonic landscapes.  Unfortunately, new vocalist Mary Ramsey isn't up to task.  Where Merchant brought depth and tension, Ramsey seems forced and contrived.  One semi bright spot is the cover of Roxy Music's, but even that makes you wonder how much better it would have been with Natalie.",
      "name": "Glenn Mccoy",
      "id": 4
    }, {
      "comment": "This album is not that bad if you enjoy folk/ traditional celtic music.  I think Mary has a great voice and hearing her cover these classic tunes was a nice experience.  Don't expect to be blown away by the album but if you enjoy this type of music there is no reason to not give this album a try.",
      "name": "Wyatt James",
      "id": 5
    }, {
      "comment": "When I played this album again recently, I consider I must have been living in a rock wilderness in the eighties. When I see some records I bought around this time, this, Lone Justice and others that I will not mention I must have been really confused. The end of the seventies was a cataclysmic event for me.",
      "name": "Doyle Alvarado",
      "id": 6
    }, {
      "comment": "My rating reflects an average of my rating of the album's first half, which I like very much, and my rating of the second half, which I find merely listenable. This album has a mix of some very forgettable songs and some very good songs. I can't understand a single thing she says, but it's definitely worth getting to know at least the first half.",
      "name": "Cathy Swanson",
      "id": 7
    }],
    "imgUrl": "a1214292115_10",
    "duration": "02:14",
    "country": "GB",
    "songtitle": "walk the dog",
    "bandname": "sleepovers",
    "id": 6
  }],
  "kuratorImg": "http://placehold.it/700x700",
  "kuratorDescription": "In director Pablo Larrain’s Jackie, unlike almost any movie made about the assassination of John F. Kennedy, there are no hints of shadowy puppet masters or boogeymen: there is simply the spotlight on one person’s grieving, complicated by the grief of an entire nation. Accompanying the film is a score written by Mica Levi, whose work in film in the last three years is slowly surpassing any of her output as an experimental producer or art-pop rocker (with Micachu and the Shapes). Her score for Jonathan Glazer’s Under the Skin proved Levi’s ability to create sound that is not only atmospheric, but definitive to the film itself. With the power of an orchestra behind her, Levi provides Jackie a palpitating pulse for the film’s portrait of a seemingly unknowable historical figure. The score introduces itself in the film immediately as Natalie Portman walks through autumnal grounds of the Kennedy compound. She is walking towards her home, to meet a reporter (Theodore H. White, who wrote a LIFE magazine article that largely began the Camelot myth surrounding the Kennedy administration) to discuss life after November 22. The camera zooms in on Portman’s grimace, as she makes her way home, and Levi’s “Intro,” swoops into the scene with ghostly strings, immediately setting a tone of melancholy. Throughout the film, Levi’s score is used sparingly, but with sensitive accuracy. Here in these first few minutes of the film, it gives weight to all the dead foliage. The camera often lingers on Portman’s face, especially when she is looking in the mirror. In moments like these, Levi’s score emerges unexpectedly, giving a strange stability to these often frayed and vulnerable visual experiences. One moment in particular haunted me. Shortly after the assassination, Portman finds herself in the bathroom of Air Force One, right before LBJ is sworn in as president. She looks in the mirror, wiping away blood from her face and blouse. When Portman cleans the viscera off the mirror, smudging its surface and blurring away her image, the piece “Tears,” which was barely perceptible as a nervous string arrangement at the beginning of the scene asserts itself. A simple chord progression of keys gives a momentary balm, and frames the scene perfectly. Jackie is replete with visual moments like this one, that are painful to look at. What Levi’s music can do is provide a brief respite, smoothing the razor edges of a picture. And unlike her work in Under the Skin, Levi’s score in Jackie is unobtrusive, it exists when you need and want it to, providing either a relief from or a multiplication of the grief the film is relating.",
  "kuratorName": "Tameka Fowler",
  "kuratorId": 678
}, {
  "entries": [{
    "comments": [{
      "comment": "In high school I had a couple hours between when I arrived home and when my mom got back from work. These periods were almost always spent listening to albums I had pirated off soulseek in 128 kb/s mp3 and burned on to CD-Rs, such as this one, while consuming my signature combination of Cheez-Its and Cherry Coke, kicked back with my feet up on the desk. I would do this so frequently that now I can't listen to the dozen or so albums that I'd regularly spin without thinking of those days and the almost nauseatingly low amount of responsibility I had. This era of Mudhoney truly defined grunge in my opinion in that it's fuzzed out, raunchy, sleazy, and perfectly combines the attitudes of punk rockers with those of the original garage rockers in to one sweaty mess of rock and roll, and You Got It is one of the best examples of this.",
      "name": "Ola Burt",
      "id": 0
    }, {
      "comment": "Remember when Chachie joined Happy Days?  He was Fonzie's cousin.  Ever since Chachie had been born he'd been in Fonzie's life.  As viewers, we were expected to accept that he was as cool as Fonzie, or at least almost as cool.  Thing is, we knew better.  He wasn't cool.  He was a nerd pretending to be cool.  He was no Ralph Mouth or Potsy, mind you, but still he was a nerd.  He was like the uncoordinated little brother of a jock.  He knew all of the cool kids and he knew how to act cool, but only because his older brother was a stud.",
      "name": "Wilson Harrington",
      "id": 1
    }, {
      "comment": "Until Mark Arm screams, this is tolerable for the most part.  Think if Trout Mask Replica was completely conventional and mixed in loads of punk music.  It's all loud, depressing when slow, okay when fast, stagnant most of the time.  And did we ever need to hear the entire album backwards?",
      "name": "Tyson Gutierrez",
      "id": 2
    }, {
      "comment": "far and away the best thing these guys put out on a major label. judgement rage..., 1995, and into yer schtik all have the energy and venom of the groups halcyon days, and are some of my favorite tracks of theirs. all fans of proto-punk of all shapes and sizes take heed...",
      "name": "Carney Hughes",
      "id": 3
    }, {
      "comment": "Being a fan for well over a decade now, I can't help but to feel thrilled anytime they decide to grace us with their presents. On The Lucky Ones - they're using their old tricks. You got your raunchy lyrics, your thrashing guitars, your aggressive feedback, and it is all accompanied by Mark Arm's same old scoff. If you enjoyed the Mudhoney circa 95', I've got a feeling you will really enjoy this. I'm Now starts the album off just right with its crude thud and continues through the next two tracks. Next Time and And the Shimmering Lights showcases their garage rock flair and maintains that method throughout the remaining of the record, while the whole time making it sound fresh and exciting. The other track that really sticks out in my mind is What's This Thing, with its chic sound and chanting lyrics.",
      "name": "Kelly Richards",
      "id": 4
    }, {
      "comment": "his would be remains from 90's alternative rock with some grunge sounds. A few shorter good punky tunes as well. In general still quite bland and boring for most parts. At best they sound a bit Pearl Jam like, but for most parts it seems like they are lost in what they want to sound like, and hence make a bunch of various alternations on the grunge and alternative sound, resulting in a quite unbalanced album as for the material.",
      "name": "Ray Pena",
      "id": 5
    }],
    "imgUrl": "a1796876171_10",
    "duration": "04:33",
    "country": "FR",
    "songtitle": "In the sanctuary of Gods",
    "bandname": "L'oeil turquoise",
    "id": 0
  }, {
    "comments": [{
      "comment": "n first thought, the baby on the front is as creepy as all get out. Upon further meditation, it's the only cover artwork that fits. The titular opener is the soundtrack to the womb: drum beats as a heart machine, electronics as the golden light that culturally garbs a growing child. The uncanny accuracy of the representation scares me, actually: it means that when there's change and movement (cf. foreboding melody and wavering beat at 13:04), it means that something's happening to the child and then I get distressed. Fauni-Gena is whispers in the thin distance, sunrise over the boreal forest: a nature documentary chill yet totally arresting. It's amazing how the chiming woodpecker totally charges and changes the song. Oscillation is another important element brought to the forefront here: unlike Electronic Meditation's searing coils, Atem blurs itself into immaculate peace. Circulation of Events and Wahn are the closing half, slightly more in focus yet still elegant in their laconic dreams.",
      "name": "Vincent Dodson",
      "id": 0
    }, {
      "comment": "Musical depiction of the history of earth, from its volcanic beginnings to the lush foliage of the Jurassic, on through an intermittent ice age and the first recorded musical attempts by man.  Don't believe the naysayers - Atem is a wondrous album.",
      "name": "Puckett Cardenas",
      "id": 1
    }, {
      "comment": "Druggy as fuuuuarrk! You can nearly hear the pitter-patter of cognitive shifts these krauts are experiencing. It's not all proto-ambient noise; sometimes they get on a groove but then I assume forget they're on a groove so they kind of meander into oblivion. Then they got that guy playing flute and it makes me happy. I think this is better than that first Ash Ra album, and I should know because I used to wear a Neu! shirt in high school.",
      "name": "Frederick Ashley",
      "id": 2
    }, {
      "comment": "That being said, this is a pretty decent pop song. Even though it's fairly straight forward in its 90's RNB and Mariah Carey-like delivery and the fact that is not nearly as good as Carey's recent single with Miguel, it's just a fun song. The way her vocals bounce to the excitement of what's she saying is just great. The piano from a Brenda Russell piece just perfectly compliments her energy. It's just a fun pop song.",
      "name": "Obrien Wilkerson",
      "id": 3
    }, {
      "comment": "The reason why I didn't give this song five stars is because of Mac Miller I don't like his part in the song. If she had done the song without him then the song would of gotten five songs. She is like a mini Mariah I love it. She doesn't need Mac Miller to help her out with a voice like that.",
      "name": "Gallegos Stevenson",
      "id": 4
    }, {
      "comment": "It's a pretty typical pop song, but the breathy vocals really surprised me the first time I heard it on the radio. Sounds like Fantasy era Mariah, and it's one of the best Top 40 hits this year. Nice.",
      "name": "Tate Burgess",
      "id": 5
    }, {
      "comment": "I love it, but her damn voice sounds so fake. How many tweaks would have to be made so that my voice sounds like an exact replica of an emotionless Mariah Carey? Where is that plug-in for Adobe Audition? Take my own personal gripes about the vocal tantalizing out of the mix, and you're left with a terribly generic pop love ballad. Mac Miller's position on this is pointless. At least he can stop trying to pretend to appeal to the classic hip-hop crowd now that he's a certified Disney star. Or does that just put him in a category with Drake? Fucking Mike Miller man.",
      "name": "Zamora Watson",
      "id": 6
    }],
    "imgUrl": "a4035878767_10",
    "duration": "06:19",
    "country": "USA",
    "songtitle": "Me and Your Mama",
    "bandname": "Childish Gambino",
    "id": 1
  }, {
    "comments": [{
      "comment": "Vocally, this is excellent. Nicki's verse shows her in great form, and Ariana and Jessie put forth their usual solid performances. But the song itself doesn't ever seem to hit the heights it threatens to. It's like it's building to something amazing, and the song is over before it ever gets there.",
      "name": "Jenny Merrill",
      "id": 0
    }, {
      "comment": "Although this instrumental focuses a bit too much on percussion, it does have a certain bounce to it. The drum sounds that the producers selected are quite dope, and don't get stale by the end of the song. The trumpet stabs also give the song character and life.",
      "name": "Deena Harding",
      "id": 1
    }, {
      "comment": "I have to admit, the chorus is actually pretty catchy!",
      "name": "Joyce Morin",
      "id": 2
    }, {
      "comment": "This would be a great song if Nicki's verse wasn't so bad. As it is, it's just good. I'm not usually a fan of pop reggae production, as I find it to be lazy, but as is to expected from an Ariana song, the rich production actually makes the beat work really well. Of course, it helps that Ariana is such a powerful and commanding presence. A really solid song that would probably be better without the guest. I don't get the hype around Nicki - aside from a few big pop hooks and her features with Kanye, I don't think she's any good, and her lyrics are borderline unintelligible. It's no different here. Thank God Ariana is so great.",
      "name": "Rogers Weeks",
      "id": 3
    }],
    "imgUrl": "a1766562230_10",
    "duration": "03:36",
    "country": "SCO",
    "songtitle": "Sobotka",
    "bandname": "Carson Wells",
    "id": 2
  }, {
    "comments": [{
      "comment": "Awesome very fun jazzy pop song. Her voice is perfect as always. This can be added to a list of like a million reasons why i'm such a huge fan of them",
      "name": "Jewel Rasmussen",
      "id": 0
    }, {
      "comment": "Let's start on the positive notes. I think Ariana Grande is a vocalist, although I prefer her coos to her belting. The verse melody is pretty nice though, although she really pushes her range in the pre-chorus. I also like the horn-driven instrumentation which has a real nice groove.",
      "name": "Rachael Sparks",
      "id": 1
    }, {
      "comment": "Eugh, I feel like ever since the success of Talk Dirty to Me pop producers are starting to think it's alright to just throw an obnoxious Yakety Sax type sample as the core of the smash single. How did that ever become a thing??? Can it die yet?",
      "name": "Elaine Benton",
      "id": 2
    }, {
      "comment": "I guarantee this song will become a standard in movie trailers for at least the next 6 months in the next few months if it isn't already. The song itself works and i dig more than the rest of her stuff i've heard. The horns are the main draw honestly though.",
      "name": "Bettie Dickerson",
      "id": 3
    }, {
      "comment": " think the best thing about this song is how many different sections and moods it runs through in just over three minutes, with nearly all of them being quite excellent. Obviously, we’ve got that sax riff, which is one of the most devilishly catchy things I have heard this year. Aside from a couple of niggles I have with its recording (I’m fairly certain its synthesised as well), it’s just one of those riffs that just gets you moving in such a fantastic way. Every time I hear it, particularly when it comes in after the first chorus (if you can really call it a chorus) I can’t help but be reminded of this gif (bonus shoutout to the best subreddit in existence). That’s how groovy it is.",
      "name": "Patty Hendrix",
      "id": 4
    }, {
      "comment": "But on top of that, this song gets a ton of extra credit from me for a point I just glossed over - there is no chorus. It still has a relatively rigid pop song structure, but there’s no real “THIS HERE, THIS IS THE CHORUS” part, like so many pop songs force themselves to have. But instead of that, we just get an ever-increasing count of fantastic hooks, and we all know how pop song quality is proportional to the number of hooks per minute.",
      "name": "Shepard Melton",
      "id": 5
    }, {
      "comment": "I don't know about 'vaporwave' but this sounds like a real plunder-phonics album to me. The tracks are all short (most under 2 minutes) and packed with ADD sampling/sounds and changes in direction. The overall feel is spooky and demented but with a playful undercurrent. It's fun for the odd/occasional listen but it's never something I'd be likely to have on heavy rotation.",
      "name": "Valenzuela Justice",
      "id": 6
    }],
    "imgUrl": "a2622311276_10",
    "duration": "01:28",
    "country": "IT",
    "songtitle": "I hope You Die Fluorescent Whore",
    "bandname": "Super! Radioactive mushroom cloud",
    "id": 3
  }, {
    "comments": [{
      "comment": "Most of the early Sun Ra albums have one or two tracks that point toward a decidedly more experimental form of jazz alongside conventional big band/post-bop-ish tracks. But of all the early Sun Ra I've heard, this is far and away the most conventional overall. Apart from the extremely intriguing Ancient Aiethopia, all of this is very, very straight. Hell, his debut's more complex than this is.",
      "name": "Barlow Acosta",
      "id": 0
    }, {
      "comment": "I've never been a huge fan of this album. The reason why is that it's just not that interesting. It lacks the originality that can be found in later Sun Ra albums. It does have some great, classic tunes though, such as Images, Enlightenment, Saturn, and of course the amazing Ancient Aiethopia. Blues at Midnight goes on far too long without much change though",
      "name": "Wise Moses",
      "id": 1
    }, {
      "comment": "The thing is, it's damn enjoyable anyway, even if the only hints of Space is the Place come in the form of Ancient Aiethopia. The band Ra assembled plays excellently together, frequently bolstering the melodies with sympathetic and complex horn arrangements. This is, basically, a small combo bop record arranged for big band, which means you get the best of both worlds: the terrific arrangements and easygoing spirit of the best big band matched with the psychic communication of the best small combo. Midnight Blues is a great example of this, as it features some great horn charts in the heads but is more interested in those solos, all of which smoke.",
      "name": "Tina Carney",
      "id": 2
    }, {
      "comment": "There are hints of what would come afterwards, though. Enlightenment is more about mood and groove than melody or solos, slinking around various tempos and whatnot. Unsurprisingly, it went onto become a concert favorite, and apparently the group added vocals, which probably had something or other to do with space. Or acid. Sun Ra must've been a big acid fan, right? Anyway, the other odd one is Ancient Aiethopia, which uses odd horn motifs and a lot of low end to create the sort of unique experience Ra would later specialize in. It also features an atmospheric instrumental segment, and while it doesn't have the flow or groove of Space is the Place, it's still a solid composition.",
      "name": "Boyd Ramos",
      "id": 3
    }, {
      "comment": "Demonstrating that he could offer up accessible post-bop material if he really wanted to, Jazz In Silhouette is certainly one of Sun Ra's more approachable albums, but for that exact reason it just isn't quite as interesting as his avant-garde work.",
      "name": "Deana Lindsey",
      "id": 4
    }, {
      "comment": "It is easy to see why 1959's Jazz in Silhouette is one of Sun Ra's most cherished recordings. It is far more accessible than his late 1960s albums, as it is firmly rooted in the bop and swing traditions which he displays mastery of on Saturn. It also has more futuristic numbers like Ancient Aiethopia and Blues at Midnight which distinguish him from most of his contemporaries at the time. Since I prefer my Ra a little stranger than this, Jazz in Silhouette is an album of his I don't return to all that often. It is a still one of the strongest LPs from the period.",
      "name": "Pace Fields",
      "id": 5
    }, {
      "comment": "This one gets overlooked. Granted, it's one of the more schizo Ra offerings, in that 4 of the tracks sound like they're from the Cosmic Tones for Mental Therapy frame of compositional abstraction, while the remaining 3 Ankh, Lights on a Satellite, and Kosmos in Blue, are from the Bad and Beautiful sessions, and share that album's half-assed, almost conventional jazz sheen.",
      "name": "Reva Sheppard",
      "id": 6
    }, {
      "comment": "But the whack tunes Cluster of Galaxies, and The Outer Heavens, in particular have that early '60s Sun Ra character about them, full of that smokey, contemplative aura that makes Mr. Blount seem more accurately placed on a classical than a jazz shelf. And even those 3 conventional-ish bits are lovely in parts, with the usual Gilmore/Patrick and Arkestra far too skilled and dignified to let it ever slide into maudlin lyricism.",
      "name": "Smith Lyons",
      "id": 7
    }],
    "imgUrl": "a3167874966_10",
    "duration": "04:15",
    "country": "IT",
    "songtitle": "Koxette - Alice",
    "bandname": "baumusik",
    "id": 4
  }, {
    "comments": [{
      "comment": "This is some goodbut not great stuff from Sun Ra. It has a good mix of his more avant-garde and more jazz tendencies but it seems he hasn't quite fused the two yet, and the album lacks the flow and cohesion that for me makes an album great. Being from a rock background, some stuff on here really reminds me of the more experimental tracks on Can's Tago Mago.",
      "name": "Nichole Haney",
      "id": 0
    }, {
      "comment": "It seems Sun Ra is consistently very good without being ever truly excellent - but I'd be in a pretty generous mood if I told you Art Forms of Dimensions Tomorrow was 'very good'. It's enjoyable but by now I kinda get the idea. This is similar to Cosmic Tones but less engaging, though the forays back into more conventional territory like Kosmos in Blue and Ankh do certainly have their moments. But give me a few days and I probably won't even remember this record's title.",
      "name": "Sharp Graham",
      "id": 1
    }, {
      "comment": "A more experimental offerings from the early 60s New York era of the Arkestra.  It certainly is something different for its era.  As experimental music the results are naturally mixed.  I find my interest trails off as the album moves along.   What it lacks most of all are consistently strong solos.  But there are undoubtedly some interesting ideas floating around in the first few songs, and the reverb/echo effects should be considered more than mere novelties.  Still, I don't pull this album out much.",
      "name": "Patsy Case",
      "id": 2
    }, {
      "comment": "I love the tracks on here that are total studio trickery, but the straighter jazz ones I find I could do without. Cluster of Galaxies and Solar Drums  however, really work for me, totally full trippy out-there other worldliness. It's like they'd just discovered the  echo effect, and man were they gonna use it. Of the jazzier numbers, I really liked The Outer Heavens which is a nice long and slightly free track where John Gilmore really shines with his playing. Not an essential Sun Ra album, but a few tracks make it well worth checking out.",
      "name": "Katheryn Horton",
      "id": 3
    }, {
      "comment": "Trying to keep track of Ra's recordings gives me a headache. What was recorded when under what original title with whom, in Chicago, New York, or on Saturn, how many times was the original broken down into later-released, differently packaged fragments in editions of twelve copies each with wrongly attributed credits before getting paired with another patched-together album from a different era with different unknown musicians...",
      "name": "Chang Flynn",
      "id": 4
    }, {
      "comment": "Anyway, more relevantly, it's my favorite Ra. It's got the earthy Afro and Afro-Cuban percussive sound he had begun to use in late '50s Chicago, prior to his going full bore esoteric, which moving to New York seemed to do to him (not an uncommon outcome for those who move to New York, I suppose). And yet there's enough residual boppiness and remnant strands of big band corniness to keep it varied while his influences are all flashed.",
      "name": "Kelley Talley",
      "id": 5
    }, {
      "comment": "This was my first Sun Ra album (a $1.99 Impulse cutout back in '77) and still my favorite.  It led to dozens of other Sun Ra recordings.  If I had to pick a single track to use to introduce Sun Ra's music to a stranger, its the opener Plutonian Nights, a blues with a dissonant Ra intro on Wourlitzer electric piano and heavy, funky baritone sax by Pat Patrick, father of the current governor of Massachussetts (!)  It also includes the march Watusa which remained in the band's book for 30+ years.  Lots of exotica here, but nothing to give one a headache (like some of the Arkestra's more adventuruous stuff from the '70s) No one else came close to this in 1959! ",
      "name": "Harriett Kaufman",
      "id": 6
    }, {
      "comment": "Probably the most experimental offering of his fifties period. Instead of having two ridiculously ahead of their time tracks alongside the rest of the album's straighter swing/big band stuff (like his earlier albums were), you have two tracks here that are straighter swing/big band stuff alongside the rest of the album's ridiculously ahead of their time tracks. The entirety of the B-side is jaw-dropping. I can hear In A Silent Way during Nubia. Oh, and you really oughta listen to The Golden Lady and then listen to the beginning of the Residents' Third Reich 'n Roll. It's spooky.",
      "name": "Wiggins Green",
      "id": 7
    }],
    "imgUrl": "a2745213182_10",
    "duration": "04:16",
    "country": "RUS",
    "songtitle": "smell of spring",
    "bandname": "Fresh milk",
    "id": 5
  }, {
    "comments": [{
      "comment": "Traveling the Nile on the B-Side See: Nubia, Africa, Aiethopia isn't very rewarding. These tracks feature meditative and calm expressions of ancient times...of royal walks and lower-class free markets, but rarely lift the spirit into the strange and mythical frame of mind I usually seek from Ra's music. Also, some of those drum solos are just too low-key and frantic.",
      "name": "Beth Wong",
      "id": 0
    }, {
      "comment": "ood stuff but there are better representations of Sun Ra's earlier sound.",
      "name": "Iva Dudley",
      "id": 1
    }, {
      "comment": "On the one hand, a very crass attempt  (and a largely successful one on sales alone) to cash in on the Batman craze, on the other, a rather fun garagey/surfy instrumental outing for The Blues Project and some of Sun Ra's cohorts utilizing generic rock riffs and largely public domain music of the time I imagine the biggest expense was the licensing fees for Neal Hefti's Batman Theme. Punctuated with groovy horns, Sun Ra's spook organ on about half the album, unknown background singers, slide and siren whistles and other goofiness of the era, it does make for a pretty fun listen now and then.",
      "name": "Joan Lewis",
      "id": 2
    }, {
      "comment": "Mostly instrumental blues jams, featuring guitar, organ, some horns, and mild exploitation flavor. Original copies came with a pic sleeve featuring the back cover artwork. Surprisingly good for it's type. Grades - 7 B's, 2 B-'s, 1 C+, and a C.",
      "name": "Prince Knox",
      "id": 3
    }, {
      "comment": "I am a huge fan of Batman, but most especially the campy '60s TV show. It was very unique for its time, and while it wasn't very faithful to the source material, a great spin on the comic book genre. With that said, I am also huge into collecting Batman records. The show spawned zillions of albums, all of them created to capitalize on the popularity of the show. This is probably one of the more famous ones. Nothing too crazy though. This is fairly straightforward '60s garage rock. I've definitely heard crazier Batman riffs. And as much as people talk about this being a Sun Ra project, he is not featured on the album as much as one would hope. Still, it's a great gem.",
      "name": "Glenn Mccoy",
      "id": 4
    }, {
      "comment": "I got this from the WFMU blog and it fits the price.  As mentioned before there isn't a trace of Sun Ra on here save perhaps his remarkable versatility.  It's cartoon music based on the most generic riffs possible, so in a way, you've already heard this.",
      "name": "Wyatt James",
      "id": 5
    }, {
      "comment": "A mid-sixties period piece which happened to have Sun Ra and a couple members of his Arkestra onboard as studio musicians. OK cartoon music, but not a Sun Ra album.",
      "name": "Doyle Alvarado",
      "id": 6
    }, {
      "comment": "In 1966 The Blues Project teamed up with Sun Ra for some Batman themed music.Sun Ra and his cohorts i.e.John Gilmore-Tenor Sax,Marshall Allen-Alto Sax, Pat Patrick-Bass low low for the proceedings. Blues Project lead guitarist Danny Kalb shines throughout. A one off werird curio.",
      "name": "Cathy Swanson",
      "id": 7
    }],
    "imgUrl": "a1375261343_10",
    "duration": " 02:49",
    "country": "PRI",
    "songtitle": "A mi corazón",
    "bandname": "INTENTO SUICIDA",
    "id": 6
  }],
  "kuratorImg": "http://placehold.it/700x700",
  "kuratorDescription": "Non aute cillum veniam pariatur fugiat nisi occaecat cupidatat incididunt ullamco laborum nulla duis. Sit eiusmod amet culpa exercitation eu dolore exercitation minim ut dolore. Commodo est enim labore esse dolore exercitation esse. Non occaecat dolore dolore sint. Here augmented by three additional CDs of b-sides, Peel Sessions, alternate mixes and a live recording from Manchester’s Russell Club, the original album still sounds like nothing else from the time, as if a line is drawn on the sand and the full potential of what punk had to offer is finally realized. Indeed, Metal Box is still so far ahead of the curve that if it was getting its inaugural release now and it’d still be daring other bands to catch up. The 'White Album' felt like the ‘crash,’ the day after the ‘trip,’ when the excesses of speed that the LSD had been cut with showed their head, leaving me with an uncomfortable feeling ... one of uncertainty, pending doom, and a disconnection to say the least ... a feeling I just wanted to sleep through, wake up and find that all of the music on this double release made sense. I had to set this record aside for a very long time, going to places like Vietnam, where the world actually was schizophrenic.  And now, nearly forty years later, while I have come to appreciated the songs as a very good grouping of music, I still see the ‘White Album’ as the light at the end of the tunnel, a tunnel that had once bathed and warmed me in strobing colours, psychedelic sensuality, pleasantly distorted shapes that would bend and ebb, as musical notes, like breezes changed my total perception ... I thought the light at the end of the tunnel would be more this, but then as The Beatles had grown up, so had I, and I was left with the reality that most things are not what they seemed.",
  "kuratorName": "Tameka Fowler",
  "kuratorId": 678
}, {
  "entries": [{
    "comments": [{
      "comment": "If you said early 90s alternative rock to me my mind would conjure up something similar to this grunge tinged power pop album. I like this sort of music but the only memorable feature about this album is that Juliana has a pretty voice. President Garfield is an ode to Henry Rollins, original name Henry Garfield.",
      "name": "Marc Miller",
      "id": 0
    }, {
      "comment": "I recently came to the conclusion that whether or not an album would grab me in the first place ultimately depends one thing: circumstances. I mean, other than that, how would you explain that it took me no less than fifteen years to finally get this album? We're talking about a rather straightforward alt rock album, this ain't no friggin' Trout Mask Replica for Christ's sake! Or maybe I'm just stupid. Anyway, I bought Become What You Are back in 1995, right after being blown away by Juliana's third album, the immaculately perfect Only Everything, and for a reason still unknown to me (that is, until recently), I didn't like it. So I put it aside, quite disappointed, and eventually forgot about it. Years passed, then a few weeks ago I gave a spin to Only Everything and found myself caught into some sort of time machine which brought me back to my joyful teenage years. I decided that Become What You Are was up for another chance, and rightfully so! Although I still prefer Only Everything (probably out of nostalgia, but I still feel it's more consistent), I really think this is Juliana at her most pristine: sweet voice, crunchy guitars and irresistible hooks.",
      "name": "Phil Collins",
      "id": 1
    }, {
      "comment": "This is probably the most rocked out of her albums, almost bordering on a grunge sound and although the sweet melodies and adolescent angst / power pop of her later albums are somewhat hidden by this there is still enough in tracks such as Feelin Massachusetts and Spin the Bottle for those who prefer 'indie pop Julianna'.",
      "name": "Peter Meier",
      "id": 2
    }, {
      "comment": "Probably her best known and most consistant record.  It's short (clocking around 40 minutes), concise and for some reason, it doesn't feel as confessional or heavy.  it's 12 songs, good melodies, pleasent singing and not a bad song in the bunch.  it's definitely the one to go with if you're new to hatfield's songwriting.  but it lacks a lot of hatfield's heart-wrenching and maybe even embarassing confessional lyrics that really endears her to people, which depending on your point of view, is either a severe handicap to her music or is a source of brilliance.  so in that way, Become What You Are, may seem a water-down version of hatfield for mass consumption, but it's a strong record none the less.",
      "name": "Deborah Norman",
      "id": 3
    }, {
      "comment": "this used to be one of my favorite albums when i was like 17. i had a huge crush on her because i found her to be interesting musically and extremely cute. i wish i still had the album because it was really good, if i recall. haven't heard it in years though, so it might not hold up...",
      "name": "Audrey Noel",
      "id": 4
    }, {
      "comment": "This is probably the most rocked out of her albums, almost bordering on a grunge sound and although the sweet melodies and adolescent angst / power pop of her later albums are somewhat hidden by this there is still enough in tracks such as Feelin Massachusetts and Spin the Bottle for those who prefer 'indie pop Julianna'.",
      "name": "Ray Pena",
      "id": 5
    }],
    "imgUrl": "a0265022005_10",
    "duration": "04:31",
    "country": "USA",
    "songtitle": "Paris",
    "bandname": "M|O|O|N",
    "id": 0
  }, {
    "comments": [{
      "comment": "I'm glad this album has shown up in Juliana's profile, ridiculous that her best album should be filed seperately under 'The Juliana Hatfield 3' as it had been.  You don't see them doing that with Ryan Adams or Neil Young. One of the highest points of 90s alternative music.  Great production by Scott Litt and twelve terrific, unpredictably structured, fuzztone-soaked catchy Juliana tunes.",
      "name": "Jeanne Smith",
      "id": 0
    }, {
      "comment": "This album is a bit of an odd collection of songs, signing with Warner they brought in REM producer Scott Litt who has an ear for a hit and this shows up but Juliana seems a little uneasy singing all the extra harmonies and commercialized stuff like the organ in 'For The Birds'. This was a tight group of musicians, Dean Fisher laid a tight bass line, Todd Philips is a capable drummer and Juliana puts down the bass completely on this album and picks up her Gibson S.G. This album is best remembered for minor hits 'My SIster' a song about a made up sister showing envy and admiration and that searing distortion guitar break and 'Spin The Bottle' featured on Reality Bites, an acoustic camp fire jangle of a song. Really, it's an album of two halves, the first side is indie rock college friendly melodic songs with some tasty guitar riffs and manufactured rrriot grrl/kick ass attitude (especially Supermodel and A Dame With A Rod), My Sister, This Is The Sound (of a tree falling down), For The Birds could almost have been titled 'For The Byrds' with it's west coast california jangle guitar through a shredder, organs and super sweet lyrics, it's actually close to being pop perfection, Mabel is the weakest track on side one but has some redeeming features, the shrill harmonic guitar break leading into the kick ass A Dame With A Rod. Unfortunately side 2 lacks the depth, catchiness and musical prowess of the first side, 'Addicted' and 'Feelin' Massachussets' sounding decidely B-Side material (especially compared to b sides 'Put It Way' and 'Ruth' from the singles released which would both have substituted better), Spin The Bottle has clever lyrics and breaks up the overdriven sound by being primarily an acoustic driven sound, president Garfield see Addicted/Feelin' Massachussets, however Little Pieces is a decent song with some variation from other songs on the album and then I Got No Idols closes it out on a rockier number but seems similar in texture and feel to A Dame With A Rod except without the cool riffs of the latter. This album has several highlights and side 1 is really strong but like another poster said it may have been better as a 10 song album or sub out a couple of weaker songs for 'Put It Away' or 'Ruthie' which appeared on My Sister and For The Birds singles.",
      "name": "Jefferson Watson",
      "id": 1
    }, {
      "comment": "It's nothing special ... I guess that's all.  My Sister attracted me to this CD because I can somewhat relate to it.  Juliana has an average voice and kind of same-same lyrics but she's made some great tunes here like the truthful opener Supermodel or the harsh sounding A Dame with a Rod.  I Got No Idols ends the disc on a high note as well.  A decent record.",
      "name": "Hardy Booth",
      "id": 2
    }, {
      "comment": "I'm glad this album has shown up in Juliana's profile, ridiculous that her best album should be filed seperately under 'The Juliana Hatfield 3' as it had been.  You don't see them doing that with Ryan Adams or Neil Young. One of the highest points of 90s alternative music.  Great production by Scott Litt and twelve terrific, unpredictably structured, fuzztone-soaked catchy Juliana tunes.",
      "name": "Obrien Wilkerson",
      "id": 3
    }, {
      "comment": "Sometimes the lyrics are so bad they make you cringe, but the music carries the day.",
      "name": "Gallegos Stevenson",
      "id": 4
    }, {
      "comment": "Mercifully brief, catchy, bouncy twee. It's not that different from the other bands doing this sort of thing but at least, it's cute.",
      "name": "Tate Burgess",
      "id": 5
    }, {
      "comment": "I originally heard this band in the movie But I'm A Cheerleader and thought it sounded quite nice, an entire album of quite nice isn't as great as anticipated.  They sound much like Go Sailor or perhaps Heavenly, the big difference is that this doesn't have the sarcasm of Go Sailor, nor the ambience that Heavenly offers, it is however very twee.  'If You Should Try To Kiss Her', and 'Just Like Henry' were my favorites, but it was all a little too cutesy to appear important.  The harmonies are quite nice, and the music is well...a few chords, nothing impressive either but it makes do.  In the end, it's just alright, if you own albums by both of the forementioned bands, you will likely enjoy this, but I can't see this being anybody's favorite album.",
      "name": "Zamora Watson",
      "id": 6
    }],
    "imgUrl": "a1699573444_10",
    "duration": "01:22",
    "country": "USA",
    "songtitle": "In The Field With Brian",
    "bandname": "Datach'i",
    "id": 1
  }, {
    "comments": [{
      "comment": "From what I understand, this is Andy Partridge's growing up album.  Accepting the joys of fatherhood and home life.  That's not to say that it's all sweetness and light here.  'The Smartest Monkeys', 'Books Are Burning', 'War Dance' and 'The Ugly Underneath' are hardly happy themes.  But songs like 'Holly Up on Poppy', 'My Bird Performs', 'hen She Appeared' and 'Humble Daisy' are simply joyful.  'Humble Daisy' is one of my favorites with it's rich harmonies, and Pet Sounds inspired sound.  Also 'Wrapped in Grey' is absolutely beautiful.",
      "name": "Tisha Petty",
      "id": 0
    }, {
      "comment": "Excellent Album",
      "name": "Morrison Pierce",
      "id": 1
    }, {
      "comment": "This is good but I feel it loses steam in those last 3 songs.  Books are Burning and War Dance are too on the nose.",
      "name": "Virgie Rivers",
      "id": 2
    }, {
      "comment": "I first heard Dressy Bessy in the film But I'm A Cheerleader and immediately wanted to know more of their music. The film features 'Just Like Henry' and 'If You Should Try To Kiss Her' both of which are perfectly used in the movie and two of the best 'I've got a crush on you' pop songs around. When I finally found and listened to 'Pink Hearts...' I was pleased to learn that the whole album was just as great as the two songs from the film. Of their  full length albums, I would recommend this over Sound Go Round or Little Music. I would definately recommend this CD to anybody who likes catchy and upbeat hooks and likes to drive with the windows open while singing along... Capable of turning a beautiful summer day into technicolor.",
      "name": "Rogers Weeks",
      "id": 3
    }],
    "imgUrl": "a3638331332_10",
    "duration": "04:53",
    "country": "AT",
    "songtitle": "Follow The Body",
    "bandname": "Zanias",
    "id": 2
  }, {
    "comments": [{
      "comment": "Nonsuch has a very similar vibe and flow as the ones found on Skylarking. A pretty similar pastoral approach, but in a more relaxed and contained way. The band sounds much more calm and mature, but the overall feeling is pretty similar. OK, it might not be as brilliant and as mindblowing as Skylarking, but it isn’t too far from it. I mean it. I guess it’s not too far fetched to say that Nonsuch is actually Skylarking Part II, made 6 years after.  A definitely must have and one of the best XTC albums. Their third best, actually (only behind the already cited Skylarking and English Settlement). Go. Get it. Now.",
      "name": "Blanca Short",
      "id": 0
    }, {
      "comment": "Just when you thought they were lost forever, XTC came up with Nonsuch. And what a delight it is after two terrible weak outputs. When music and melody had totally lost direction and were wandering all over the place on Skylarking and Oranges & Lemons, they found their way back again on this one. To-the-point excellent songs.",
      "name": "Bryant Atkinson",
      "id": 1
    }, {
      "comment": "Barren American college rock takes over after some critics and fans weren't too happy with the 80s overkill on preceding album 'Oranges And Lemons'. Not a good idea, especially when much of the songwriting isn't all that enticing either. However, with two of Partridge's best ever compositions on board, there's some solace in the album's second half. 'Wrapped In Grey' and 'Rook' are steeped in the Beach Boys ballad tradition that plays both to the band's strength - appropriating disparate musical styles by assiduously studying other folks' compositional methods - and also to their weakness - being shameless copyists, mostly in their later period. Surely a single record would have sufficed, it's a shame when the first five tracks of an XTC album leave me cold altogether. I enjoy about a handful of tracks, the rest I can take or leave. Highlights: Wrapped In Grey, Rook, The Disappointed, Omnibus, Bungalow",
      "name": "Maricela Branch",
      "id": 2
    }, {
      "comment": "Pete Pumpkinhead is excellent.  This album reminds me a lot of English Settlement; it's a pretty odd mesh, and there's a lot of good music on here.  My favourite of their three-album comeback.",
      "name": "Marva Woodard",
      "id": 3
    }, {
      "comment": "i am everyone who has ever lived in vermont and the snow is in my  veins, glowing",
      "name": "Owens Riley",
      "id": 4
    }, {
      "comment": "Well folks here it is, the album of all albums in REM's catalong, the monumental Automatic for the People is known as one of the most important albums of the 90's and it was also very popular with teenagers and young adults and gen X'sers everywhere. This album is the peek of there comercial career and is also the most mature and polished of there big albums. This one does not have there landmark single Losing my religion but the result is nothing less beautiful then that monunumental song. This one is the REM we all knew and loved in the 90's the band that sold out stadiums, got played on the radio, and was just beautiful. Hearing songs like listening Drive, Monty got a raw deal, man on the moon and Ignoreland make you want to get up and dance, and beautiful emotional tracks like Everybody hurts, and Nightswimming sound beautiful in the context of this album. In short make sure to put this on your list of 90's albums to have, you need to hear it to appreciate 90's music even if you dont like it. The cultural apex of R.E.M.'s brilliant career.",
      "name": "Augusta Gallagher",
      "id": 5
    }, {
      "comment": "that dog. - that dog. the three vocal tracks are sure to be irresistable to a lot of people. they almost sound choral, which is a good thing. their songs are brutally catchy and summery. the violin sounds as if it's in the brink of madness. this is one addictive record.",
      "name": "Valenzuela Justice",
      "id": 6
    }],
    "imgUrl": "a2114074940_10",
    "duration": "03:55",
    "country": "USA",
    "songtitle": "The Meat",
    "bandname": "Stove",
    "id": 3
  }, {
    "comments": [{
      "comment": "It's an atmosphere like no other. Cocteau Twins created a complete, seamless, self-contained celestial body with this collection of songs. One of my very favorite albums of all time. Straight though, this is a beautiful, luxurious world of its own.",
      "name": "Hull Velazquez",
      "id": 0
    }, {
      "comment": "Yes, I have this tagged as 'life-changing,' because it was in several ways for me, even though I really only listen to three songs from it now ('Ring,' 'Road,' and 'Foxes').  I was with my dad when he bought it in '90 or '91, and I always saw it sitting there in the CD cabinet under the TV, but never actually listened to it until '96.  This was the year that I started getting into shoegaze & dream pop, so this disc (along with both of MBV's albums and Psychocandy) was kind of the catalyst for that.  I always thought it was kind of my little secret, so I was amazed to learn later that this band has such a huge worldwide following.",
      "name": "Jordan Romero",
      "id": 1
    }, {
      "comment": "I love these four songs....wait scratch that three songs.  I find The raft song just too weird for me.  Now mind you My Seventh Rib and Eating Styes From Elephant Eyes are very weird but there is just something really awesome about them and of course this is no surprise coming from The Shins.  It's sound is very primal in the newly formed Shins band.  They were of course previously called Flake Music and you certainly hear a tinge of Flake Music's style, however, this is definately a new transition into the beautiful present that has become The Shins.  This album would definately 'disgust' a regular person listening to The Shins for the first time.  It takes a attained appreciation to really enjoy these songs on this album.  Nevertheless this is certainly a great start for The Shins and we have seen their evolution in their two full-length albums Oh, Inverted World and Chutes Too Narrow. I would definately suggest anyone that really likes The Shins to listen to these four songs: Those Bold City Girls, Eating Styes From Elephant Eyes, My Seventh Rib, and We Built The Raft and Floated. BTW: anyone know how i cant get my hands on this EP? Thanks",
      "name": "Bridget Walters",
      "id": 2
    }, {
      "comment": "Pardon the repetition but this really does resemble Alien Lanes Kronz is quite right.  It's very much dead inbetween Flake Music and The Shins sound wise, a bit fuzzier perhaps than the Shins most are accustomed to.  It is a very short E.P., but the tracks are really fantastically infectious, worth hunting for the mp3s (apparently this is impossible to find).  Definitely some of the best music I've ever heard from The Shins, and I think they are pretty darned awesome!",
      "name": "Cameron Dejesus",
      "id": 3
    }, {
      "comment": "There's some really good stuff on here. I mean, Billy Corgan was arguably the most prolific songwriter of the '90s and it's records like this that remind you that even his scraps were worthy of a listen. My personal favorites are 'Lucky 13', 'Because You Are', 'Marquis In Spades', 'Here's To The Atom Bomb', 'Waiting', 'Set The Ray To Jerry', and 'Soot & Stars'. Pretty good for a 'greatest misses' record. Get it if not to hear Jimmy Chamberlain put forth some of his best performances on 'Lucky 13' and 'Set The Ray To Jerry'",
      "name": "Olson Talley",
      "id": 4
    }, {
      "comment": "Note: this is a review of both and the rating reflects that. The first disc is a good compilation. It showcases most of the band's best known songs, and a cover that has become fairly famous (though it is pretty straightforward). The only problem with it (aside from it being a 'greatest hits' album) is that there are two songs on it that clearly don't belong. As with so many of these things, someone has stuck on some 'new' material in the hope that this too becomes successful. Oops. The second disc is less consistent, but that is obviously to be expected since it is a rarities comp.  About half of it isn't new exactly, so that sort of defeats the purpose. And it's hardly complete. But it's still solid for what it is.",
      "name": "Faye Dale",
      "id": 5
    }, {
      "comment": "Solid,whimsical and fun that's That Dog,reminds me of my truant escapades I'd take with my cronies and we'd take a road trip to New Hope,PA and look for Ween. Did I mention these songs are fun?Yes I did. 'Zodiac','Family Functions' and 'Just Like Me'get me all nostalgic about me days as a handsome carefree teenager,boo hoo hoo!",
      "name": "Reva Sheppard",
      "id": 6
    }, {
      "comment": "The official album material is from beyond. Absolutely amazing songs, some of them being even psychedelic. And I Put a Spell on You is almost shamanistic. This 40th anniversary edition I'm having, also includes great tracks.",
      "name": "Smith Lyons",
      "id": 7
    }],
    "imgUrl": "a4248200798_10",
    "duration": "03:05",
    "country": "DE",
    "songtitle": "es6/a",
    "bandname": "arovane",
    "id": 4
  }, {
    "comments": [{
      "comment": "As far back as the very first Beatle release, their albums had a contextual feel.  With the release of the singles “Penny Lane,” and “Strawberry Fields,” followed by the albums ‘Revolver,’ ‘Sgt. Pepper,’ and ‘Magical Mystery Tour,’ the Fab Four seemed to be uniting the world through a charismatic set of themed albums revolving around the Flower Power movement, psychedelic drugs, and the ability to be able to draw us all together, united in a stance not only against the war in Vietnam, but in the power this new generation had in their hands, to change the course of social and political events.  While there were signals of disillusion, and troubles within the band, as found on the George Harrison song “Blue Jay Way,” I think we all saw this as typical issues any group or family are destined to have, especially when they have worked so closely for so many years. And the ‘White Album’ was just as prophetic in its on way.  I remember hearing it not only for the first time, but the second, and third time ... and thinking that though the songs were well crafted, there was something lacking.  The music seemed disjointed, like light refracted through a prism, with most of the songs more than notably written by single members of the band.  Some songs seemed to be pulled or left over from other adventures, leaving me with a shattered, schizophrenic feeling ... there was nothing inter laced, nothing tying the songs together.  This feeling was not lost on most fans, yet these were The Beatles, a group who had taken us on a serious journey, collimating in a series of climatic musical ecstasies, the peak of the trip, a feeling I never wanted to leave my body. But here on the ‘White Album,’ there was nothing I could warm up to.  The 'White Album' felt like the ‘crash,’ the day after the ‘trip,’ when the excesses of speed that the LSD had been cut with showed their head, leaving me with an uncomfortable feeling ... one of uncertainty, pending doom, and a disconnection to say the least ... a feeling I just wanted to sleep through, wake up and find that all of the music on this double release made sense. I had to set this record aside for a very long time, going to places like Vietnam, where the world actually was schizophrenic.  And now, nearly forty years later, while I have come to appreciated the songs as a very good grouping of music, I still see the ‘White Album’ as the light at the end of the tunnel, a tunnel that had once bathed and warmed me in strobing colours, psychedelic sensuality, pleasantly distorted shapes that would bend and ebb, as musical notes, like breezes changed my total perception ... I thought the light at the end of the tunnel would be more this, but then as The Beatles had grown up, so had I, and I was left with the reality that most things are not what they seemed.",
      "name": "Kathrine Berger",
      "id": 0
    }, {
      "comment": "This album contains some amazing songs (such as Harrison's While My Guitar Gently Weeps) and really bad songs (such as Happy Birthday).  If half of the songs were cut out, this would be a great album.",
      "name": "Brennan Vinson",
      "id": 1
    }, {
      "comment": "Dear Prudence, While My Guitar Gently Weeps, Happiness is a Warm Gun, Blackbird, Mother Nature's Son, Back in the U.S.S.R., and Glass Onion.  That there's the highlights.  And what incredible pieces of music they are... The rest, with some exceptions, is pretty ordinary.  I mean, it's still the Beatles, but I just can't get into most of this album. Revolver...",
      "name": "Robinson Dominguez",
      "id": 2
    }, {
      "comment": "Good, not essential debut album. 'Walk on the water' is great, 'Suzy Q' is good but too long. 'I Put a spell on you' is an excellent cover. Remainder is so-so.",
      "name": "Katheryn Horton",
      "id": 3
    }, {
      "comment": "It´s ghard to comment on this record knowing what will come after this one. Two hits that at the same time were covers from other group do not make me feel like rating this one high. There is no point in comparing this record to later ones anyway. I wonder what was the impact of this country-rock-southern-foggerty at that time.",
      "name": "Chang Flynn",
      "id": 4
    }, {
      "comment": "Creedence Clearwater Revival's self-title debut album opens  brilliantly with the raw cover of Hawkins' 'I Put A Spell On You'. Most of the great songs on this album are covers. 'Susie Q' has some fine moments and features one of CCR's trademark jams. 'Ninety-Nine and a Half' is also good. John Fogerty's composing hadn't fully matured at this point, yet he still managed to put out a couple of original blues, the pop of 'Porterville', and the soulful 'Walking on the Water' (his best on the album). An excellent debut, and a great place to start with CCR.",
      "name": "Kelley Talley",
      "id": 5
    }, {
      "comment": "ACCR is one of the best groups of all time. All of their singles were excellent, the best if Band On The run. This album is one of the best albums of all time, if not the best!",
      "name": "Harriett Kaufman",
      "id": 6
    }, {
      "comment": "Good debut. Their version of 'Suzie Q' is the highlight, but the second half (composed by all Fogerty's originals) is also worthy the price.",
      "name": "Wiggins Green",
      "id": 7
    }],
    "imgUrl": "a2493087453_10",
    "duration": "04:12",
    "country": "RUS",
    "songtitle": "Cry Wolf - Losing You",
    "bandname": "D-Noise",
    "id": 5
  }, {
    "comments": [{
      "comment": "Mayhem. Insanity. Beautiful Perfection.",
      "name": "Dennis Wood",
      "id": 0
    }, {
      "comment": "No album has as many good songs as this one.I think it's the beatles at their best all of them contributing to make this a great sucess with ringo's don't pass me by one of the album high lights. If you where to bring an album to a desert island it would have to be this because with all the diverse styles and songs soft(Dear Prudance),hard(Helter Skelter) Revoulutionary (Revoulution 1) Provucitive (my don't we do it in the road) Great story telling (roccy racon)and poetic (Blackbird) as well as the bizzare (Revoulution 9) Best Songs; Obla-Di-Oabla-Da , While my Gutair Gently Weeps and Helter Skelter",
      "name": "Ramirez Good",
      "id": 1
    }, {
      "comment": "The irrevocable, unequivocally fantastic quality of music, the reason I love the stuff to such a gargantuan extent, is its ability to capture within its sound every element of the world around it. Music ingrains itself into a time and place of life and takes from the fertile soil all that makes the scene so significant, be it people, smells, sights, sensations, emotions, words—anything. Some capture the worst, lowest moments of our lives where we felt truly broken; others allow us to relive the brightest stars of our nights. The Con, for me, is both of these at once. On the surface, Tegan and Sara came from one wondrously brief encounter with a rare breed of woman, the kind that you don't find more than once in a decade; she had the insatiable ability to completely and totally enthrall and imprison me in every facet of life. Everything she did was done to perfection; she seemed to have no flaws; she seemed to greatly mirror my greatest qualities; she shared my greatest, most fiery passions. I was hooked. We danced and sang, we exchanged mix CDs and dressed in costume. We had a gloriously brief time together, and Tegan and Sara still to this day reflects all that I saw in that picturesque blip of life. I got Tegan and Sara from this girl. But, with the good memories come tinged a shade of melancholic longing, a frustration that the affair didn't last longer, didn't burn hotter, didn't delve deeper. The only solace I have at the dissolution is that, in her fitted perfection, she didn't even extinguish me when she let me go. I have no deep, lasting scars from her. It is in this light, the full light, that I see Tegan and Sara, and especially the Con: despite the barraging energy exuded from each song of this album, there is that lurking dissonance, that bit of frustrated and loathsome empathy that lies in every note the girls sing, and more over, each song comes and goes entirely too quickly, the album even ending long before it ought to at a meager 37 minutes. Still, I can't help but love it still.",
      "name": "Maryanne Guy",
      "id": 2
    }, {
      "comment": "Okay, I can buy that they're lesbian twin sisters, but Canadian lesbian twin sisters?  That's just preposterous.",
      "name": "Elsa Holt",
      "id": 3
    }, {
      "comment": "Every once in a long while an album will come along that catches hold of me and doesn't let go.  I become obsessed, and play the album on repeat, listening to nothing else for weeks on end.  This is one of those albums. The girl's fifth studio album, The Con, is superb in numerous ways.  Tegan and Sara use the best elements of pop, rock, and folk, and somehow create something entirely fresh and their own.  The music is excellent, hooky, pretty, and all around wonderful.  The lyrics and content are heartfelt, honest, and very beautiful.  This is an album I can definitely relate to, one of those albums with songs so special that they seem to magically capture that moment in your life as you listen to them.  But with this album, you don't just listen, you live it.  It's impossible to not be swept up in the emotions and stories that Tegan & Sara provide the listener with, not only making you appreciate what they were going through, but sending you back to relive your own memories.   Every single song is strong, and none feel forced or out of place. </br>Far and away my favorite T&S album, and I would reccomend it to any music fan.",
      "name": "Pansy Kelly",
      "id": 4
    }, {
      "comment": "I have to say that the whole reason i picked up this album in the first place was because i heard T&S we're both lesbians and since i am also gay i figured i should at least give them a listen since we're 'family' ;-) What I wasn't prepared for was to be absolutely blown away by this album. It doesn't have a weak point that i can see and i've clocked about 75+ plays of this album over the last few months. The songs are short, catchy and contain some really memorable hooks. I would recommend this album to anyone who is likes simple but slightly edgy pop music! P.S They aint bad live either :-)",
      "name": "Elva Rose",
      "id": 5
    }, {
      "comment": "I'm not sure I should like this album as much as I do... Mostly because it comes off a bit 'cutesy' at first. And cutesy music can either be really hit or miss with me. But Tegan & Sara are two talented lesbian twins that know how to write songs, and know how to write them both concisely and consistently. Throughout 'The Con's' 14 tracks, there are hardly any I'd consider less than strong, and all end leaving the listener wanting more rather than dragging on too long. These two have a knack for melody construction, and though their voices may allude to a sense of childhood 'cutesiness' or innocence, some of the lyrical topics do reach a certain level of darkness, especially on 'Knife Going In' or 'Dark Come Soon' or 'Burn Your Life Down' or... Come to think of it, the album is pretty dark overall o_o",
      "name": "Tasha Bullock",
      "id": 6
    }, {
      "comment": "On this album, Blondie demonstrates that they can produce facile songs in a wide variety of genres -- orchestral bombast ('Europa'), disco-funk ('Live It Up', 'Do the Dark'), proto-rap (the excessively lengthy 'Rapture'), music-hall ('Here's Looking at You'), jazzy torch ('Faces'), and reggae ('The Tide Is High').  The last mentioned is the only one I really love -- the horn section is great.  (Not having heard the 1967 original, by The Paragons, or Gregory Isaac's 1978 cover, I don't know whether the horns are a new addition or simply a copy off one of the other versions.)  There are also several songs more in the old Blondie mold, such as the rather mysterioso 'Angels on the Balcony' (I could almost picture the Doors doing this in one of their quieter moments), 'T-Birds', 'Walk Like Me', and the exuberant 'Go Through It' (my other favorite on the album besides 'The Tide Is High').  All in all, not a bad album, and in some ways more interesting than the albums they had done previously... but I'm not as likely to put it on.",
      "name": "Cathy Swanson",
      "id": 7
    }],
    "imgUrl": "a0890959509_10",
    "duration": "09:22",
    "country": "CAN",
    "songtitle": "Because That's the Only Time There Is",
    "bandname": "People As Places As People",
    "id": 6
  }],
  "kuratorImg": "http://placehold.it/700x700",
  "kuratorDescription": "It began as a simple idea back in the summer of 1999: a single score could summarize the many entertainment reviews available for a movie or a video game. Metacritic's three founding members—all former attorneys who were happy to find a more constructive but less profitable use of their time—launched the site in January 2001 and Metacritic has evolved over the last decade to reflect their experience distilling many critics' voices into the single Metascore, a weighted average of the most respected critics writing reviews online and in print. Metacritic's mission is to help consumers make an informed decision about how to spend their time and money on entertainment. We believe that multiple opinions are better than one, user voices can be as important as critics, and opinions must be scored to be easy to use.",
  "kuratorName": "Tameka Fowler",
  "kuratorId": 678
}, {
  "entries": [{
    "comments": [{
      "comment": "It has the same type of battling-mode mindset that it’s similarly titled predecessor contained, but this time everything about it is so much more vicious and sinister, and Em just goes in on the beat. Both the beat and the rapping are standout in their own rights, but combined they form to make some type of Mac-n-Cheese-esque deliciousness. It’s not a mean track per se, because it doesn’t focus on anyone in particular, but there’s a venom and vitriol on here that lends as some nice foreshadowing for the next album. Excellent track",
      "name": "Marc Miller",
      "id": 0
    }, {
      "comment": "A depressing reality-checker written after Eminem was nearing the end of his wits and close to the proverbial edge. He was out of a job, struggling to get money, having whatever money he did make robbed from his house, and his rapping career was going nowhere as he was trying to provide for his daughter. It’s a relatable song for everyone who listens as we’ve all sunk so low we don’t know where we’re going (I experienced it after Shaq retired, for example.) It’s a rare moment of sincerity in an album that prides itself on avoiding it.",
      "name": "Phil Collins",
      "id": 1
    }, {
      "comment": "Ya know, the long ending of 'Moonchild' might actually be my favorite part of the album. So nocturnal, mystic, and dreamy. I also love the freakout parts in '21st Century Schizoid Man', obviously.",
      "name": "Peter Meier",
      "id": 2
    }, {
      "comment": "I guess a review for this album is not easy. Simply said, it is mind-bending, thought-provoking, and directional. Directional? well, I was very young and this album triggerred me to search for more and widen my depth and breadth. The songs seem to follow a mood waving pattern: 21st Century Schizoid Man is rather harsh and provocative in its tone. Not to mention the mastery of its individual band members delivering a heart-felt perfomance. The power and aggression of Schizoid Man is suddenly dropped to a stupor by I talk to the wind. Ahh the flute...a magical introduction to music. Yet, the song seems very promising which again is broken down by Epitaph. But not sound-wise. The song is not powerful but actually depressin with its lyrics. Moonchild is soporific but you are suddenly woken up by the final song, The Court... . As mentioned before, the band members are very skilled and I guess these could have been easily labelled as a Supergroup. Enjoy...",
      "name": "Deborah Norman",
      "id": 3
    }, {
      "comment": "Magnifico, splendido, inaugurale, eterno, ecc...",
      "name": "Audrey Noel",
      "id": 4
    }],
    "imgUrl": "a3980528907_10",
    "duration": "03:08",
    "country": "USA",
    "songtitle": "Purgatory Drive",
    "bandname": "the Growlers",
    "id": 0
  }, {
    "comments": [{
      "comment": "They sure make a big deal about this one on here! It's a good album. One of the earliest renowned prog rock albums. 'Renowned' meaning in the present day, as it had been ignored back then upon release. It's gloomy, it's tight, it's spacey, it's elaborate, but somehow each song manages to stay uniform in some way. 'Moonchild' should not have been 12 minutes, the way they wasted 9 of them with aimless noodling. There's noodling that brings a song somewhere, that takes you to another point, or unifies all the previously heard passages together and connects to some new, unheard passages, and then there's aimless noodling, which has NOTHING to do with the song and takes you nowhere. When I heard the title track, I realized that, having heard the music of Uriah Heep before I've heard King Crimson, that U.H. had used a similar melody in the song 'Circle Of Hands' from their 1972 album 'Demons & Wizards'. Anyways, it's not a bad album. I think it gets too much credit though. I've heard better in other prog albums.",
      "name": "Jeanne Smith",
      "id": 0
    }, {
      "comment": "2 song album",
      "name": "Jefferson Watson",
      "id": 1
    }, {
      "comment": "I guess I'm just not a prog-rock fan, because this album does little to nothing for me.  It is all just too damn pretentious and over-blown for me to take.  I mean, I don't think that I could ever bring myself to trot this shambling mound out in front of any other self-respecting music fan without being completely embarassed.  I guess if it was 1969, I was hearing this for the first time and was stoned out of my brain, I might be more impressed and 'get it.'  Today, however, it alternates between making me feel embarassed that I'm listening to it and making me fall asleep.  The musical virtuosity is obviously not in question.  The emotion and impact is, though.  The only situation in which I find this music appropriate is perhaps a rainy, Sunday afternoon, when you're sitting quietly reading the newpaper or a serious novel of some sort.  Even then, I'd rather turn some good jazz on or even classical.",
      "name": "Hardy Booth",
      "id": 2
    }, {
      "comment": "Sublimely beautiful record, rich imagery, and, well, just lovely to listen to. Personal favourite track is 'I Talk To The Wind', soft as the Sun on summer grass. Hard to fault it really, a genuinely unique piece of work.",
      "name": "Obrien Wilkerson",
      "id": 3
    }, {
      "comment": "While tedious at times this is overall an excellent record. I love the warm tone of Greg Lake's voice; its comfortable. This record is so far out there for it's era that it has to be considered a milestone in rock history. No body takes chances like this anymore. Is it because it has all been said already?",
      "name": "Gallegos Stevenson",
      "id": 4
    }, {
      "comment": "In the Court I would say is one of the heaviest albums I have heard to date. It has a nice progressive sound to it, and the lyrics twist a nice tale As I caught it on the radio in the barn today I just felt the need to tell someone.",
      "name": "Tate Burgess",
      "id": 5
    }],
    "imgUrl": "a1968828765_10",
    "duration": "03:59",
    "country": "FR",
    "songtitle": "Auld Lang Syne",
    "bandname": "Heck Ya The Halls",
    "id": 1
  }, {
    "comments": [{
      "comment": "From what I understand, this is Andy Partridge's growing up album.  Accepting the joys of fatherhood and home life.  That's not to say that it's all sweetness and light here.  'The Smartest Monkeys', 'Books Are Burning', 'War Dance' and 'The Ugly Underneath' are hardly happy themes.  But songs like 'Holly Up on Poppy', 'My Bird Performs', 'hen She Appeared' and 'Humble Daisy' are simply joyful.  'Humble Daisy' is one of my favorites with it's rich harmonies, and Pet Sounds inspired sound.  Also 'Wrapped in Grey' is absolutely beautiful.",
      "name": "Tisha Petty",
      "id": 0
    }, {
      "comment": "In #7 in the RYM top 500 marathon: (Note: This review applies to the 2009 Steven Wilson Remaster) It is an exciting listen.  I found the mix very jarring at first.  I am used to the rotten tape mix imprinted on my first cd. This is a staggering difference.  Because Fripp stood over Wilson's shoulder during the remaster, I am pretty sure this is how it is supposed to sound. Musically, lyrically, conceptually - this is a brilliant record.  But there is something about it that feels like a relic. An aged piece to be greatly admired, but never to fully connect with.  For some reason, PF's 'Wish you were here' feels as fresh and exciting as must have in 75, time has worked differently on this one. Even still. It is a great work of art. 86/100",
      "name": "Morrison Pierce",
      "id": 1
    }, {
      "comment": "I almost wanna give this 4 1/2 stars for the improv. section of Moonchild, but dammit, I can't.  It's like this album has a magical progressive shield protecting it from being anything short of awesome.  A Legendary Classic.",
      "name": "Virgie Rivers",
      "id": 2
    }, {
      "comment": "This is one the most influential albums of the so-called 'dad rock' genre. Too bad it didn't age that well - of course, it must've been a shock to hear this album in 1969, but let's be honest, the mellotron and choirs sound really cheesy at times. The album itself starts with 21st Century Schizoid Man which is the highlight of the whole recording and probably the reason we still talk about this album after over 40 years. It's just ridiculously unique and ahead of its time. Then the album gets pretentious and, well, boring. I Talk to the Wind is fine. Epitaph is kinda overdramatic. Moonchild lingers for way too long. And then it ends with The Court of the Crimson King, which is pretentous too, but at least it a really good song. Forgot to mention it has its iconic, gorgeous cover art.",
      "name": "Rogers Weeks",
      "id": 3
    }, {
      "comment": "I got this quote from Kind of Blue's Last fm page, from a user by the name of Timppa2000. 'Universally acknowledged standard of excellence.' That sums up Kind of Blue nicely in my eyes, though I'd add that Kind of Blue is the best starting pointing for getting into the initially daunting world that is jazz.",
      "name": "Rogers Weeks",
      "id": 4
    }],
    "imgUrl": "a2385939592_10",
    "duration": "03:56",
    "country": "USA",
    "songtitle": "Joker Smoker",
    "bandname": "Dubamine",
    "id": 2
  }, {
    "comments": [{
      "comment": "Got this for almost nothin at all with 'Ascenseur pour l'échafaud' and Cannonball Adderley's 'Somethin' Else' on 2 CDs. I don't know shit about jazz but this sounds cool. And I guess it's a grower, too.",
      "name": "Blanca Short",
      "id": 0
    }, {
      "comment": "Mingus' 'Black Saint & the Sinner Lady' showed me that jazz could be loud and impolite. I learned from Coltrane's 'A Love Supreme' that jazz can be wild and adventurous. Mile Davis' classic 'Kind of Blue' has revealed to me that the genre can be a emotionally deep and riveting as any other genre. From beginning to end, 'Kind of Blue' is a sublime, stimulating masterpiece. 'Kind of Blue' is more than glorious background music. Its sound is capable of doing more than just relaxing you after a long day. The lineup on the album includes Miles himself, John Coltrane on sax, Jimmy Cobb on drums, and Paul Chambers on bass. Many believe that this exceptional cast will never be matched. The talent glows with exuberance. The speedy, dripping piano that upstarts 'All Blues' invites the dreary trumpet played by Davis. 'Freddie Freeloader' contains some great clasping percussion, and there is some superb sax playing by Coltrane on 'So What', among other pieces. The closing 'Flamenco Sketches' is gorgeously sad. It begins with a bass that sounds as if it is slowly dying, and Miles' trumpet provides a eulogy. Explaining why 'Kind of Blue' is such an astonishing record is not easy. The familiar jazz elements are here, and it certainly is not as ambitious as Davis' later work or even that of his contemporaries. Even so, every single note on this record is played with purpose. 'Kind of Blue's' reputation spreads beyond being highly influential. This is an essential record for jazz enthusiasts and for music collectors alike.",
      "name": "Bryant Atkinson",
      "id": 1
    }, {
      "comment": "El mejor disco de jazz de la historia.",
      "name": "Maricela Branch",
      "id": 2
    }, {
      "comment": "IMMENSO! IMMENSO! IMMENSO! Uno dei 10 dischi più belli della storia del Jazz. Quel genio di Davis qui rivoluziona il modo di concepire la musica Jazz, apre nuove strade raggiungendo un livello qualitativo semplicemente enorme. Una pietra miliare, anzi un gigantesco monolito, sulla storia della musica, un'opera imprescindibile per qualunque amante del Jazz e della musica tutta. 5 brani assoluti, un capolavoro gigantesco, un artista enorme coadiuvato da musicisti altrettanto enormi (vedi Coltrane). Assoluto.",
      "name": "Marva Woodard",
      "id": 3
    }, {
      "comment": "Still the biggest selling Jazz album ever and by far the coolest!!!! If you don't own it get it... this one's a MUST!!!!!!",
      "name": "Owens Riley",
      "id": 4
    }],
    "imgUrl": "a2844538561_10",
    "duration": "03:46",
    "country": "MRT",
    "songtitle": "Arbina",
    "bandname": "Noura Mint Seymali",
    "id": 3
  }, {
    "comments": [{
      "comment": "Steve Albini called Pixies 'a band who at their top-dollar best are blandly entertaining college rock'. I'm inclined to agree.",
      "name": "Hull Velazquez",
      "id": 0
    }, {
      "comment": "Ripped from my public library in late '04, and the disc's deep scratches meant I wasn't hearing anything past Crackity Jones. The next summer I caught them live – opening for Weezer, strangely enough. I remember being glad to hear Wave of Mutilation not once but twice. Eight or so years pass without thinking much about them. Last month I absentmindedly scrolled to this in my music library and ended up playing it very loudly on a sunny drive. It turns out that I didn't miss very much by not hearing the second half, but overall I was surprised to find a new appreciation for this quintessential alt-rock brand. Their throaty-shouts-and-noisy-surf-guitars!!!! aesthetic can get tiresome as hell in the wrong hands, but the Pixies use it to produce some remarkably euphoric music.",
      "name": "Jordan Romero",
      "id": 1
    }, {
      "comment": "Sometimes I think that many of the best albums of the '1990s' were made in 1989: 'On Fire', 'The Stone Roses' and 'Doolittle' foremost amongst them. Like many other people I have taken a long time to fully appreciate this band, but they were nothing less than revolutionaries.",
      "name": "Bridget Walters",
      "id": 2
    }, {
      "comment": "WOW, I really don't get this. I see the non sense/mysterious vibe where you have to guess what the hell the songs are talking about, but seriously? If I wanted good weird f*cked up music I'd listen to Mr. bungle. I also understand this means something to a lot of people, maybe considered a classic, but personally it bores my ass. The famous 'hey' song is actually good...but the rest? its lost on me. I dunno if i should dislike or envy those who can appreciate this album..to review this album musically will be a challenge. you'll call it alt. rock, I'll call it bullshit. but that's just my opinion..",
      "name": "Cameron Dejesus",
      "id": 3
    }, {
      "comment": "One of my favorite albums. I could listen to every song all the way through from beginning to end. Opens up with catchy guitar & bass and doesn't stop the entire album. Favorite tracks: Gouge Away, Hey, Wave of Mutilation, Mr. Grieves, & Debaser. makes you want to build a time machine to see them in their prime.",
      "name": "Olson Talley",
      "id": 4
    }, {
      "comment": "Even though, I don't listen to the Pixies as much as before, I can still appreciate their music. It's already been said before. What defines the Pixies was their abrasive, but melodic sound. I'm sure more can be said to describe their sound, but all I would like to say is that they were highly original. Though, I prefer the more raw 'Surfer Rosa', that doesn't take away from the fact that I love the more lush sounding 'Doolittle.' With lyrics depicting surreal imagery coupled with poppy melodies, there is something new around every corner to enjoy. All I can say is that this is a great album from a highly influential band. I have heard so many bands that have borrowed from the Pixies' sound. Even as a guitar player, I have learned some cool things from Joey Santiago. Doolittle is an essential. Purchase it.",
      "name": "Faye Dale",
      "id": 5
    }, {
      "comment": "I never understood what the big deal was about THE PIXIES.  There are some good tunes - I'm fond of 'Here Comes Your Man', 'Monkey Gone To Heaven', 'Debaser' and 'Gouge Away' on this one - but for me they are/were nothing special.  Plus I saw them live back in '89 or '90 and they put on one of the most mediocre live shows I ever saw (I'm glad my girlfriend at the time paid for my ticket!).",
      "name": "Reva Sheppard",
      "id": 6
    }, {
      "comment": "I remember the first time I heard Doolittle: that day I change the way music must be to me. The Pixies teached me music can be smart and also funny as hell. In Surfer Rosa they were rough and pull their sound to their limits; and they wait to Doolittle to create their masterpiece: it's hard to decide waht is the best song here. It starts in turbo with Debaser, and smash your face to the groun with tame, one of the most concise songs ever. Here Comes Your Man takes you to the club to feel rejected again, but it lifts you to paradise in Monkey Gone To Heaven.... I can talk a lot of shit about these fifteen songs, but finally you will be beaten by an acid sense of humour.",
      "name": "Smith Lyons",
      "id": 7
    }],
    "imgUrl": "a2253029923_10",
    "duration": "03:11",
    "country": "USA",
    "songtitle": "LWTGG",
    "bandname": "Oliver",
    "id": 4
  }, {
    "comments": [{
      "comment": "I actually do like these guys, but how can anyone not acknowledge how overrated they are?  This is a very solid four star album, and they do deserve credit for debuting with two impressive albums back to back.  Their fan base has always been the smug college crowd who tend to think they're the arbiters of good music, though, and I tend to think that is why they're so outlandishly overrated.",
      "name": "Kathrine Berger",
      "id": 0
    }, {
      "comment": "I really love this album.  It gets better with time.  It's almost perfect with the exception of 'Monkey Goes to Heaven' and 'Waiting for my Man' or whatever they're called.  They're both way too pop and feel safe and unaffected.  Unlike 'Hey' and '13 ' about the tattooed tit, they outstanding in their production and songwriting.  Buy this album, it's better than Surfer Rosa",
      "name": "Brennan Vinson",
      "id": 1
    }, {
      "comment": "El mito, las buenas críticas y la curiosidad me impulsó adquirir este disco. Vaya desencanto. No pasa de ser un álbum un poco mediocre, con algun que otro momento brillante, pero en general rodeado de canciones cursis, falsetes y adornos huecos. No entiendo por qué está tan sobrevalorado este disco, ¿no se hizo nada mejor en el 89?",
      "name": "Robinson Dominguez",
      "id": 2
    }, {
      "comment": "This is one the greatest albums ever made. It's top notch from top to bottom. It's something else. It's really something. Its quite something when you take a listen. You'll be listening to it and you'll be all like: 'man, this is really something, these guys really got something going here.'Because when you get right down to it, they do. And Oh, do they! I was at Venice Beach once, and the big black guy who's married to the old white lady and they play music together on the boardwalk gave me an autographed pixies poster. He said he grew up with them in Arkansas. I figured he was a little misinformed on who the pixies were, mistaking them for his neighbors in arkansas, and all, so I asked him if he'd sell it to me. I felt guilty when he said I could have it free of charge. Nonetheless it was quite a poster and I'm glad he gave it to me for the pixies are my all time favorite. I was pleased as punch. It was really something. Most of this sentiment of mine about the pixies comes as a result of the album doolittle. Thusly, I give it 5 stars. 5 whole stars. There is not one song that I skip on the album. I used to skip 'Silver' when I first bought it but I have since learned to appreciate it. As far as I'm concerned, 'I bleed' is numero uno on the list of greatest songs of all time. Its really something else.",
      "name": "Katheryn Horton",
      "id": 3
    }, {
      "comment": "This album represents all the worst that later was blooming on the commercial rock scene of the nineties. Dull melodies, awful vocals, poor, amateur musicianship. Strange to see people who listen to it today - it seems to me that this is music just for MTV-fed teenagers of that decade.",
      "name": "Chang Flynn",
      "id": 4
    }, {
      "comment": "ACCR is one of the best groups of all time. All of their singles were excellent, the best if Band On The run. This album is one of the best albums of all time, if not the best!",
      "name": "Harriett Kaufman",
      "id": 6
    }],
    "imgUrl": "a1877982657_10",
    "duration": "06:44",
    "country": "DE",
    "songtitle": "Stratosphere",
    "bandname": "Thallus",
    "id": 5
  }, {
    "comments": [{
      "comment": "I was never a Pixies disciple or anything. In 1989, I was mostly listening to stuff like Tears for Fears, Prince and The B-52s, plus U2 & R.E.M. Of course in the years that followed, I heard this record and was impressed, but only recently did I actually sit down and listen to it all the way through and it absolutely does deserve praise as a masterpiece and certainly one of the top 10 albums of the 1980s. 'Monkey Gone to Heaven' and 'Debaser' in particular  are very original and captivating.",
      "name": "Dennis Wood",
      "id": 0
    }, {
      "comment": "With its slick combination of Blues and Psychedelic rock, and Jim Morrison's haunting vocals, The Doors' debut self-titled album is a solid piece of work that still holds up, although not quite one that stands out as truly amazing.",
      "name": "Ramirez Good",
      "id": 1
    }, {
      "comment": "Los chicos de The Doors creyeron que por usar muchos órganos para atmosferizar canciones de rock se convertirían en la revelación. Les funcionó a un nivel superficial, pero no trasciende. Quien merecía ser la revelación allá por 1967 eran The Velvet Underground y Nico, que además de atmosferizar, escribían buenas canciones, mucho más que ideas generales y aburridas de blues/rock con algunos gritos, y eran capaces de maniobrar lo que habían creado por senderos desconocidos hasta terminar en lugares a los que valía la pena regresar. The Doors debió ser The Velvet Underground, y The Velvet Underground debió ser The Doors. Claro que esto hubiera hecho a Lou Reed matarse en 1971, entre otras implicaciones*, pero estarían de acuerdo en que hubiera sido mucho más esperanzador para las pobres almas viviendo a fines de los 60', ¿no?*Una de las que más me asusta es que Morrison se habría convertido en un viejo irritante que haría colaboraciones con Metallica, y siendo él un personaje con carácter aún más concentrado que el de Reed creo que también hubiera terminado como una especie de Morrisey pero más psicótico y hasta sospecho que hubiera caído en prisión más de una vez.",
      "name": "Maryanne Guy",
      "id": 2
    }, {
      "comment": "It's a real shame they couldn't, for whatever reason, use the original analog master.  Instead, they used the 'best analog tape copy' and you can really tell.  The lows and highs are muted, the mix is muddy, and there's even some tape hiss.  It's enough to make me reach for my DCC copy instead. Am glad I own it?  You bet.  Was I expecting more?  Definitely.",
      "name": "Elsa Holt",
      "id": 3
    }, {
      "comment": "Ol' Jimmy sure was a dick, but this album is nothing but chops.   Even if you don't like it you still have to RESPECT it.  That's right.",
      "name": "Pansy Kelly",
      "id": 4
    }, {
      "comment": "The Doors is definitely a classic album, but for my tastes, doesn't quite keep me entertained.  'The End' is possibly the best one on here due to its construction; very laidback and ominous, yet constantly building to a crescendo to around the eight-minute mark where everything just spirals out of control.  Very nice. Some of the shorter songs are pretty nice like 'Break on Through', 'Soul Kitchen', 'Back Door Man' and 'Alabama Song'.  However, there exist a few songs that aren't captivating to my ears; 'End of the Night' and 'The Crystal Ship' do nothing but put me to sleep, and 'Light My Fire', as classic as it is, can get a bit carried away as the solos tend to drag the quality of the song down just a bit. An important landmark in music history that's nice to own.  Can't really say much beyond that.",
      "name": "Elva Rose",
      "id": 5
    }, {
      "comment": "This one's a classic, it's not only the Doors first album, but it could also qualify as like a greatest hits, because of it's really good hits and songs. It has hits like 'Light My Fire', 'Crystal Ship', and 'Twentieth-Century Fox'. The songs that are not as popular are really good too, my three favorites are 'Soul Kitchen', 'I Looked At You', and 'Take It As It Comes'. A must buy for all Doors fans.",
      "name": "Tasha Bullock",
      "id": 6
    }, {
      "comment": "This is one of the best debut albums ever by a rock band. The Doors created a unique and powerful instrumental blend of different styles that allowed the band to approach different genres. Indeed, this is an album that can't be classified; it is bluesy, psychedelic and operatic at the same time. The mood is absorbing (the anthem Light My Fire, Soul Kitchen, The Crystal Ship) and also powerful (Break On Through, Back Door Man) helped throughout by the incredibly catchy sound of Manzarek's organ. Jim Morrison was a great poet and he wrote some really good songs in this album (The End, Break On Through, The Crystal Ship); his haunting baritone voice acting as a balance to the spirited sound. The album closes with The End, a 12-minute surreal epic that reaches a wonderful climax before fading away. Only a few forgettable songs prevents this from being a masterpiece.",
      "name": "Cathy Swanson",
      "id": 7
    }],
    "imgUrl": "a3388720048_10",
    "duration": "03:57",
    "country": "USA",
    "songtitle": "Iron Lung",
    "bandname": "Black Marble",
    "id": 6
  }],
  "kuratorImg": "http://placehold.it/700x700",
  "kuratorDescription": "Pitchfork is the most trusted voice in music, celebrating and exploring emerging artists and established pioneers across all genres. With our loyal audience of more than 7 million monthly unique visitors, we are read daily by the most passionate music fans. We regularly partner with brands to develop thoughtful integrated campaigns that leverage our digital, print, video, and event capabilities, along with any number of advertising and sponsorship opportunities on the site. For more information on advertising with Pitchfork, drop us a line.",
  "kuratorName": "Tameka Fowler",
  "kuratorId": 678
}]