[
  {
    "entries": [
      {
        "comments": [
          {
            "comment": " love the intro so much. It just touch me deep inside. Her beauty is also outstanding, she is one in a million! 'So we’re gonna heal. We’re gonna start again. You’ve brought the orchestra, synchronized swimmers; you are a magician. Pull me back together again the way you cut me in half. Make the woman in doubt disappear. Pull the sorrow from between my legs like silk, knot after knot after knot. The audience applauds… but we can’t hear them.",
            "name": "Duran Velasquez",
            "id": 0
          },
          {
            "comment": "I every so often falter to her poems, rhythms and lyrics; loving the erection of my hairs standing so freely upon my temple. She's one of a kind and I'm so pleased to have met her several years ago. Such a brilliant beautiful woman.﻿",
            "name": "House Mitchell",
            "id": 1
          },
          {
            "comment": "album of the year?? try album of the century ",
            "name": "Yvette Cherry",
            "id": 2
          },
          {
            "comment": "SHE IS TRULY A GODDESS, OBSESSED WITH THIS ",
            "name": "Deborah Norman",
            "id": 3
          },
          {
            "comment": "This and XO are like my top 2 fav songs from her. I love all of her songs",
            "name": "Audrey Noel",
            "id": 4
          }
        ],
        "artworkUrl": "https://f4.bcbits.com/img/a2422752302_16.jpg",
        "coverUrl": "https://f4.bcbits.com/img/a2422752302_16.jpg",
        "songtitle": "Fly Me To The Moon",
        "bandname": " Alison David Jazz Trio",
        "id": 0
      },
      {
        "comments": [
          {
            "comment": "Can someone please just tell me when have they ever made a bad song because I can't find any that's just how good they are and his voice is just amazing",
            "name": "Jeanne Smith",
            "id": 0
          },
          {
            "comment": "Wow ... This song is amazing, deserve more views and recognition damm!",
            "name": "Jefferson Watson",
            "id": 1
          },
          {
            "comment": "Anyone else hooked in the first few seconds?! Goosebumps! So good! Hey guys, I make music on my channel. A little love goes a long way ",
            "name": "Hardy Booth",
            "id": 2
          }
        ],
        "artworkUrl": "https://f4.bcbits.com/img/a4075046300_16.jpg",
        "coverUrl": "https://f4.bcbits.com/img/a4075046300_16.jpg",
        "songtitle": "In Harmony",
        "bandname": "Escape Wave",
        "id": 1
      },
      {
        "comments": [
          {
            "comment": "how to find a good band great original tracks that don't repeat the same 4 words. the artist preforming composed the song and they make you feel happy.",
            "name": "Tisha Petty",
            "id": 0
          },
          {
            "comment": "And then they went and wrote a musical based on this.  A prime example of why their songs hold up so well 40 years on.",
            "name": "Morrison Pierce",
            "id": 1
          },
          {
            "comment": "I'm 15 and I love them. They are so much better than the artists of today. ",
            "name": "Virgie Rivers",
            "id": 2
          }
        ],
        "artworkUrl": "https://f4.bcbits.com/img/a0501244539_16.jpg",
        "coverUrl": "https://f4.bcbits.com/img/a0501244539_16.jpg",
        "songtitle": "Cause+Effect",
        "bandname": "In The Nursery",
        "id": 2
      },
      {
        "comments": [
          {
            "comment": "Great song, I was fine right up until the old guy...so...yeah that's where I'm at.",
            "name": "Blanca Short",
            "id": 0
          },
          {
            "comment": "Although this project was created as a joke, it's way too good to ignore. Yes, purist Black Metallers will reject this (justly) and if you're thinking that this is a BM album, you'll be sorely disappointed. If you are however looking for something completely different, with genres ranging from (and blending) staccato-styled rock, spiritual slave music, muslim-inspired trap-beats (yes, apparently, that's a thing), Black Metal and soul, this might be your thing. I picked up both albums on Bandcamp and been listening to it for a few months by now. Whilst the first album is much more genre-blending, this second album has a lot more BM influences. Personal favorite top 3: Come On Down, Blood In The River, Death Of A Billion. I need a physical copy of this as well. Thanks for the music Manuel Gagneux!",
            "name": "Bryant Atkinson",
            "id": 1
          },
          {
            "comment": "Incredible song, but let's admit it ... ! The instrumental part sounds too much amateur ... I mean, it´s VERY GOOD but we can sadly feel the lack of professional mixing & mastering ... Hopefully it will be resolved with the next brand new physical copies :)",
            "name": "Maricela Branch",
            "id": 2
          },
          {
            "comment": "Well, this is different. I can dig it. The sound would be a lot better if they went for a Xasthur sound during the metal parts though.",
            "name": "Marva Woodard",
            "id": 3
          },
          {
            "comment": "I don't know why this is such an odd combo for some. It's old school type blues which many metal and rock artists copied (Robert Johnson etc). But anyways spirituals and metal. Awesome combo.",
            "name": "Owens Riley",
            "id": 4
          },
          {
            "comment": "The story behind this is glorious; Lead Michael Gagneux posted a request for genre mash-up suggestions; one individual posted 'Black Metal', another posted 'nigger music' (naturally, the forum being 4Chan). Little did the individual who posted the latter expect Gagneux to deliver in the purest sense- samples depicting enslaved African Americans launching a crescendo of subversive roars, all originally constructed by Gagneux himself.",
            "name": "Augusta Gallagher",
            "id": 5
          },
          {
            "comment": "Holy balls, this is ingenious. I'd stick it right into a Bioshock: Infinite trailer, it gives me similar vibe to Nico Vega for some reason.",
            "name": "Bowen Compton",
            "id": 6
          }
        ],
        "artworkUrl": "https://f4.bcbits.com/img/a1869870915_16.jpg",
        "coverUrl": "https://f4.bcbits.com/img/a1869870915_16.jpg",
        "songtitle": "Happy Ever After",
        "bandname": "Georgie Biggin",
        "id": 3
      },
      {
        "comments": [
          {
            "comment": "Ohh my fucking god... It's amazing! I never heard anything like this before.Greetings from Hungary.",
            "name": "Hull Velazquez",
            "id": 0
          },
          {
            "comment": "i really really love these guys a friend of mine told me to check these guys and boy, im glad i did they are amazing!!!!!! i hope they come to america soon",
            "name": "Jordan Romero",
            "id": 1
          },
          {
            "comment": "Cool especially since their music is so lyrically and thematically specific, you know Eastern Europe, anti Orthodox Christianity. Oh  and from what I've heard their live shows definitely are not something to miss.",
            "name": "Bridget Walters",
            "id": 2
          },
          {
            "comment": "I grew up in Russia, with my mom and grandma being deeply religious, and because of that I have been dragged into church as a kid quite often. There's something eerie and depressing about being inside of Orthodox Christian Church, hence why religious people always go there to grieve and be alone with their thoughts. The sole presence there definitely creates the mood that is very heavy-hearted and mentally pressing. That being said, I think adding black metal to that atmosphere is a great idea.",
            "name": "Cameron Dejesus",
            "id": 3
          },
          {
            "comment": "You know, I'm starting to think Black Metal is not actually that anti-Chistian. After all the character of Satan comes from Judeo-Christian mythology and all these Norwegian kids who wanted to play the bad guys actually supported this worldview instead of challenging it. What I find more interesting about BM is it's fascination with distant and forgotten past and it's spirituality and criticism of soulless modern world... and if at some point a branch of Christian culture starts to be seen as this 'voice of the past' why not incorporate it into BM sound? Yeah I realize these guys are not Christians but this album still probably made a lot of trve kvlt warriors mad",
            "name": "Olson Talley",
            "id": 4
          },
          {
            "comment": "This shit sounds like Mgła and Ygg fused into one unholy, monstrous, and beautiful fucking being all at once. Yet again, Poland, crushing the black metal scene.",
            "name": "Faye Dale",
            "id": 5
          }
        ],
        "artworkUrl": "https://f4.bcbits.com/img/a0136231082_16.jpg",
        "coverUrl": "https://f4.bcbits.com/img/a0136231082_16.jpg",
        "songtitle": "Galaxies Genesis EP",
        "bandname": "EYJAFJÖLL",
        "id": 4
      },
      {
        "comments": [
          {
            "comment": "One of the greatest black metal albums I've ever heard. It rivals Deathspell Omega's 'Kenose' and 'Drought' for spiritual transcendence of the blasphemous variety.﻿",
            "name": "Kathrine Berger",
            "id": 0
          },
          {
            "comment": "It is indeed a good song, the instrumental is top notch, the lyrics have a meaning, overall a nice song to listen if you want to calm yourself.",
            "name": "Brennan Vinson",
            "id": 1
          },
          {
            "comment": "Never heard of this band before, I just happen to come across it and fell in love. Now I am looking for it on I-tunes.",
            "name": "Robinson Dominguez",
            "id": 2
          }
        ],
        "artworkUrl": "https://f4.bcbits.com/img/a1474913902_16.jpg",
        "coverUrl": "https://f4.bcbits.com/img/a1474913902_16.jpg",
        "songtitle": "Ouanounou - Debut EP [MNSTRT004]",
        "bandname": "Ouanounou",
        "id": 5
      },
      {
        "comments": [
          {
            "comment": "Fugiat incididunt laborum nulla et pariatur mollit aute. Est cillum in nostrud ad excepteur incididunt laboris pariatur duis labore laborum nulla amet. Adipisicing in eiusmod cillum esse quis magna in ad exercitation cillum cillum laboris. Incididunt pariatur Lorem nisi labore commodo irure. Aliquip pariatur sint excepteur commodo quis do sint esse esse eiusmod fugiat officia est. Dolore labore cillum voluptate laboris ullamco aliquip sint cillum do cillum mollit culpa.",
            "name": "Dennis Wood",
            "id": 0
          },
          {
            "comment": "Sunt duis laboris irure ut ea officia eiusmod. Mollit reprehenderit pariatur excepteur consequat esse. Adipisicing veniam proident reprehenderit duis fugiat enim dolore. Consectetur pariatur cillum qui cupidatat ipsum aute dolore ut.",
            "name": "Ramirez Good",
            "id": 1
          },
          {
            "comment": "How is that possible? I saw these guys at SXSW a couple years ago and it was one of the best shows I could have ever come across. I still remember that night perfectly. I would follow this band to the end. They're incredibly talented and passionate about what they're doing and it shows when you watch them live! Infinity likes from myself and everyone I've introduced to the bands sound! ALL MY LOVE FOR THE MIGHTY OAKS! Meow come back to Austin, TX. xoxoxoxoxo's",
            "name": "Maryanne Guy",
            "id": 2
          },
          {
            "comment": "Came across these guys a few months ago, nice sound, purchased 5 tracks via itunes, regular play rotation, brother, seven days, back to you,, just one day, you save my soul, plus like the nw connection.",
            "name": "Elsa Holt",
            "id": 3
          },
          {
            "comment": "Ad minim pariatur voluptate exercitation. Laboris magna occaecat nulla nisi ullamco. Aliqua tempor exercitation qui officia ea cupidatat in et enim laboris.",
            "name": "Pansy Kelly",
            "id": 4
          },
          {
            "comment": "I didn't know where this was filmed but it looked great then I noticed a graphitti on the walls (2:54) saying Dućan and Frizer (Дућан, Фризер)....SERBIA? :D OH MY, awesome! Please come back!",
            "name": "Elva Rose",
            "id": 5
          },
          {
            "comment": "I love this!! this is my favourite song on the album, this is awesome",
            "name": "Tasha Bullock",
            "id": 6
          }
        ],
        "artworkUrl": "https://f4.bcbits.com/img/a2238801412_16.jpg",
        "coverUrl": "https://f4.bcbits.com/img/a2238801412_16.jpg",
        "songtitle": "SOG",
        "bandname": "Ockney",
        "id": 6
      }
    ],
    "kuratorImg": "http://placehold.it/700x700",
    "kuratorDescription": "Non aute cillum veniam pariatur fugiat nisi occaecat cupidatat incididunt ullamco laborum nulla duis. Sit eiusmod amet culpa exercitation eu dolore exercitation minim ut dolore. Commodo est enim labore esse dolore exercitation esse. Non occaecat dolore dolore sint.",
    "kuratorName": "Shaffer Chang",
    "kuratorId": 653
  }
]