[
  {
    "entries": [
      {
        "comments": [
          {
            "comment": "If you said early 90s alternative rock to me my mind would conjure up something similar to this grunge tinged power pop album. I like this sort of music but the only memorable feature about this album is that Juliana has a pretty voice. President Garfield is an ode to Henry Rollins, original name Henry Garfield.",
            "name": "Marc Miller",
            "id": 0
          },
          {
            "comment": "I recently came to the conclusion that whether or not an album would grab me in the first place ultimately depends one thing: circumstances. I mean, other than that, how would you explain that it took me no less than fifteen years to finally get this album? We're talking about a rather straightforward alt rock album, this ain't no friggin' Trout Mask Replica for Christ's sake! Or maybe I'm just stupid. Anyway, I bought Become What You Are back in 1995, right after being blown away by Juliana's third album, the immaculately perfect Only Everything, and for a reason still unknown to me (that is, until recently), I didn't like it. So I put it aside, quite disappointed, and eventually forgot about it. Years passed, then a few weeks ago I gave a spin to Only Everything and found myself caught into some sort of time machine which brought me back to my joyful teenage years. I decided that Become What You Are was up for another chance, and rightfully so! Although I still prefer Only Everything (probably out of nostalgia, but I still feel it's more consistent), I really think this is Juliana at her most pristine: sweet voice, crunchy guitars and irresistible hooks.",
            "name": "Phil Collins",
            "id": 1
          },
          {
            "comment": "This is probably the most rocked out of her albums, almost bordering on a grunge sound and although the sweet melodies and adolescent angst / power pop of her later albums are somewhat hidden by this there is still enough in tracks such as Feelin Massachusetts and Spin the Bottle for those who prefer 'indie pop Julianna'.",
            "name": "Peter Meier",
            "id": 2
          },
          {
            "comment": "Probably her best known and most consistant record.  It's short (clocking around 40 minutes), concise and for some reason, it doesn't feel as confessional or heavy.  it's 12 songs, good melodies, pleasent singing and not a bad song in the bunch.  it's definitely the one to go with if you're new to hatfield's songwriting.  but it lacks a lot of hatfield's heart-wrenching and maybe even embarassing confessional lyrics that really endears her to people, which depending on your point of view, is either a severe handicap to her music or is a source of brilliance.  so in that way, Become What You Are, may seem a water-down version of hatfield for mass consumption, but it's a strong record none the less.",
            "name": "Deborah Norman",
            "id": 3
          },
          {
            "comment": "this used to be one of my favorite albums when i was like 17. i had a huge crush on her because i found her to be interesting musically and extremely cute. i wish i still had the album because it was really good, if i recall. haven't heard it in years though, so it might not hold up...",
            "name": "Audrey Noel",
            "id": 4
          },
          {
            "comment": "This is probably the most rocked out of her albums, almost bordering on a grunge sound and although the sweet melodies and adolescent angst / power pop of her later albums are somewhat hidden by this there is still enough in tracks such as Feelin Massachusetts and Spin the Bottle for those who prefer 'indie pop Julianna'.",
            "name": "Ray Pena",
            "id": 5
          }
        ],
        "imgUrl": "a0265022005_10",
        "duration": "04:31",
        "country": "USA",
        "songtitle": "Paris",
        "bandname": "M|O|O|N",
        "id": 0
      },
      {
        "comments": [
          {
            "comment": "I'm glad this album has shown up in Juliana's profile, ridiculous that her best album should be filed seperately under 'The Juliana Hatfield 3' as it had been.  You don't see them doing that with Ryan Adams or Neil Young. One of the highest points of 90s alternative music.  Great production by Scott Litt and twelve terrific, unpredictably structured, fuzztone-soaked catchy Juliana tunes.",
            "name": "Jeanne Smith",
            "id": 0
          },
          {
            "comment": "This album is a bit of an odd collection of songs, signing with Warner they brought in REM producer Scott Litt who has an ear for a hit and this shows up but Juliana seems a little uneasy singing all the extra harmonies and commercialized stuff like the organ in 'For The Birds'. This was a tight group of musicians, Dean Fisher laid a tight bass line, Todd Philips is a capable drummer and Juliana puts down the bass completely on this album and picks up her Gibson S.G. This album is best remembered for minor hits 'My SIster' a song about a made up sister showing envy and admiration and that searing distortion guitar break and 'Spin The Bottle' featured on Reality Bites, an acoustic camp fire jangle of a song. Really, it's an album of two halves, the first side is indie rock college friendly melodic songs with some tasty guitar riffs and manufactured rrriot grrl/kick ass attitude (especially Supermodel and A Dame With A Rod), My Sister, This Is The Sound (of a tree falling down), For The Birds could almost have been titled 'For The Byrds' with it's west coast california jangle guitar through a shredder, organs and super sweet lyrics, it's actually close to being pop perfection, Mabel is the weakest track on side one but has some redeeming features, the shrill harmonic guitar break leading into the kick ass A Dame With A Rod. Unfortunately side 2 lacks the depth, catchiness and musical prowess of the first side, 'Addicted' and 'Feelin' Massachussets' sounding decidely B-Side material (especially compared to b sides 'Put It Way' and 'Ruth' from the singles released which would both have substituted better), Spin The Bottle has clever lyrics and breaks up the overdriven sound by being primarily an acoustic driven sound, president Garfield see Addicted/Feelin' Massachussets, however Little Pieces is a decent song with some variation from other songs on the album and then I Got No Idols closes it out on a rockier number but seems similar in texture and feel to A Dame With A Rod except without the cool riffs of the latter. This album has several highlights and side 1 is really strong but like another poster said it may have been better as a 10 song album or sub out a couple of weaker songs for 'Put It Away' or 'Ruthie' which appeared on My Sister and For The Birds singles.",
            "name": "Jefferson Watson",
            "id": 1
          },
          {
            "comment": "It's nothing special ... I guess that's all.  My Sister attracted me to this CD because I can somewhat relate to it.  Juliana has an average voice and kind of same-same lyrics but she's made some great tunes here like the truthful opener Supermodel or the harsh sounding A Dame with a Rod.  I Got No Idols ends the disc on a high note as well.  A decent record.",
            "name": "Hardy Booth",
            "id": 2
          },
          {
            "comment": "I'm glad this album has shown up in Juliana's profile, ridiculous that her best album should be filed seperately under 'The Juliana Hatfield 3' as it had been.  You don't see them doing that with Ryan Adams or Neil Young. One of the highest points of 90s alternative music.  Great production by Scott Litt and twelve terrific, unpredictably structured, fuzztone-soaked catchy Juliana tunes.",
            "name": "Obrien Wilkerson",
            "id": 3
          },
          {
            "comment": "Sometimes the lyrics are so bad they make you cringe, but the music carries the day.",
            "name": "Gallegos Stevenson",
            "id": 4
          },
          {
            "comment": "Mercifully brief, catchy, bouncy twee. It's not that different from the other bands doing this sort of thing but at least, it's cute.",
            "name": "Tate Burgess",
            "id": 5
          },
          {
            "comment": "I originally heard this band in the movie But I'm A Cheerleader and thought it sounded quite nice, an entire album of quite nice isn't as great as anticipated.  They sound much like Go Sailor or perhaps Heavenly, the big difference is that this doesn't have the sarcasm of Go Sailor, nor the ambience that Heavenly offers, it is however very twee.  \"If You Should Try To Kiss Her\", and \"Just Like Henry\" were my favorites, but it was all a little too cutesy to appear important.  The harmonies are quite nice, and the music is well...a few chords, nothing impressive either but it makes do.  In the end, it's just alright, if you own albums by both of the forementioned bands, you will likely enjoy this, but I can't see this being anybody's favorite album.",
            "name": "Zamora Watson",
            "id": 6
          }
        ],
        "imgUrl": "a1699573444_10",
        "duration": "01:22",
        "country": "USA",
        "songtitle": "In The Field With Brian",
        "bandname": "Datach'i",
        "id": 1
      },
      {
        "comments": [
          {
            "comment": "From what I understand, this is Andy Partridge's growing up album.  Accepting the joys of fatherhood and home life.  That's not to say that it's all sweetness and light here.  'The Smartest Monkeys', 'Books Are Burning', 'War Dance' and 'The Ugly Underneath' are hardly happy themes.  But songs like 'Holly Up on Poppy', 'My Bird Performs', 'hen She Appeared' and 'Humble Daisy' are simply joyful.  'Humble Daisy' is one of my favorites with it's rich harmonies, and Pet Sounds inspired sound.  Also 'Wrapped in Grey' is absolutely beautiful.",
            "name": "Tisha Petty",
            "id": 0
          },
          {
            "comment": "Excellent Album",
            "name": "Morrison Pierce",
            "id": 1
          },
          {
            "comment": "This is good but I feel it loses steam in those last 3 songs.  Books are Burning and War Dance are too on the nose.",
            "name": "Virgie Rivers",
            "id": 2
          },
          {
            "comment": "I first heard Dressy Bessy in the film But I'm A Cheerleader and immediately wanted to know more of their music. The film features 'Just Like Henry' and 'If You Should Try To Kiss Her' both of which are perfectly used in the movie and two of the best \"I've got a crush on you\" pop songs around. When I finally found and listened to \"Pink Hearts...\" I was pleased to learn that the whole album was just as great as the two songs from the film. Of their  full length albums, I would recommend this over Sound Go Round or Little Music. I would definately recommend this CD to anybody who likes catchy and upbeat hooks and likes to drive with the windows open while singing along... Capable of turning a beautiful summer day into technicolor.",
            "name": "Rogers Weeks",
            "id": 3
          }
        ],
        "imgUrl": "a3638331332_10",
        "duration": "04:53",
        "country": "AT",
        "songtitle": "Follow The Body",
        "bandname": "Zanias",
        "id": 2
      },
      {
        "comments": [
          {
            "comment": "Nonsuch has a very similar vibe and flow as the ones found on Skylarking. A pretty similar pastoral approach, but in a more relaxed and contained way. The band sounds much more calm and mature, but the overall feeling is pretty similar. OK, it might not be as brilliant and as mindblowing as Skylarking, but it isn’t too far from it. I mean it. I guess it’s not too far fetched to say that Nonsuch is actually Skylarking Part II, made 6 years after.  A definitely must have and one of the best XTC albums. Their third best, actually (only behind the already cited Skylarking and English Settlement). Go. Get it. Now.",
            "name": "Blanca Short",
            "id": 0
          },
          {
            "comment": "Just when you thought they were lost forever, XTC came up with Nonsuch. And what a delight it is after two terrible weak outputs. When music and melody had totally lost direction and were wandering all over the place on Skylarking and Oranges & Lemons, they found their way back again on this one. To-the-point excellent songs.",
            "name": "Bryant Atkinson",
            "id": 1
          },
          {
            "comment": "Barren American college rock takes over after some critics and fans weren't too happy with the 80s overkill on preceding album 'Oranges And Lemons'. Not a good idea, especially when much of the songwriting isn't all that enticing either. However, with two of Partridge's best ever compositions on board, there's some solace in the album's second half. 'Wrapped In Grey' and 'Rook' are steeped in the Beach Boys ballad tradition that plays both to the band's strength - appropriating disparate musical styles by assiduously studying other folks' compositional methods - and also to their weakness - being shameless copyists, mostly in their later period. Surely a single record would have sufficed, it's a shame when the first five tracks of an XTC album leave me cold altogether. I enjoy about a handful of tracks, the rest I can take or leave. Highlights: Wrapped In Grey, Rook, The Disappointed, Omnibus, Bungalow",
            "name": "Maricela Branch",
            "id": 2
          },
          {
            "comment": "Pete Pumpkinhead is excellent.  This album reminds me a lot of English Settlement; it's a pretty odd mesh, and there's a lot of good music on here.  My favourite of their three-album comeback.",
            "name": "Marva Woodard",
            "id": 3
          },
          {
            "comment": "i am everyone who has ever lived in vermont and the snow is in my  veins, glowing",
            "name": "Owens Riley",
            "id": 4
          },
          {
            "comment": "Well folks here it is, the album of all albums in REM's catalong, the monumental Automatic for the People is known as one of the most important albums of the 90's and it was also very popular with teenagers and young adults and gen X'sers everywhere. This album is the peek of there comercial career and is also the most mature and polished of there big albums. This one does not have there landmark single Losing my religion but the result is nothing less beautiful then that monunumental song. This one is the REM we all knew and loved in the 90's the band that sold out stadiums, got played on the radio, and was just beautiful. Hearing songs like listening Drive, Monty got a raw deal, man on the moon and Ignoreland make you want to get up and dance, and beautiful emotional tracks like Everybody hurts, and Nightswimming sound beautiful in the context of this album. In short make sure to put this on your list of 90's albums to have, you need to hear it to appreciate 90's music even if you dont like it. The cultural apex of R.E.M.'s brilliant career.",
            "name": "Augusta Gallagher",
            "id": 5
          },
          {
            "comment": "that dog. - that dog. the three vocal tracks are sure to be irresistable to a lot of people. they almost sound choral, which is a good thing. their songs are brutally catchy and summery. the violin sounds as if it's in the brink of madness. this is one addictive record.",
            "name": "Valenzuela Justice",
            "id": 6
          }
        ],
        "imgUrl": "a2114074940_10",
        "duration": "03:55",
        "country": "USA",
        "songtitle": "The Meat",
        "bandname": "Stove",
        "id": 3
      },
      {
        "comments": [
          {
            "comment": "It's an atmosphere like no other. Cocteau Twins created a complete, seamless, self-contained celestial body with this collection of songs. One of my very favorite albums of all time. Straight though, this is a beautiful, luxurious world of its own.",
            "name": "Hull Velazquez",
            "id": 0
          },
          {
            "comment": "Yes, I have this tagged as 'life-changing,' because it was in several ways for me, even though I really only listen to three songs from it now ('Ring,' 'Road,' and 'Foxes').  I was with my dad when he bought it in '90 or '91, and I always saw it sitting there in the CD cabinet under the TV, but never actually listened to it until '96.  This was the year that I started getting into shoegaze & dream pop, so this disc (along with both of MBV's albums and Psychocandy) was kind of the catalyst for that.  I always thought it was kind of my little secret, so I was amazed to learn later that this band has such a huge worldwide following.",
            "name": "Jordan Romero",
            "id": 1
          },
          {
            "comment": "I love these four songs....wait scratch that three songs.  I find The raft song just too weird for me.  Now mind you My Seventh Rib and Eating Styes From Elephant Eyes are very weird but there is just something really awesome about them and of course this is no surprise coming from The Shins.  It's sound is very primal in the newly formed Shins band.  They were of course previously called Flake Music and you certainly hear a tinge of Flake Music's style, however, this is definately a new transition into the beautiful present that has become The Shins.  This album would definately 'disgust' a regular person listening to The Shins for the first time.  It takes a attained appreciation to really enjoy these songs on this album.  Nevertheless this is certainly a great start for The Shins and we have seen their evolution in their two full-length albums Oh, Inverted World and Chutes Too Narrow. I would definately suggest anyone that really likes The Shins to listen to these four songs: Those Bold City Girls, Eating Styes From Elephant Eyes, My Seventh Rib, and We Built The Raft and Floated. BTW: anyone know how i cant get my hands on this EP? Thanks",
            "name": "Bridget Walters",
            "id": 2
          },
          {
            "comment": "Pardon the repetition but this really does resemble Alien Lanes Kronz is quite right.  It's very much dead inbetween Flake Music and The Shins sound wise, a bit fuzzier perhaps than the Shins most are accustomed to.  It is a very short E.P., but the tracks are really fantastically infectious, worth hunting for the mp3s (apparently this is impossible to find).  Definitely some of the best music I've ever heard from The Shins, and I think they are pretty darned awesome!",
            "name": "Cameron Dejesus",
            "id": 3
          },
          {
            "comment": "There's some really good stuff on here. I mean, Billy Corgan was arguably the most prolific songwriter of the '90s and it's records like this that remind you that even his scraps were worthy of a listen. My personal favorites are 'Lucky 13', 'Because You Are', 'Marquis In Spades', 'Here's To The Atom Bomb', 'Waiting', 'Set The Ray To Jerry', and 'Soot & Stars'. Pretty good for a 'greatest misses' record. Get it if not to hear Jimmy Chamberlain put forth some of his best performances on 'Lucky 13' and 'Set The Ray To Jerry'",
            "name": "Olson Talley",
            "id": 4
          },
          {
            "comment": "Note: this is a review of both and the rating reflects that. The first disc is a good compilation. It showcases most of the band's best known songs, and a cover that has become fairly famous (though it is pretty straightforward). The only problem with it (aside from it being a 'greatest hits' album) is that there are two songs on it that clearly don't belong. As with so many of these things, someone has stuck on some 'new' material in the hope that this too becomes successful. Oops. The second disc is less consistent, but that is obviously to be expected since it is a rarities comp.  About half of it isn't new exactly, so that sort of defeats the purpose. And it's hardly complete. But it's still solid for what it is.",
            "name": "Faye Dale",
            "id": 5
          },
          {
            "comment": "Solid,whimsical and fun that's That Dog,reminds me of my truant escapades I'd take with my cronies and we'd take a road trip to New Hope,PA and look for Ween. Did I mention these songs are fun?Yes I did. \"Zodiac\",\"Family Functions\" and \"Just Like Me\"get me all nostalgic about me days as a handsome carefree teenager,boo hoo hoo!",
            "name": "Reva Sheppard",
            "id": 6
          },
          {
            "comment": "The official album material is from beyond. Absolutely amazing songs, some of them being even psychedelic. And I Put a Spell on You is almost shamanistic. This 40th anniversary edition I'm having, also includes great tracks.",
            "name": "Smith Lyons",
            "id": 7
          }
        ],
        "imgUrl": "a4248200798_10",
        "duration": "03:05",
        "country": "DE",
        "songtitle": "es6/a",
        "bandname": "arovane",
        "id": 4
      },
      {
        "comments": [
          {
            "comment": "As far back as the very first Beatle release, their albums had a contextual feel.  With the release of the singles “Penny Lane,” and “Strawberry Fields,” followed by the albums ‘Revolver,’ ‘Sgt. Pepper,’ and ‘Magical Mystery Tour,’ the Fab Four seemed to be uniting the world through a charismatic set of themed albums revolving around the Flower Power movement, psychedelic drugs, and the ability to be able to draw us all together, united in a stance not only against the war in Vietnam, but in the power this new generation had in their hands, to change the course of social and political events.  While there were signals of disillusion, and troubles within the band, as found on the George Harrison song “Blue Jay Way,” I think we all saw this as typical issues any group or family are destined to have, especially when they have worked so closely for so many years. And the ‘White Album’ was just as prophetic in its on way.  I remember hearing it not only for the first time, but the second, and third time ... and thinking that though the songs were well crafted, there was something lacking.  The music seemed disjointed, like light refracted through a prism, with most of the songs more than notably written by single members of the band.  Some songs seemed to be pulled or left over from other adventures, leaving me with a shattered, schizophrenic feeling ... there was nothing inter laced, nothing tying the songs together.  This feeling was not lost on most fans, yet these were The Beatles, a group who had taken us on a serious journey, collimating in a series of climatic musical ecstasies, the peak of the trip, a feeling I never wanted to leave my body. But here on the ‘White Album,’ there was nothing I could warm up to.  The 'White Album' felt like the ‘crash,’ the day after the ‘trip,’ when the excesses of speed that the LSD had been cut with showed their head, leaving me with an uncomfortable feeling ... one of uncertainty, pending doom, and a disconnection to say the least ... a feeling I just wanted to sleep through, wake up and find that all of the music on this double release made sense. I had to set this record aside for a very long time, going to places like Vietnam, where the world actually was schizophrenic.  And now, nearly forty years later, while I have come to appreciated the songs as a very good grouping of music, I still see the ‘White Album’ as the light at the end of the tunnel, a tunnel that had once bathed and warmed me in strobing colours, psychedelic sensuality, pleasantly distorted shapes that would bend and ebb, as musical notes, like breezes changed my total perception ... I thought the light at the end of the tunnel would be more this, but then as The Beatles had grown up, so had I, and I was left with the reality that most things are not what they seemed.",
            "name": "Kathrine Berger",
            "id": 0
          },
          {
            "comment": "This album contains some amazing songs (such as Harrison's While My Guitar Gently Weeps) and really bad songs (such as Happy Birthday).  If half of the songs were cut out, this would be a great album.",
            "name": "Brennan Vinson",
            "id": 1
          },
          {
            "comment": "Dear Prudence, While My Guitar Gently Weeps, Happiness is a Warm Gun, Blackbird, Mother Nature's Son, Back in the U.S.S.R., and Glass Onion.  That there's the highlights.  And what incredible pieces of music they are... The rest, with some exceptions, is pretty ordinary.  I mean, it's still the Beatles, but I just can't get into most of this album. Revolver...",
            "name": "Robinson Dominguez",
            "id": 2
          },
          {
            "comment": "Good, not essential debut album. \"Walk on the water\" is great, \"Suzy Q\" is good but too long. \"I Put a spell on you\" is an excellent cover. Remainder is so-so.",
            "name": "Katheryn Horton",
            "id": 3
          },
          {
            "comment": "It´s ghard to comment on this record knowing what will come after this one. Two hits that at the same time were covers from other group do not make me feel like rating this one high. There is no point in comparing this record to later ones anyway. I wonder what was the impact of this country-rock-southern-foggerty at that time.",
            "name": "Chang Flynn",
            "id": 4
          },
          {
            "comment": "Creedence Clearwater Revival's self-title debut album opens  brilliantly with the raw cover of Hawkins' \"I Put A Spell On You\". Most of the great songs on this album are covers. \"Susie Q\" has some fine moments and features one of CCR's trademark jams. \"Ninety-Nine and a Half\" is also good. John Fogerty's composing hadn't fully matured at this point, yet he still managed to put out a couple of original blues, the pop of \"Porterville\", and the soulful \"Walking on the Water\" (his best on the album). An excellent debut, and a great place to start with CCR.",
            "name": "Kelley Talley",
            "id": 5
          },
          {
            "comment": "ACCR is one of the best groups of all time. All of their singles were excellent, the best if Band On The run. This album is one of the best albums of all time, if not the best!",
            "name": "Harriett Kaufman",
            "id": 6
          },
          {
            "comment": "Good debut. Their version of \"Suzie Q\" is the highlight, but the second half (composed by all Fogerty's originals) is also worthy the price.",
            "name": "Wiggins Green",
            "id": 7
          }
        ],
        "imgUrl": "a2493087453_10",
        "duration": "04:12",
        "country": "RUS",
        "songtitle": "Cry Wolf - Losing You",
        "bandname": "D-Noise",
        "id": 5
      },
      {
        "comments": [
          {
            "comment": "Mayhem. Insanity. Beautiful Perfection.",
            "name": "Dennis Wood",
            "id": 0
          },
          {
            "comment": "No album has as many good songs as this one.I think it's the beatles at their best all of them contributing to make this a great sucess with ringo's don't pass me by one of the album high lights. If you where to bring an album to a desert island it would have to be this because with all the diverse styles and songs soft(Dear Prudance),hard(Helter Skelter) Revoulutionary (Revoulution 1) Provucitive (my don't we do it in the road) Great story telling (roccy racon)and poetic (Blackbird) as well as the bizzare (Revoulution 9) Best Songs; Obla-Di-Oabla-Da , While my Gutair Gently Weeps and Helter Skelter",
            "name": "Ramirez Good",
            "id": 1
          },
          {
            "comment": "The irrevocable, unequivocally fantastic quality of music, the reason I love the stuff to such a gargantuan extent, is its ability to capture within its sound every element of the world around it. Music ingrains itself into a time and place of life and takes from the fertile soil all that makes the scene so significant, be it people, smells, sights, sensations, emotions, words—anything. Some capture the worst, lowest moments of our lives where we felt truly broken; others allow us to relive the brightest stars of our nights. The Con, for me, is both of these at once. On the surface, Tegan and Sara came from one wondrously brief encounter with a rare breed of woman, the kind that you don't find more than once in a decade; she had the insatiable ability to completely and totally enthrall and imprison me in every facet of life. Everything she did was done to perfection; she seemed to have no flaws; she seemed to greatly mirror my greatest qualities; she shared my greatest, most fiery passions. I was hooked. We danced and sang, we exchanged mix CDs and dressed in costume. We had a gloriously brief time together, and Tegan and Sara still to this day reflects all that I saw in that picturesque blip of life. I got Tegan and Sara from this girl. But, with the good memories come tinged a shade of melancholic longing, a frustration that the affair didn't last longer, didn't burn hotter, didn't delve deeper. The only solace I have at the dissolution is that, in her fitted perfection, she didn't even extinguish me when she let me go. I have no deep, lasting scars from her. It is in this light, the full light, that I see Tegan and Sara, and especially the Con: despite the barraging energy exuded from each song of this album, there is that lurking dissonance, that bit of frustrated and loathsome empathy that lies in every note the girls sing, and more over, each song comes and goes entirely too quickly, the album even ending long before it ought to at a meager 37 minutes. Still, I can't help but love it still.",
            "name": "Maryanne Guy",
            "id": 2
          },
          {
            "comment": "Okay, I can buy that they're lesbian twin sisters, but Canadian lesbian twin sisters?  That's just preposterous.",
            "name": "Elsa Holt",
            "id": 3
          },
          {
            "comment": "Every once in a long while an album will come along that catches hold of me and doesn't let go.  I become obsessed, and play the album on repeat, listening to nothing else for weeks on end.  This is one of those albums. The girl's fifth studio album, The Con, is superb in numerous ways.  Tegan and Sara use the best elements of pop, rock, and folk, and somehow create something entirely fresh and their own.  The music is excellent, hooky, pretty, and all around wonderful.  The lyrics and content are heartfelt, honest, and very beautiful.  This is an album I can definitely relate to, one of those albums with songs so special that they seem to magically capture that moment in your life as you listen to them.  But with this album, you don't just listen, you live it.  It's impossible to not be swept up in the emotions and stories that Tegan & Sara provide the listener with, not only making you appreciate what they were going through, but sending you back to relive your own memories.   Every single song is strong, and none feel forced or out of place. </br>Far and away my favorite T&S album, and I would reccomend it to any music fan.",
            "name": "Pansy Kelly",
            "id": 4
          },
          {
            "comment": "I have to say that the whole reason i picked up this album in the first place was because i heard T&S we're both lesbians and since i am also gay i figured i should at least give them a listen since we're 'family' ;-) What I wasn't prepared for was to be absolutely blown away by this album. It doesn't have a weak point that i can see and i've clocked about 75+ plays of this album over the last few months. The songs are short, catchy and contain some really memorable hooks. I would recommend this album to anyone who is likes simple but slightly edgy pop music! P.S They aint bad live either :-)",
            "name": "Elva Rose",
            "id": 5
          },
          {
            "comment": "I'm not sure I should like this album as much as I do... Mostly because it comes off a bit 'cutesy' at first. And cutesy music can either be really hit or miss with me. But Tegan & Sara are two talented lesbian twins that know how to write songs, and know how to write them both concisely and consistently. Throughout 'The Con's' 14 tracks, there are hardly any I'd consider less than strong, and all end leaving the listener wanting more rather than dragging on too long. These two have a knack for melody construction, and though their voices may allude to a sense of childhood 'cutesiness' or innocence, some of the lyrical topics do reach a certain level of darkness, especially on 'Knife Going In' or 'Dark Come Soon' or 'Burn Your Life Down' or... Come to think of it, the album is pretty dark overall o_o",
            "name": "Tasha Bullock",
            "id": 6
          },
          {
            "comment": "On this album, Blondie demonstrates that they can produce facile songs in a wide variety of genres -- orchestral bombast (\"Europa\"), disco-funk (\"Live It Up\", \"Do the Dark\"), proto-rap (the excessively lengthy \"Rapture\"), music-hall (\"Here's Looking at You\"), jazzy torch (\"Faces\"), and reggae (\"The Tide Is High\").  The last mentioned is the only one I really love -- the horn section is great.  (Not having heard the 1967 original, by The Paragons, or Gregory Isaac's 1978 cover, I don't know whether the horns are a new addition or simply a copy off one of the other versions.)  There are also several songs more in the old Blondie mold, such as the rather mysterioso \"Angels on the Balcony\" (I could almost picture the Doors doing this in one of their quieter moments), \"T-Birds\", \"Walk Like Me\", and the exuberant \"Go Through It\" (my other favorite on the album besides \"The Tide Is High\").  All in all, not a bad album, and in some ways more interesting than the albums they had done previously... but I'm not as likely to put it on.",
            "name": "Cathy Swanson",
            "id": 7
          }
        ],
        "imgUrl": "a0890959509_10",
        "duration": "09:22",
        "country": "CAN",
        "songtitle": "Because That's the Only Time There Is",
        "bandname": "People As Places As People",
        "id": 6
      }
    ],
    "kuratorImg": "http://placehold.it/700x700",
    "kuratorDescription": "It began as a simple idea back in the summer of 1999: a single score could summarize the many entertainment reviews available for a movie or a video game. Metacritic's three founding members—all former attorneys who were happy to find a more constructive but less profitable use of their time—launched the site in January 2001 and Metacritic has evolved over the last decade to reflect their experience distilling many critics' voices into the single Metascore, a weighted average of the most respected critics writing reviews online and in print. Metacritic's mission is to help consumers make an informed decision about how to spend their time and money on entertainment. We believe that multiple opinions are better than one, user voices can be as important as critics, and opinions must be scored to be easy to use.",
    "kuratorName": "Tameka Fowler",
    "kuratorId": 678
  }
]